---
title: Avoin kirje Sibelius-Akatemian rehtorille
excerpt: <span class="fi">In Finnish</span> Kritiikkiä ja parannusehdotuksia opiskelijan
  näkökulmasta.
date: '1999-09-19 21:38:55 +0200'
date_gmt: '1999-09-19 20:38:55 +0200'
categories:
- Sib-Aca
tags:
- Music
- Sibelius-Academy
image:
  path: /assets/images/social/sibelius_academy_logo.svg
---
<ul class="sibNav">
<li id="sibToc-0"><a title="Johdanto" href="#sib-ch-0">Johdanto</a></li>
<li id="sibToc-1"><a title="1. Opiskelun kesto" href="#sib-ch-1">1. Opiskelun kesto</a></li>
<li id="sibToc-2"><a title="2. Esteettiset arvot" href="#sib-ch-2">2. Esteettiset arvot</a></li>
<li id="sibToc-3"><a title="3. Sibelius-Akatemian asema" href="#sib-ch-3">3. Sibelius-Akatemian asema</a></li>
<li id="sibToc-4"><a title="4. Improvisoidun musiikin tila" href="#sib-ch-4">4. Improvisoidun musiikin tila</a></li>
<li>5. Parannusehdotukset
<ul>
<li id="sibToc-5_1"><a title="5.1 Parannusehdotus 1: Koulutuksen laajentaminen" href="#sib-ch-5_1">5.1 Koulutuksen laajentaminen</a></li>
<li id="sibToc-5_2"><a title="5.2 Parannusehdotus 2: Erilaisuuden suvaitseminen" href="#sib-ch-5_2">5.2 Erilaisuuden suvaitseminen</a></li>
</ul>
</li>
<li id="sibToc-6"><a title="6. Yhteenveto" href="#sib-ch-6">6. Yhteenveto</a></li>
</ul>
<div id="sib-ch-0">
<h3 >Arvoisa rehtori Pekka Vapaavuori, <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-0">^</a></h3>
<p id="intro">Olen jazzmusiikin osaston opiskelija ja kerron t&auml;ss&auml; kirjeess&auml; syyt t&auml;ydelliseen turhautumiseeni Sibelius-Akatemian ilmapiiriin, koulutukseen ja rajoittuneeseen arvomaailmaan.</p>
<p>Rehtorina olette varmasti tietoinen koulumme ongelmista, mutta haluan tarjota t&auml;ss&auml; kirjeess&auml; kritiikki&auml; ja parannusehdotuksia ruohonjuuritasolta ja opiskelijan n&auml;k&ouml;kulmasta. Toivon kirjeeni olevan hy&ouml;dyksi tuleville opiskelijoille ja koulumme kehitysty&ouml;lle. Haluan her&auml;tt&auml;&auml; keskustelua Sibelius-Akatemian nykytilanteesta ja p&auml;&auml;m&auml;&auml;rist&auml;. Olen yritt&auml;nyt esitt&auml;&auml; asiat rakentavasti, koska syytt&auml;minen harvoin johtaa tilanteen paranemiseen.</p>
<p>Omakohtaisten kokemusten lis&auml;ksi olen koonnut yhteen p&auml;&auml;piirteet suomalaisten, ruotsalaisten, norjalaisten, tanskalaisten, saksalaisten, amerikkalaisten ja islantilaisten muusikoiden ja opettajien kanssa k&auml;ydyist&auml; keskusteluista, sik&auml;li kuin ne sivuavat kirjeen aiheita. My&ouml;s useat opiskelutoverini ovat lukeneet tekstin ja lis&auml;nneet omia arvokkaita huomioitaan. Teksti on l&auml;hetetty my&ouml;s opintop&auml;&auml;llikk&ouml; Hannele Ketom&auml;elle, jazzmusiikin osaston johtaja Jarno Kukkoselle sek&auml; opiskelijoille s&auml;hk&ouml;postin v&auml;lityksell&auml;.</p>
</div>
<div id="sib-ch-1">
<h3>1. Opiskelun kesto ja p&auml;&auml;m&auml;&auml;r&auml; <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-1">^</a></h3>
<h4>1.1 Valmistumisaika</h4>
<p>Nykyinen opintosuunnitelma ylikouluttaa muusikoita kuvitteellisille ty&ouml;markkinoille. Oppilaitoksemme kohdalla akateeminen vapaus on tullut tiens&auml; p&auml;&auml;h&auml;n. Opinnot on muutettava enemm&auml;n koulumaisemmaksi siten, ett&auml; musiikin maisterin tutkinto rakentuu vuosikursseista ja ett&auml; se suoritetaan nelj&auml;ss&auml; vuodessa.Taideaineiden opiskelu eroaa muiden alojen opiskelusta ja taiteellinen kypsyminen on pitk&auml; prosessi. T&auml;m&auml; seikka mainitaankin usein perusteluna opintojen pitkittymiselle. T&auml;ss&auml; kuitenkin on juuri ongelman ydin. Taiteellinen ilmaisu on koko elini&auml;n kest&auml;v&auml; prosessi, joka vain saatetaan alkuun koulussa. Jazzmusiikin koko historia on t&auml;ynn&auml; erikoisia persoonallisuuksia, jotka ovat syntyneet oikeassa el&auml;m&auml;ss&auml; ilmaisun saadessa loistaa ilman kahleita. Improvisoituun musiikkiin on aina liittynyt vapaus, ja koulun tarkoituksena on antaa t&auml;h&auml;n vapauteen riitt&auml;v&auml;t v&auml;lineet, rakennuspalikat, joilla muusikko voi itse rakentaa musiikillisen ilmaisukanavansa, mik&auml;li h&auml;nell&auml; on kunnianhimoa ja lahjakkuutta siihen. Koulun teht&auml;v&auml;n&auml; ei todellakaan ole taiteilijoiden rakentaminen valmiin muotin mukaan. Opiskelu on vain v&auml;livaihe. Mik&auml;&auml;n koulu ei tee ihmisest&auml; taiteilijaa, ellei h&auml;n siihen itse pysty.</p>
</div>
<div id="sib-ch-2">
<h3>2. Opetuksen p&auml;&auml;m&auml;&auml;r&auml; ja esteettiset arvot <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-2">^</a></h3>
<p>Musiikkikorkeakoulun tulisi vaalia yleist&auml; positiivista ilmapiiri&auml; ja kannustaa oppilaita omaan tekemiseen. Oman &auml;&auml;nen l&ouml;yt&auml;minen tulisi olla etusijalla. Opetuksen tavoitteena tulisi olla monipuolisen musiikillisen sivistyksen tarjoaminen ilman, ett&auml; asioita laitetaan valmiiseen, keinotekoiseen arvoj&auml;rjestykseen.</p>
<p>Oppilaiden henkil&ouml;kohtaisen arvomaailman muuttaminen ei ole Sibelius-Akatemian teht&auml;v&auml;. Ei voida yksiselitteisesti sanoa, mik&auml; on hyv&auml;&auml; ja mik&auml; ei. Pit&auml;isi muistaa, ett&auml; jokaisessa muusikossa ja musiikissa on jotain hyv&auml;&auml;, eiv&auml;tk&auml; asiat ole niin mustavalkoisia kuin usein annetaan ymm&auml;rt&auml;&auml;. Kyse on vain siit&auml;, mit&auml; kukin arvostaa ja mihin rima asetetaan.</p>
<blockquote>
<p class="quote">Opetuksen tavoitteena tulisi olla monipuolisen musiikillisen sivistyksen tarjoaminen ilman, ett&auml; asioita laitetaan valmiiseen, keinotekoiseen arvoj&auml;rjestykseen.</p>
<p class="author"><cite>--Aki K&auml;rkk&auml;inen, syyskuu 1999</cite></p>
</blockquote>
<p>Esimerkiksi kuubalaista musiikkia olen kuullut jazzosastolla haukuttavan "harmonisesti k&ouml;yh&auml;ksi". Mielest&auml;ni t&auml;m&auml; "k&ouml;yhyys" on vain sanojan omassa p&auml;&auml;ss&auml;. Miksi esitys pit&auml;isi tuomita t&auml;ysin vain sen takia, ett&auml; kuulijan omaa estetiikkaa tai makua se ei miellytt&auml;nyt? T&auml;h&auml;n tuomitsemiseen sortuvat monet Sibelius-Akatemian oppilaat ja opettajat. Haukkuminen sy&ouml;vytt&auml;&auml; t&auml;llaisen kuulijan omalta muusikkoudelta pohjaa pois.</p>
</div>
<div id="sib-ch-3">
<h3>3. Sibelius-Akatemian asema Suomessa ja ulkomailla <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-3">^</a></h3>
<p>Uskon, ett&auml; maamme v&auml;h&auml;ttelev&auml; asenne kulttuuriin yleens&auml; on osatekij&auml; siihen, ett&auml; Sibelius-Akatemian asema on t&auml;ll&auml; hetkell&auml; eritt&auml;in kummallinen. P&auml;&auml;llisin puolin kaikki on hyvin, puhutaan korkeasta tasosta, kansainv&auml;lisyydest&auml; ja koulumme hyv&auml;st&auml; maineesta ulkomailla. Kouluamme ei kuitenkaan tunneta ulkomailla kovinkaan hyvin, ja jos tunnetaan, s&auml;vy on useimmiten negatiivinen. Tiedon ja osaamisen m&auml;&auml;r&auml; tunnustetaan, mutta samalla ihmetell&auml;&auml;n Sibelius-Akatemian ahdasmielisyytt&auml; ja eristyneisyytt&auml; muuhun Eurooppaan n&auml;hden. T&auml;m&auml; oli minulle suuri yll&auml;tys asuessani vuoden Ruotsissa. Suomalaisia jazzmuusikoita tunnetaan hyvin v&auml;h&auml;n ulkomailla, ja kannattaisikin mietti&auml; miksi n&auml;in on. P&auml;&auml;syyn&auml; t&auml;h&auml;n on varmasti improvisoidun musiikin melkein olemattoman lyhyt perinne Suomessa. Oleskelu Suomen rajojen ulkopuolella auttoi n&auml;kem&auml;&auml;n asiat eri perspektiivist&auml;, ja Sibelius-Akatemian ja koko Suomen eristyneisyys tuli t&auml;ss&auml; tapauksessa eritt&auml;in selv&auml;ksi.</p>
</div>
<div id="sib-ch-4">
<h3>4. Improvisoidun musiikin tila Suomessa <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-4">^</a></h3>
<p>Jazzmusiikki on syntynyt Yhdysvalloissa, mutta nyky&auml;&auml;n jazzin tulevaisuus on selke&auml;sti enemm&auml;n Euroopassa ja kansallisissa vaikutteissa. Suomessa t&auml;t&auml; ei k&auml;sitet&auml;, ja osittain t&auml;st&auml; johtuu, ettei k&auml;sitett&auml; "suomalainen jazzmusiikki" ole olemassakaan. Muissa pohjoismaissa on kussakin maassa ominainen improvisoidun musiikin &auml;&auml;nimaailma, esimerkiksi Norjan jazzmusiikissa on alueelle tyypillinen sointi. Suomessa soitettavan jazzmusiikin ongelma on, ett&auml; suhtaudumme yliarvostavasti amerikkalaiseen yhteiskuntaan ja musiikkiin. Suomi lieneekin Euroopan amerikkalaistuneimpia maita. Suuri osa maassamme soitetusta improvisoidusta musiikista kuulostaa kopioidulta amerikkalaiselta jazzmusiikilta. Asiaan vaikuttaa varmasti se, ett&auml; jazzmusiikin osasto ottaa vieraileviksi opettajiksi mieluummin amerikkalaisia kuin pohjoismaisia tai eurooppalaisia muusikoita. Maassamme korostetaan todella paljon musiikillisen tiet&auml;myksen merkityst&auml;, aivan kuin se olisi itseisarvo ja kertoisi jotain kulloisenkin muusikon tasosta. Asiaan ei varmaankaan ole odotettavissa parannusta niin kauan kuin peit&auml;mme omat juuremme. Klassisessa musiikissa Suomen identiteetti kuuluu paljon selvemmin, mik&auml; varmasti johtuu pitemm&auml;st&auml; perinteest&auml; t&auml;m&auml;n musiikin saralla.</p>
</div>
<div id="sib-ch-5_1">
<h3>5. Parannusehdotukset <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-5_1">^</a></h3>
<h4>5.1 Koulutuksen laajentaminen</h4>
<p>Suomeen pit&auml;isi perustaa 2--3 musiikkikorkeakoulua lis&auml;&auml;, jotta musiikin koulutus laajenisi ja Helsinki-keskeisyydest&auml; p&auml;&auml;st&auml;isiin eroon. Ruotsissa on useita musiikkikorkeakouluja, ja siell&auml; muusikoiden v&auml;linen kanssak&auml;yminen on paljon terveemm&auml;ll&auml; pohjalla kuin t&auml;&auml;ll&auml;. Nyky&auml;&auml;n tilanne on se, ett&auml; muusikot asuvat ja opiskelevat Helsingiss&auml;, mutta k&auml;yv&auml;t keikoilla kaikkialla muualla paitsi Helsingiss&auml;. T&auml;m&auml; on selv&auml; merkki siit&auml;, ettei p&auml;&auml;kaupunkimme pysty kantamaan eik&auml; el&auml;tt&auml;m&auml;&auml;n n&auml;in suurta m&auml;&auml;r&auml;&auml; muusikoita. T&auml;m&auml; puolestaan johtaa eritt&auml;in negatiiviseen kilpailuun ja hukkaenergiaan.Tilanne on saatava aukeamaan, ja juuri koulutuksen laajentaminen koko Suomen alueelle ja opintosuunnitelmien uudistaminen johtaa tilanteen osittaiseen paranemiseen. T&auml;m&auml; my&ouml;s vilkastuttaisi ja tervehdytt&auml;isi maamme tunkkaista musiikkiel&auml;m&auml;&auml; huomattavasti sek&auml; loisi laajempaa perinnett&auml;, jolloin my&ouml;s valtio her&auml;isi tukemaan kulttuuriel&auml;m&auml;&auml; enemm&auml;n. Suomen kaltaisessa kulttuurin aliarvostuksen maassa t&auml;m&auml; on paljon vaadittu ja vaatisi suuret resurssit, mutta se my&ouml;s tehokkaasti tuulettaisi nykyist&auml; sairaalloista ilmapiiri&auml;, ja loisi kilpailua valmistuvien opiskelijoitten m&auml;&auml;r&auml;ss&auml;. Nyky&auml;&auml;n Sibelius-Akatemia kilpailee vain itsens&auml; kanssa laihoin tuloksin. Tilanne ei voi jatkua nykyisenlaisena en&auml;&auml; kovin montaa vuotta. Ihmettelen, miksei julkisuudessa puhuta enemm&auml;n Sibelius-Akatemian suurista identiteettiongelmista. Puhutaan vain siit&auml;, ettei valmistuneiden opiskelijoiden m&auml;&auml;r&auml; tilastoissa n&auml;yt&auml; hyv&auml;lt&auml;. Julkisuudessa pit&auml;isi puhua siit&auml;, ett&auml; Sibelius-Akatemian opiskelijat voivat pahoin ja n&auml;&auml;ntyv&auml;t tietotulvan ja suorituspaineiden alle. Miten t&auml;llainen muusikko pystyisi soittamaan ilmeikk&auml;&auml;sti ja persoonallisesti? Onko meill&auml; todella varaa uhrata monta lahjakasta muusikkoa, kunhan vain pidet&auml;&auml;n v&auml;kisin kiinni nykyisist&auml; ep&auml;realistisista opetussuunnitelmista ja Sibelius-Akatemian yksinvaltiaan asemasta maamme korkea-asteen musiikkikoulutuksessa?</p>
</div>
<div id="sib-ch-5_2">
<h4>5.2 Opetuksen ilmapiiri ja erilaisuuden suvaitseminen <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-5_2">^</a></h4>
<p>Nykyisess&auml; musiikinopetuksessa haetaan koulutettavuutta ja mahdollisia valmistujia nuorista opiskelijoista, mik&auml; on tietysti aivan luonnollista. Musiikissa ei kuitenkaan ole ik&auml;rajoja. Opintosuunnitelmat t&auml;ht&auml;&auml;v&auml;t oppilasmateriaalin tehokkaaseen aivopesuun ja kloonaamiseen luovan potentiaalin kustannuksella.Musiikki voi parhaimmillaan olla vapautunutta ilmaisua, iloa, tuskaa, tunnetta, reagointia ja kommunikointia sek&auml; musiikillisesti ett&auml; kansainv&auml;listen kontaktien kautta. T&auml;ll&auml; hetkell&auml; opetuksen ilmapiiri on eritt&auml;in suorituskeskeinen, musiikin tyylej&auml; karsinoiva, j&auml;ykk&auml;, suvaitsematon ja rajoittunut. Henkiset arvot ja musiikin tunneper&auml;inen kokeminen on j&auml;tetty taka-alalle. Suvaitsemattomuudella tarkoitan t&auml;ss&auml; yhteydess&auml; sit&auml;, ett&auml; oppilaat tasap&auml;istet&auml;&auml;n. Persoonallisuuksia ei suvaita, vaan ne tukahdutetaan. Musiikin opetus on alistettu kaikkitiet&auml;v&auml;n analyysin, kyynisyyden ja suomalaisen negatiivisuuden raskaan painon alle. Ihmisl&auml;heisyys, jokaisen yksil&ouml;n arvostus ainutlaatuisena muusikkona on korvattu kylm&auml;ll&auml; tietotulvalla, jonka jokaisen pit&auml;isi hallita voidakseen valmistua musiikin maisteriksi yhteiskuntaan, joka arvostaa tietoa yli kaiken.</p>
<blockquote>
<p class="quote">Soittaminen on luonnollinen asia, eik&auml; siit&auml; pit&auml;isi tehd&auml; vaikeampaa kuin se on. Jazzmusiikin soittajien tulisi laskeutua alas norsunluutorneistaan ja soittaa musiikkia ihmisille.</p>
<p class="author"><cite>--Aki K&auml;rkk&auml;inen, syyskuu 1999</cite></p>
</blockquote>
<p>On hyv&auml;, ett&auml; oppilailta vaaditaan paljon. Jazzmusiikin osastolla t&auml;m&auml; periaate on kuitenkin toteutettu v&auml;&auml;rin. Amerikkalainen rankaisupedagogiikka ei sellaisenaan toimi Pohjoismaissa. Soittaminen on luonnollinen asia, eik&auml; siit&auml; pit&auml;isi tehd&auml; vaikeampaa kuin se on. Antamalla oppilaan olla oma itsens&auml; ilmaisu vapautuu. T&auml;m&auml;n seurauksena my&ouml;s kanssasoittajat vapautuvat, jolloin koko yhtye kuulostaa paremmalta. Tunnelman, ajatuksen tai musiikillisen idean v&auml;litt&auml;minen kuulijoille ja kanssamuusikoille on mielest&auml;ni musiikin, ja miksei my&ouml;s muunkin el&auml;m&auml;n, ydin. Soiton ilo ja taiteellisuus eiv&auml;t ole toisiaan poissulkevia tekij&ouml;it&auml;. Juuri tekemisen ja erehtymisen kautta p&auml;&auml;st&auml;isiin musiikin ytimeen i&auml;nikuisen kylm&auml;n tarkastelun sijaan. Jazzmusiikin soittajien tulisi laskeutua alas norsunluutorneistaan ja soittaa musiikkia ihmisille.</p>
<p>Opetuksen profiili on ep&auml;selv&auml;. En tied&auml; koulutetaanko meit&auml; ty&ouml;tt&ouml;miksi muusikoiksi vai huonosti motivoituneiksi opettajiksi liian v&auml;h&auml;isell&auml; pedagogiikalla. Pedagogiikkaa tulisi lis&auml;t&auml; ja opintoviikkom&auml;&auml;r&auml; pudottaa 160:een, kuten yliopistoissa yleens&auml; ja musiikkikorkeakouluissa esim. Ruotsissa. P&auml;&auml;sykokeeseen pit&auml;isi kuulua haastattelu, jossa selvitett&auml;isiin pyrkij&auml;n motivaatiota ja ajatusmaailmaa. T&auml;ll&auml; hetkell&auml; on mahdollista p&auml;&auml;st&auml; sis&auml;&auml;n soittamalla vain ulkoa opittuja kuvioita. Koko Sibelius-Akatemia kaipaa enemm&auml;n yhteisty&ouml;t&auml; eri osastojen v&auml;lill&auml;, enemm&auml;n kokeilevaa toimintaa. Esimerkiksi jazzosastolla on vaikeaa saada s&auml;vellysopettajaksi klassisen musiikin s&auml;velt&auml;j&auml;&auml;. Osaston on vaikea k&auml;sitt&auml;&auml; sit&auml; tosiseikkaa, etteiv&auml;t s&auml;vellystekniikat riipu kirjoitettavan musiikin tyylist&auml;. T&auml;llainen ahdasmielisyys on yksi jazzosaston ominaispiirteist&auml;. Oppilailla pit&auml;isi olla mahdollisuus valita opettajansa yli osastorajojen. Nykyopetusta leimaa vahvasti musiikin eri tyylien v&auml;kivaltainen erittely toisistaan, ja t&auml;m&auml; on tyypillinen ominaispiirre koko Suomen musiikkiel&auml;m&auml;ss&auml;, ei pelk&auml;st&auml;&auml;n Sibelius-Akatemiassa. T&auml;m&auml; johtaa siihen, ett&auml; ihmiset istuvat eri hiekkalaatikoilla rakentelemassa pieni&auml; linnoja yhden ison ja vahvan yhteisen sijaan. Muusikot eiv&auml;t pid&auml; toistensa puolta, vaan olevat kateellisia toisten saamista keikoista. T&auml;m&auml; on pienen maamme erityisongelma.</p>
</div>
<div id="sib-ch-6">
<h3>6. Yhteenveto <a title="takaisin sis&auml;llysluetteloon" href="#sibToc-6">^</a></h3>
<p>T&auml;ss&auml; maassa on valtava musiikillinen kapasiteetti, joka kannattaisi hy&ouml;dynt&auml;&auml; paremmin latistamisen sijaan. Liiallinen tieto saattaa tulla soiton ja luomisen tielle. Jos musiikilta riisutaan tunteet ja puetaan se kriittiseen analyysiin, tulos on laiha. Opetus jazzosastolla on eritt&auml;in hyv&auml;&auml; kansainv&auml;list&auml; tasoa, mutta kaipaan suvaitsevaisuutta, positiivista kannustamista ja erilaisten musiikin tyylien hyv&auml;ksymist&auml;. Osaston ilmapiiriss&auml; on paljon parantamisen varaa.Olen vakuuttunut siit&auml;, ett&auml; opetuksen rentoutuessa oppilaat voivat l&ouml;yt&auml;&auml; musiikin ytimen. Erehtymisen mahdollisuus ja inhimillisyyden suvaitseminen on avain ilmaisuun. Toivon kirjeeni koituvan yhteiseksi hyv&auml;ksi.</p>
<p>Helsingiss&auml; 18.09.1999 / Aki K&auml;rkk&auml;inen</p>
<p>&copy; 1999--2012 Aki K&auml;rkk&auml;inen</p>
<p><em>Kirjeen sis&auml;lt&ouml; k&auml;siteltiin Jazz-osaston kokouksessa syksyll&auml; 1999 kirjoittajan poissaollessa.</em></p>
</div>
