---
title: Spatial sound in a user interface as a method to deliver hidden information
  and to relieve visual burden
excerpt: <span class="fi">In Finnish</span> Spatiaalinen ääni graafisessa käyttöliittymässä.
  Pro gradu -tutkielma Jyväskylän yliopistossa 2002.
date: '2002-06-12 13:54:09 +0200'
date_gmt: '2002-06-12 12:54:09 +0200'
categories:
- University
tags:
- Spatial
- sound
- interface
- information
- computer
---
<p>Spatiaalinen &auml;&auml;ni k&auml;ytt&ouml;liittym&auml;ss&auml; piiloinformaation v&auml;litt&auml;j&auml;n&auml; ja visuaalisen kuorman kevent&auml;j&auml;n&auml;. <em>Tietoj&auml;rjestelm&auml;tieteen pro gradu--tutkielma, 12.6.2002, Aki K&auml;rkk&auml;inen.</em> Jyv&auml;skyl&auml;n yliopisto, Tietojenk&auml;sittelytieteiden laitos, Jyv&auml;skyl&auml;.</p>
<h3>Sis&auml;llysluettelo</h3>
<ul class="thesisNav">
<li id="toc-abstract"><a title="Tiivistelm&auml;" href="#abstract">Tiivistelm&auml;</a></li>
<li id="toc-acknowledgements"><a title="Kiitokset" href="#acknowledgements">Kiitokset</a></li>
<li id="toc-1"><a title="Johdanto" href="#ch-1">1.Johdanto</a>
<ul class="thesisNav">
<li id="toc-1_1"><a title="Tutkimuksen taustaa" href="#ch-1_1">1.1 Tutkimuksen taustaa</a></li>
<li id="toc-1_2"><a title="Tutkimusteht&auml;v&auml;" href="#ch-1_2">1.2 Tutkimusteht&auml;v&auml;</a></li>
<li id="toc-1_3"><a title="Sovellettavat tieteenalat ja tutkimuksen rakenne" href="#ch-1_3">1.3 Sovellettavat tieteenalat ja tutkimuksen rakenne</a></li>
</ul>
</li>
<li id="toc-2"><a title="Kuuntelemalla tietoa maailmasta" href="#ch-2">2. Kuuntelemalla tietoa maailmasta</a>
<ul class="thesisNav">
<li id="toc-2_1"><a title="&Auml;&auml;ni ja sen eteneminen korvaan" href="#ch-2_1">2.1 &Auml;&auml;ni ja sen eteneminen korvaan</a></li>
<li id="toc-2_2"><a title="&Auml;&auml;nten ryhmittely" href="#ch-2_2">2.2 &Auml;&auml;nten ryhmittely</a></li>
<li id="toc-2_3"><a title="Aistihavaintoj&auml;rjestelm&auml;t" href="#ch-2_3">2.3 Aistihavaintoj&auml;rjestelm&auml;t</a></li>
<li id="toc-2_4"><a title="Audiovisuaalinen sopimus" href="#ch-2_4">2.4 Audiovisuaalinen sopimus</a></li>
<li id="toc-2_5"><a title="Jokap&auml;iv&auml;inen ja musiikillinen kuuntelu" href="#ch-2_5">2.5 Jokap&auml;iv&auml;inen ja musiikillinen kuuntelu</a></li>
<li id="toc-2_6"><a title="Syntaktiset ja semanttiset tekij&auml;t &auml;&auml;nten tunnistamisessa" href="#ch-2_6">2.6 Syntaktiset ja semanttiset tekij&auml;t &auml;&auml;nten tunnistamisessa</a></li>
</ul>
</li>
<li id="toc-3"><a title="Spatiaalinen &auml;&auml;ni" href="#ch-3">3 Spatiaalinen &auml;&auml;ni</a>
<ul class="thesisNav">
<li id="toc-3_1"><a title="&Auml;&auml;nen paikantaminen" href="#ch-3_1">3.1 &Auml;&auml;nen paikantaminen</a></li>
<li id="toc-3_2"><a title="Siirtofunktio" href="#ch-3_2">3.2 Siirtofunktio</a></li>
<li id="toc-3_3"><a title="&Auml;&auml;nen synteettinen spatialisointi" href="#ch-3_3">3.3 &Auml;&auml;nen synteettinen spatialisointi</a></li>
<li id="toc-3_4"><a title="Auralisaatio" href="#ch-3_4">3.4 Auralisaatio</a></li>
<li id="toc-3_5"><a title="Kaiutin- ja kuuloke&auml;&auml;nentoiston vastakkainasettelu" href="#ch-3_5">3.5 Kaiutin- ja kuuloke&auml;&auml;nentoiston vastakkainasettelu</a></li>
<li id="toc-3_6"><a title="&Auml;&auml;nen spatialisoinnin ongelmat" href="#ch-3_6">3.6 &Auml;&auml;nen spatialisoinnin ongelmat</a></li>
<li id="toc-3_7"><a title="Spatiaalista &auml;&auml;nt&auml; hy&ouml;dynt&auml;vi&auml; sovelluksia" href="#ch-3_7">3.7 Spatiaalista &auml;&auml;nt&auml; hy&ouml;dynt&auml;vi&auml; sovelluksia</a></li>
</ul>
</li>
<li id="toc-4"><a title="&Auml;&auml;nimaisema-analyysi k&auml;ytt&ouml;liittym&auml;ss&auml;" href="#ch-4">4. &Auml;&auml;nimaisema-analyysi k&auml;ytt&ouml;liittym&auml;ss&auml;</a>
<ul class="thesisNav">
<li id="toc-4_1"><a title="Hiljaisuus" href="#ch-4_1">4.1 Hiljaisuus</a></li>
<li id="toc-4_2"><a title="&Auml;&auml;nen k&auml;ytt&ouml;tarkoitus" href="#ch-4_2">4.2 &Auml;&auml;nen k&auml;ytt&ouml;tarkoitus</a></li>
<li id="toc-4_3"><a title="Ikoniset &auml;&auml;net" href="#ch-4_3">4.3 Ikoniset &auml;&auml;net</a></li>
<li id="toc-4_4"><a title="Symboliset &auml;&auml;net" href="#ch-4_4">4.4 Symboliset &auml;&auml;net</a></li>
<li id="toc-4_5"><a title="Metaforiset &auml;&auml;net" href="#ch-4_5">4.5 Metaforiset &auml;&auml;net</a></li>
<li id="toc-4_6"><a title="&Auml;&auml;nitapahtumien luokitteluj&auml;rjestelm&auml;t" href="#ch-4_6">4.6 &Auml;&auml;nitapahtumien luokitteluj&auml;rjestelm&auml;t</a></li>
</ul>
</li>
<li id="toc-5"><a title="Keskustelua" href="#ch-5">5. Keskustelua</a>
<ul class="thesisNav">
<li id="toc-5_1"><a title="Tulokset" href="#ch-5_1">5.1 Tulokset</a></li>
<li id="toc-5_2"><a title="Johtop&auml;&auml;t&ouml;kset" href="#ch-5_2">5.2 Johtop&auml;&auml;t&ouml;kset</a></li>
</ul>
</li>
<li id="toc-6"><a title="Yhteenveto" href="#ch-6">6. Yhteenveto</a></li>
<li id="toc-refs"><a title="L&auml;hteet" href="#refs">L&auml;hteet</a></li>
<li>Kuviot
<ul>
<li>KUVIO 1. Objektin &auml;&auml;nellinen ja visuaalinen esitys</li>
<li>KUVIO 2. Binauraalinen &auml;&auml;nitys ja toisto</li>
<li>KUVIO 3. Siirtofunktioiden  mittaus ja simulointi</li>
</ul>
</li>
<li>Taulukot
<ul>
<li>TAULUKKO 1. &Auml;&auml;nitutkimuksen kategoriat</li>
<li>TAULUKKO 2. Tutkimuksen tulokset</li>
</ul>
</li>
</ul>
<div id="abstract">
<h3>Tiivistelm&auml; <a title="takaisin sis&auml;llysluetteloon" href="#toc-abstract">^</a></h3>
<p>Tutkimuksessa tarkastellaan spatiaalista &auml;&auml;nt&auml; graafisen k&auml;ytt&ouml;liittym&auml;n laajentajana. Tavoitteena on tutkia, miten &auml;&auml;nt&auml; voitaisiin k&auml;ytt&auml;&auml; grafiikan kanssa piiloinformaation v&auml;litt&auml;misess&auml;. K&auml;sitteellis-teoreettisen analyysin avulla pyrit&auml;&auml;n sijoittamaan keskeiset k&auml;sitteet laajempaan viitekehykseen.</p>
<p>Tutkimuksessa tarkastellaan ensin kuuntelemiseen ja &auml;&auml;nen paikantamiseen liittyvi&auml; seikkoja, jonka j&auml;lkeen esitet&auml;&auml;n synteettisen spatialisoinnin periaate ja sen toteutukseen liittyv&auml;t ongelmat. T&auml;m&auml;n j&auml;lkeen spatiaalista &auml;&auml;nt&auml; tarkastellaan k&auml;ytt&ouml;liittym&auml;kontekstissa semioottisessa viitekehyksess&auml;.</p>
<p>Tulokset osoittavat, ett&auml; spatiaalisia -- syntaksia noudattavia -- jokap&auml;iv&auml;isi&auml; &auml;&auml;nitapahtumia voidaan liitt&auml;&auml; k&auml;ytt&ouml;liittym&auml;n teht&auml;viin ja objekteihin paljastamalla siten muutoin piiloon j&auml;&auml;v&auml;&auml; informaatiota. Jatkotutkimusaiheita on runsaasti psykoakustiikan, k&auml;yt&auml;nn&ouml;n sovellusten ja akustisen ekologian piiriss&auml;. Erityisesti liikkuvan tietojenk&auml;sittelyn pienikokoisissa laitteissa &auml;&auml;nen merkitys korostunee tulevaisuudessa, visuaalisen informaation m&auml;&auml;r&auml;n supistuessa.</p>
<p>AVAINSANAT:    akustinen ekologia, auralisaatio, k&auml;ytt&ouml;liittym&auml;, piiloinformaatio, psykoakustiikka, spatialisointi, &auml;&auml;nen paikantaminen, ikoninen &auml;&auml;ni</p>
</div>
<div id="acknowledgements">
<h3>Kiitokset <a title="takaisin sis&auml;llysluetteloon" href="#toc-acknowledgements">^</a></h3>
<p>Kiit&auml;n seuraavia henkil&ouml;it&auml; ja laitoksia, joita ilman t&auml;m&auml; ty&ouml; ei olisi syntynyt (tai ainakin sen tekeminen olisi ollut paljon tylsemp&auml;&auml;):</p>
<p>Jyv&auml;skyl&auml;ss&auml; ty&ouml;n tarkastajat Seppo Puuronen ja Kai Tuuri, Jyv&auml;skyl&auml;n yliopisto, opiskelijavaihdon j&auml;rjest&auml;j&auml; Leena Uski, Panu Varstala, Henna V&auml;likangas, Is&auml; ja &Auml;iti.</p>
<p>Pariisissa XYZ-yhteis&ouml;n suuret s&auml;&auml;t&auml;j&auml;t Tauri Kankaanp&auml;&auml; ja Juha Oravala, vuokrais&auml;nn&auml;t Gilles Martin ja Wolfgang Kukulies, yleinen tuki ja turva La&euml;titia Kulyk, Montmartren k&auml;mpp&auml;kaverit Bettina Ortmann ja Marin&eacute; Pereira, janoisen kirjoittajan virkist&auml;v&auml;t keitaat Ed, Leaderprice ja Monoprix, kannettava kirjoituskone HyperBook 2300SLC/486 ("piip!"), multimedian mekka Centre Pompidou, Cit&eacute; des Sciences et de l'Industrie (La Villette), IRCAM (Institut de Recherche et Coordination Acoustique/Musique), M.S.COM Espace Internet ("Quinze minutes, s'il vous pla&icirc;t!"), Universit&eacute; de la Sorbonne nouvelle Paris III (Cin&eacute;ma et Audiovisuel).</p>
</div>
<div id="ch-1">
<h3>1. Johdanto <a title="takaisin sis&auml;llysluetteloon" href="#toc-1">^</a></h3>
<p>Luvussa esitell&auml;&auml;n ensin aihepiiri ja sen rajaukset, jonka j&auml;lkeen m&auml;&auml;ritell&auml;&auml;n tutkimusongelma sek&auml; eri tieteenalojen osuus tutkimuksessa.</p>
</div>
<div id="ch-1_1">
<h4>1.1 Tutkimuksen taustaa <a title="takaisin sis&auml;llysluetteloon" href="#toc-1_1">^</a></h4>
<p>Miksi &auml;&auml;nt&auml; pit&auml;isi k&auml;ytt&auml;&auml; k&auml;ytt&ouml;liittym&auml;ss&auml;? Onko &auml;&auml;ni vain turha ja irrallinen elementti, joka h&auml;iritsee keskittymist&auml; teht&auml;v&auml;&auml;n? T&auml;llaisia kysymyksi&auml; esitet&auml;&auml;n yleens&auml; silloin, kun &auml;&auml;nisuunnittelu on tehty puutteellisesti tai kun sit&auml; ei osata tehd&auml;. Vaikka kuulolla koettu ilmi&ouml; edustaa fenomenologisesti yht&auml; varmaa tietoa kuin n&auml;&ouml;ll&auml; koettu, n&auml;hty&auml; pidet&auml;&auml;n objektiivisena ja kuultua subjektiivisena tietona<sup id="ref-54_0" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 13)">[54]</a></sup>. &Auml;&auml;nen hy&ouml;dynt&auml;minen graafisissa k&auml;ytt&ouml;liittymiss&auml; onkin toistaiseksi j&auml;&auml;nyt todella v&auml;h&auml;iseksi. Grafiikkaa ja &auml;&auml;nt&auml; on kuitenkin k&auml;yt&auml;nn&ouml;ss&auml; vaikea erottaa toisistaan. Niiden tulisikin tukea ja t&auml;ydent&auml;&auml; toisiaan siten, ettei kumpikaan ole t&auml;ydellinen ilman toista.</p>
<p>Mik&auml; sitten voisi olla &auml;&auml;nen tuottama lis&auml;arvo graafisessa k&auml;ytt&ouml;liittym&auml;ss&auml;? Chionin<sup id="ref-33_0" class="ref"><a href="#note-33" title="(Chion 1990, 5)">[33]</a></sup> mukaan &auml;&auml;ni rikastuttaa kuvaa antamalla vaikutelman, ett&auml; &auml;&auml;ni on "turha", samaan aikaan kun &auml;&auml;ni tuo esille ja voimistaa sen, mit&auml; kuvassa jo on (mutta joka ei tulisi esille ilman &auml;&auml;nt&auml;!). Vaikka Chion puhuu yksinomaan elokuvasta, n&auml;k&ouml;kulma on silti mielenkiintoinen ja sovellettavissa k&auml;ytt&ouml;liittym&auml;&auml;n: se sis&auml;lt&auml;&auml; ajatuksen, ett&auml; &auml;&auml;ni voi olla informatiivinen ja ekspressiivinen olematta silti h&auml;iritsev&auml;. &Auml;&auml;ni on kuulunut elokuvaan jo 70 vuotta<sup id="ref-33_1" class="ref"><a href="#note-33" title="(Chion 1990, 142)">[33]</a></sup>, miksei t&auml;m&auml; kehitys kuuluisi my&ouml;s k&auml;ytt&ouml;liittymiss&auml;?</p>
<p>&Auml;&auml;nt&auml; on perinteisesti k&auml;ytetty k&auml;ytt&ouml;liittym&auml;ss&auml; varoitus- tai ilmoitusmerkityksess&auml; tai tunnelman luomisessa (l&auml;hinn&auml; pelit ja multimediasovellukset). &Auml;&auml;nen tarkoituksena on ollut my&ouml;s auttaa n&auml;k&ouml;vammaisia ty&ouml;skentelem&auml;&auml;n tietokoneen kanssa. Ajatus on luonnollinen sik&auml;li, ett&auml; k&auml;ytet&auml;&auml;nh&auml;n grafiikkaakin vain n&auml;kevi&auml; ihmisi&auml; varten. T&auml;llainen n&auml;k&ouml;kulma on kuitenkin liian rajoittunut. Tuntuu keinotekoiselta ajatella, ett&auml; n&auml;kev&auml;t ihmiset k&auml;ytt&auml;isiv&auml;t graafista k&auml;ytt&ouml;liittym&auml;&auml; ja n&auml;k&ouml;vammaiset kuulok&auml;ytt&ouml;liittym&auml;&auml;. K&auml;site kuulok&auml;ytt&ouml;liittym&auml; on -- toisin kuin graafinen tai merkkipohjainen k&auml;ytt&ouml;liittym&auml; -- viel&auml; verraten harvinainen.</p>
<p>Kuulok&auml;ytt&ouml;liittym&auml;tutkimus on perinteisesti jakautunut kahteen tutkimushaaraan: graafisen k&auml;ytt&ouml;liittym&auml;n laajentamiseen &auml;&auml;nen avulla (auditory interface, auditory display) ja n&auml;k&ouml;vammaisille tarkoitettuun, graafisen k&auml;ytt&ouml;liittym&auml;n korvaavaan kuulok&auml;ytt&ouml;liittym&auml;&auml;n (audio-only interface, nonvisual interface). K&auml;sitteet menev&auml;t osittain p&auml;&auml;llekk&auml;in; joskus auditory interface saattaa viitata my&ouml;s n&auml;k&ouml;vammaisille tarkoitettuun k&auml;ytt&ouml;liittym&auml;&auml;n (ks. Edwards<sup id="ref-38_0" class="ref"><a href="#note-38" title="(Edwards 1988)">[38]</a></sup>. P&auml;&auml;asia on, ett&auml; k&auml;sitteill&auml; viitataan informaation esitt&auml;miseen k&auml;ytt&ouml;liittym&auml;ss&auml; &auml;&auml;nen avulla.</p>
<p>Ensin t&auml;ytyy kuitenkin selvitt&auml;&auml;, mink&auml;laisia &auml;&auml;ni&auml; k&auml;ytet&auml;&auml;n. T&auml;ss&auml; tutkimuksessa keskityt&auml;&auml;n synteettisiin tai luonnollisiin ei-puhe&auml;&auml;niin, koska puhe&auml;&auml;ni on (a) hidasta, (b) &auml;rsytt&auml;v&auml;&auml; kuunnella ja (c) liian huomiota vaativaa. Informaatiota voi j&auml;&auml;d&auml; piiloon (hidden information) esimerkiksi siksi, ett&auml; n&auml;ytt&ouml;&ouml;n on ahdettu liikaa visuaalista informaatiota<sup id="ref-16_0" class="ref"><a href="#note-16" title="(Blattner, Papp III &amp; Glinert 1994, 448)">[16]</a></sup>. Cohenin<sup id="ref-35_0" class="ref"><a href="#note-35" title="(Cohen 1994, 500)">[35]</a></sup> mielest&auml; tietokoneen n&auml;ytt&ouml; ei yksinkertaisesti ole tarpeeksi suuri kyet&auml;kseen n&auml;ytt&auml;m&auml;&auml;n visuaalisesti kaikki k&auml;ynniss&auml; olevat toiminnot. Suuri osa n&auml;ist&auml; toiminnoista tapahtuu k&auml;ytt&auml;j&auml; "sel&auml;n takana", oli sitten kyseess&auml; k&auml;ytt&auml;j&auml;n alullepanema toiminto tai jokin k&auml;ytt&auml;j&auml;&auml; kohti suuntautuva toiminto.<sup id="ref-35_1" class="ref"><a href="#note-35" title="(Cohen 1994, 500)">[35]</a></sup>.</p>
<p>Ensiksi mainittu tutkimushaara (graafisen k&auml;ytt&ouml;liittym&auml;n laajentaminen) jakaantuu kolmeen p&auml;&auml;suuntaukseen: <em>ikonisiin &auml;&auml;niin</em> (auditory icons), <em>symbolisiin &auml;&auml;niin</em> (earcons) ja <em>sonifikaatioon</em> (sonification). Ikoniset &auml;&auml;net perustuvat jokap&auml;iv&auml;isen kuuntelun tuottamaan informaatioon<sup id="ref-42_0" class="ref"><a href="#note-42" title="(Gaver 1986, 168)">[42]</a></sup>. Symboliset &auml;&auml;net ovat abstrakteja, synteettisi&auml; &auml;&auml;ni&auml;, joita voidaan k&auml;ytt&auml;&auml; strukturoidusti &auml;&auml;nellisten viestien esitt&auml;miseen k&auml;ytt&ouml;liittym&auml;ss&auml;<sup id="ref-22_0" class="ref"><a href="#note-22" title="(Brewster, Wright &amp; Edwards 1993, 222)">[22]</a></sup>. Sonifikaatio tarkoittaa ohjelmien tuottaman tiedon esitt&auml;mist&auml; &auml;&auml;nen avulla<sup id="ref-51_0" class="ref"><a href="#note-51" title="(Hereford &amp; Winn 1994, 219)">[51]</a></sup>.</p>
<p>Herefordin ja Winnin<sup id="ref-51_1" class="ref"><a href="#note-51" title="(Hereford ja Winn 1994, 212--213)">[51]</a></sup> mukaan &auml;&auml;nell&auml; on k&auml;ytt&ouml;liittym&auml;ss&auml; kaksi funktiota: &auml;&auml;ni (a) kertoo k&auml;ytt&auml;j&auml;lle j&auml;rjestelm&auml;n tilasta kullakin hetkell&auml; h&auml;lytys&auml;&auml;nill&auml; tai "tarkkailee" taustalla kunnes k&auml;ytt&auml;j&auml; vaatii tietoa j&auml;rjestelm&auml;n tilasta ja (b) v&auml;litt&auml;&auml; ohjelmien tuottamaa tietoa. Hereford ja Winn<sup id="ref-51_2" class="ref"><a href="#note-51" title="(Hereford ja Winn 1994, 213)">[51]</a></sup> luokittelevat ikoniset ja symboliset &auml;&auml;net ryhm&auml;&auml;n (a) ja sonifikaation ryhm&auml;&auml;n (b). Sonifikaatio sivuutetaan t&auml;ss&auml; tutkimuksessa. J&auml;lkimm&auml;inen tutkimushaara (n&auml;k&ouml;vammaisille tarkoitetun k&auml;ytt&ouml;liittym&auml;n tutkimus) rajataan my&ouml;skin t&auml;m&auml;n tutkimuksen ulkopuolelle. Aihepiiri&auml; ovat l&auml;hestyneet ainakin Edwards<sup id="ref-38_1" class="ref"><a href="#note-38" title="(Edwards 1988)">[38]</a></sup>, Mynatt ja Weber<sup id="ref-65" class="ref"><a href="#note-65" title="(Mynatt ja Weber 1994)">[65]</a></sup> sek&auml; Mereu ja Kazman<sup id="ref-64" class="ref"><a href="#note-64" title="(Mereu ja Kazman 1996)">[64]</a></sup>.</p>
<p>Ihmisen ja koneen vuorovaikutusta tarkasteltaessa tulisi k&auml;ytt&auml;&auml; sateenkaarik&auml;sitett&auml; k&auml;ytt&ouml;liittym&auml;, johon on integroitu useita toisiaan tukevia modaliteetteja. Modaliteetilla viitataan t&auml;ss&auml; yhteydess&auml; Dannenbergin ja Blattnerin<sup id="ref-36" class="ref"><a href="#note-36" title="(Dannenberg ja Blattner 1992, xxiii)">[36]</a></sup> mukaisesti siihen aistiin, jolla informaatio havaitaan. Brownin, Newsomen ja Glinertin<sup id="ref-27_0" class="ref"><a href="#note-27" title="(Brown, Newsome ja Glinert 1989, 339)">[27]</a></sup> mukaan visuaalisen informaation liiallinen m&auml;&auml;r&auml; voi laskea tehokkuutta teht&auml;v&auml;n suorituksessa. Jakamalla informaatiota useille eri aisteille voidaan n&auml;k&ouml;aistin ylikuormitusta lievitt&auml;&auml;.<sup id="ref-27_1" class="ref"><a href="#note-27" title="(Brown ym. 1989, 339)">[27]</a></sup>. Huomioitavaa on silti se, ett&auml; vaikka l&auml;hes kaikki k&auml;ytt&ouml;liittym&auml;t ovatkin nyky&auml;&auml;n multimediak&auml;ytt&ouml;liittymi&auml;, ne eiv&auml;t silti ole multimodaalisia, koska hy&ouml;dynt&auml;v&auml;t vain grafiikkaa<sup id="ref-21_0" class="ref"><a href="#note-21" title="(Brewster 1994, 8)">[21]</a></sup>. Laitteisto on jo valmiina, kunhan vain tiedett&auml;isiin mit&auml; sill&auml; pit&auml;isi tehd&auml;.</p>
<p>T&auml;ss&auml; tutkimuksessa k&auml;ytt&ouml;liittym&auml;&auml; tarkastellaan yleisell&auml; tasolla, ei laite- tai j&auml;rjestelm&auml;tasolla (vrt. esimerkiksi Brewster, Leplatre &amp; Crease<sup id="ref-25_0" class="ref"><a href="#note-25" title="(Brewster, Leplatre &amp; Crease (1998))">[25]</a></sup>, jotka ovat tutkineet &auml;&auml;nen k&auml;ytt&ouml;&auml; liikkuvan tietojenk&auml;sittelyn sovelluksissa). K&auml;ytt&auml;j&auml;n oletetaan kommunikoivan koneen kanssa perinteisesti n&auml;pp&auml;imist&ouml;n ja hiiren (tai muun osoittimen) avulla (input) ja saavan palautetta &auml;&auml;nen avulla (output), Brewsterin<sup id="ref-20" class="ref"><a href="#note-20" title="(Brewster 1991, 18)">[20]</a></sup> tapaan. N&auml;in aihetta voidaan tarkastella poikkitieteellisesti, p&auml;&auml;painon ollessa ihmisen ja tietokoneen vuorovaikutuksessa. Vuorovaikutuksen onnistuminen riippuu paljolti siit&auml;, saako ihminen koneen tekem&auml;&auml;n halutun teht&auml;v&auml;n pienimm&auml;ll&auml; mahdollisella k&auml;yt&ouml;n opettelemisella<sup id="ref-51_3" class="ref"><a href="#note-51" title="(Hereford &amp; Winn 1994, 212--213)">[51]</a></sup>. Tutkimuksessa ei k&auml;sitell&auml; &auml;&auml;nen k&auml;ytt&ouml;&auml; jaetuissa ty&ouml;tiloissa tai tietokoneavusteisessa ryhm&auml;ty&ouml;ss&auml; (ks. Ackerman, Starr, Hindus &amp; Mainwaring<sup id="ref-1" class="ref"><a href="#note-1" title="(Ackerman, Starr, Hindus &amp; Mainwaring 1997)">[1]</a></sup>.</p>
<p>Koska vuorovaikutuksen t&auml;ytyy k&auml;ytt&ouml;liittym&auml;ss&auml; olla nopeaa, &auml;&auml;nten t&auml;ytyy (a) olla lyhyit&auml; ja (b) soida samanaikaisesti (toisin kuin peleiss&auml; tai elokuvissa, joissa immersiivisyys on t&auml;rke&auml;mp&auml;&auml; kuin tehokkuus; n&auml;m&auml; eiv&auml;t kuitenkaan v&auml;ltt&auml;m&auml;tt&auml; sulje toisiaan pois). Toisaalta Kramerin<sup id="ref-60_0" class="ref"><a href="#note-60" title="(Kramer 1994, 4)">[60]</a></sup> mukaan &auml;&auml;ni voi my&ouml;s olla pitk&auml;, jos sen tarkoituksena on v&auml;litt&auml;&auml; informaatiota taustaprosessista. Oli kyseess&auml; sitten j&auml;&auml;kaapin hurina, liikenne tai linnunlaulu, mukaudumme pysyviin, staattisiin &auml;&auml;nielementteihin. Kuulemme yksitt&auml;iset &auml;&auml;net vasta keskitytty&auml;mme niihin tietoisesti tai kun ne vaativat  huomiotamme yht&auml;kkisen muutoksen kautta.<sup id="ref-60_1" class="ref"><a href="#note-60" title="(Kramer 1994, 4)">[60]</a></sup>.</p>
<p>Ihmisell&auml; on kyky erotella ja sijoittaa &auml;&auml;net tietyist&auml; suunnista tuleviksi<sup id="ref-5" class="ref"><a href="#note-5" title="(Arons 1992, 35)">[5]</a></sup>. T&auml;m&auml; ns. cocktail party effect (kyky valita yksi &auml;&auml;nivirta useista samanaikaisista &auml;&auml;nivirroista<sup id="ref-48_0" class="ref"><a href="#note-48" title="(Gibson 1966, 84)">[48]</a></sup>) mahdollistaa &auml;&auml;nten spatiaalisen sijoittelun k&auml;ytt&ouml;liittym&auml;ss&auml;. Samalla tavalla kuin voimme n&auml;k&ouml;aistin avulla havaita useita visuaalisia objekteja samanaikaisesti, voimme spatiaalisesti kuulla useita eri &auml;&auml;niobjekteja samanaikaisesti ja keskitty&auml; johonkin niist&auml;. <em>Spatialisaatiossa</em> luodaan synteettisesti kolmiulotteinen &auml;&auml;nikentt&auml;, jossa &auml;&auml;net tuntuvat tulevan tietyist&auml; paikallistettavista suunnista kuulijan p&auml;&auml;n ulkopuolelta<sup id="ref-50_0" class="ref"><a href="#note-50" title="(Goose &amp; M&ouml;ller 1999, 363)">[50]</a></sup>. <em>Auralisaatio</em> taas tarkoittaa prosessia, jonka tarkoituksena on luoda jokin kolmiulotteinen virtuaalitila -- joko sis&auml;- tai ulkotilassa -- simuloimalla &auml;&auml;nil&auml;hteiden suuntaa ja huonekaikua<sup id="ref-13_0" class="ref"><a href="#note-13" title="(Begault 1994, 145)">[13]</a></sup>. K&auml;yt&auml;nn&ouml;ss&auml; n&auml;m&auml; kaksi k&auml;sitett&auml; ovat hyvin l&auml;hell&auml; toisiaan. T&auml;ss&auml; tutkimuksessa auralisaatiolla tarkoitetaan koko virtuaalisen kuuloymp&auml;rist&ouml;n luontiprosessia, spatialisaation viitatessa enemminkin signaalinprosessointitekniikkaan.</p>
<p>Visuaalisia objekteja voidaan sijoittaa n&auml;yt&ouml;lle v&auml;rien avulla, jolloin objektit erottuvat nopeammin toisistaan<sup id="ref-32" class="ref"><a href="#note-32" title="(Carter 1982, 127)">[32]</a></sup>. &Auml;&auml;niobjektien (-tapahtumien) k&auml;yt&ouml;ss&auml; ja sijoittelussa sen sijaan on k&auml;ytetty l&auml;hinn&auml; ad hoc--menetelmi&auml; riippuen k&auml;ytett&auml;v&auml;st&auml; laitteistosta, ohjelmistosta ja sovelluksen luonteesta. Ennen &auml;&auml;niobjektien sijoittelua tilassa t&auml;ytyy k&auml;ytett&auml;ville &auml;&auml;nille luoda luokitteluj&auml;rjestelm&auml;, jonka tarkoituksena on antaa merkitys kullekin &auml;&auml;nelle ja sen sijainnille tilassa.</p>
</div>
<div id="ch-1_2">
<h4>1.2 Tutkimusteht&auml;v&auml; <a title="takaisin sis&auml;llysluetteloon" href="#toc-1_2">^</a></h4>
<p>Aiemmissa tutkimustuloksissa esitetyt strukturoidut menetelm&auml;t &auml;&auml;nen k&auml;yt&ouml;lle eiv&auml;t ole olleet riitt&auml;vi&auml;, koska kukin n&auml;ist&auml; menetelmist&auml; on keskittynyt vain johonkin kapeaan osa-alueeseen. TAULUKOSSA 1 on esitetty yleisen &auml;&auml;nitutkimuksen kategoriat Schaferin<sup id="ref-71_0" class="ref"><a href="#note-71" title="(Schafer 1977, 148)">[71]</a></sup> mukaan. Kendall<sup id="ref-57_0" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup> lis&auml;&auml; edelliseen viel&auml; neuropsykologian, jossa tutkitaan kuulokokemuksen neurologisia rakenteita. Se, samoin kuin akustiikka ja &auml;&auml;nen estetiikka kuuluvat t&auml;m&auml;n tutkimuksen ulkopuolelle (sik&auml;li kuin n&auml;in tarkkoja rajauksia voi edes tehd&auml;). Schafer<sup id="ref-71_1" class="ref"><a href="#note-71" title="(Schafer 1977)">[71]</a></sup> on tehnyt akustisen &auml;&auml;nimaiseman tutkimusta (soundscape), joka liittyy l&auml;heisesti my&ouml;s akustiseen ekologiaan (acoustic ecology) (vrt. Gaver<sup id="ref-44_0" class="ref"><a href="#note-44" title="(Gaver 1993a)">[44]</a></sup><sup id="ref-46_0" class="ref"><a href="#note-46" title="(Gaver 1993c)">[46]</a></sup>).</p>
<table id="table-1" summary="&Auml;&auml;nitutkimuksen kategoriat Schaferin (1977) mukaan">
<caption>TAULUKKO 1. &Auml;&auml;nitutkimuksen kategoriat <a title="takaisin sis&auml;llysluetteloon" href="#toc-table_1">^</a></caption>
<colgroup>
<col class="areaCol" />
<col class="personCol" />
<col class="issueCol" /></colgroup>
<thead>
<tr>
<th scope="col">Alue</th>
<th scope="col">Tutkija</th>
<th scope="col">Tutkimusongelma</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>&Auml;&auml;nen akustiikka</td>
<td>fyysikko, insin&ouml;&ouml;ri</td>
<td>Mit&auml; &auml;&auml;net ovat?</td>
</tr>
<tr>
<td>&Auml;&auml;nen psykoakustiikka</td>
<td>psykologi, fysiologi, kognitiotieteilij&auml;</td>
<td>Miten &auml;&auml;net havaitaan?</td>
</tr>
<tr class="odd">
<td>&Auml;&auml;nen semantiikka</td>
<td>kielitieteilij&auml;, viestint&auml;tieteilij&auml;</td>
<td>Mit&auml; &auml;&auml;net tarkoittavat?</td>
</tr>
<tr>
<td>&Auml;&auml;nen estetiikka</td>
<td>s&auml;velt&auml;j&auml;, musiikkitieteilij&auml;</td>
<td>Milt&auml; &auml;&auml;net tuntuvat?</td>
</tr>
</tbody>
</table>
<p>Schafer<sup id="ref-71_2" class="ref"><a href="#note-71" title="(Schafer 1977, 205)">[71]</a></sup> m&auml;&auml;rittelee akustisen ekologian tutkimusalaksi, jossa tarkastellaan &auml;&auml;nimaiseman akustisten ilmi&ouml;iden suhdetta ja vaikutusta siin&auml; el&auml;vien olentojen k&auml;ytt&auml;ytymiseen. M&auml;&auml;ritelm&auml;n perusteella akustinen ekologia on t&auml;ysin sovellettavissa k&auml;ytt&ouml;liittym&auml;&auml;n, joka muodostaa oman vuorovaikutteisen &auml;&auml;nimaisemansa.</p>
<p>T&auml;m&auml;n tutkimuksen p&auml;&auml;paino sijoittuu p&auml;&auml;asiassa psykoakustiikan, semiotiikan ja akustisen ekologian v&auml;limaastoon, jolloin saadaan toisaalta tietoa kuulokokemuksesta psyykkisen&auml; prosessina, ja toisaalta tietoa &auml;&auml;niobjektien ominaisuuksista, sijainnista ja merkityksist&auml; ymp&auml;r&ouml;iv&auml;ss&auml; maailmassa. T&auml;m&auml;n j&auml;lkeen merkitykset voidaan liitt&auml;&auml; k&auml;ytt&ouml;liittym&auml;kontekstiin.</p>
<p>Keskeiseksi ongelmaksi muodostuu se, miten &auml;&auml;ni voitaisiin integroida grafiikan kanssa. &Auml;&auml;nen tulisi tukea tavoitteellista toimintaa, immersiivisyys voi k&auml;ytt&ouml;liittym&auml;ss&auml; tulla kyseeseen vasta toiminnallisuuden varmistamisen j&auml;lkeen. Tavoitteena on l&ouml;yt&auml;&auml; akustisesta &auml;&auml;niymp&auml;rist&ouml;st&auml;mme hy&ouml;dyllisi&auml; spatiaalisia metaforia ja ikonisia &auml;&auml;ni&auml; piilossa olevan informaation organisoimiseen ja esitt&auml;miseen k&auml;ytt&ouml;liittym&auml;ss&auml; yhdess&auml; n&auml;k&ouml;aistin v&auml;litt&auml;m&auml;n informaation kanssa.</p>
<p>Kirjallisuuden pohjalta on tarkoitus koota yhteen &auml;&auml;nitutkimukseen liittyvi&auml; k&auml;sitteit&auml; ja teoreettisia viitekehyksi&auml;. T&auml;m&auml;n j&auml;lkeen k&auml;sitteit&auml; tarkastellaan laajemmassa semioottisessa ja akustisen ekologian viitekehyksess&auml;. Aihe on vaikea, koska yleistysten teko on hankalaa johtuen ihmisten kulttuuritaustoista sek&auml; erilaisista &auml;&auml;nen havainnointi- ja paikantamistaidoista. Aihetta tarkastellaan t&auml;ss&auml; tutkimuksessa normaalin n&auml;&ouml;n omaavien keskivertok&auml;ytt&auml;jien ja -havainnoijien n&auml;k&ouml;kulmasta. Edellisen perusteella <em>tutkimusongelma muodostuu seuraavasta kahdesta osaongelmasta:</em></p>
<ol>
<li>Miten spatiaalista &auml;&auml;nt&auml; voitaisiin k&auml;ytt&auml;&auml; yhdess&auml; grafiikan kanssa piilossa olevien objektien tai tapahtumien esitt&auml;misess&auml;, teht&auml;v&auml;n suorituksessa ja merkityksenannossa?</li>
<li>Voidaanko sellaista spatiaalista &auml;&auml;nt&auml;, joka ei selv&auml;sti viittaa k&auml;ytt&ouml;liittym&auml;n tapahtumiin tai objekteihin, k&auml;ytt&auml;&auml; piiloinformaation v&auml;litt&auml;misess&auml;?</li>
</ol>
<p>Tutkimus jakaantuu siten kahteen p&auml;&auml;teemaan: (a) spatiaalisen &auml;&auml;nen tuottamaan merkityssis&auml;lt&ouml;&ouml;n ja (b) ymp&auml;rist&ouml;n spatiaalisten &auml;&auml;nten hy&ouml;dynt&auml;miseen ja liitt&auml;miseen k&auml;ytt&ouml;liittym&auml;n objekteihin. Taustaolettamuksena ovat kuuloaistin funktiot Gibsonin<sup id="ref-48_1" class="ref"><a href="#note-48" title="(Gibson 1966, 75)">[48]</a></sup> mukaan: &auml;&auml;nen suunnan havaitseminen ja &auml;&auml;nil&auml;hteen tunnistaminen. Vaikka kyseess&auml; on teoreettinen tutkimus, tutkimustulosten odotetaan hy&ouml;dytt&auml;v&auml;n k&auml;ytt&ouml;liittym&auml;suunnittelijoita my&ouml;s k&auml;yt&auml;nn&ouml;ss&auml;. &Auml;&auml;nellinen k&auml;ytt&ouml;liittym&auml;suunnittelu on aloitettava ihmisest&auml; k&auml;sin, ja edett&auml;v&auml; vasta sitten tekniseen toteutukseen. Tutkimuksen hy&ouml;dyllisimp&auml;n&auml; puolena lienee se, ett&auml; siin&auml; pyrit&auml;&auml;n kattamaan laajempi alue kuin aiemmissa tutkimuksissa -- joskin verraten yleisell&auml; tasolla -- ja luomaan laajennettu viitekehys spatiaalisen &auml;&auml;nen informaation v&auml;litt&auml;mist&auml; ja tavoitteellista toimintaa tukevasta k&auml;yt&ouml;st&auml; k&auml;ytt&ouml;liittym&auml;ss&auml;.</p>
</div>
<div id="ch-1_3">
<h4>1.3 Sovellettavat tieteenalat ja tutkimuksen rakenne<a title="takaisin sis&auml;llysluetteloon" href="#toc-1_3">^</a></h4>
<p>Tutkimuksessa k&auml;ytet&auml;&auml;n kirjallisuutta soveltuvin osin akustisesta ekologiasta, kognitiivisesta psykologiasta ja viestint&auml;tieteist&auml;. Viestint&auml;tieteiden osalta tutkimuksessa k&auml;ytet&auml;&auml;n Fisken<sup id="ref-40_0" class="ref"><a href="#note-40" title="(Fiske 2000)">[40]</a></sup> esitt&auml;m&auml;&auml; jakoa prosessikoulukuntaan ja semioottiseen koulukuntaan. Vaikka Fiske jakaa viestint&auml;tieteiden teoriat edell&auml;mainittuihin koulukuntiin, niiden v&auml;linen raja on usein h&auml;ilyv&auml;. Prosessikoulukunnan mukaan viestint&auml; on sanomien siirtoa ja jos vaikutus eroaa tarkoitetusta, viestint&auml; on ep&auml;onnistunut. T&auml;ll&ouml;in k&auml;yd&auml;&auml;n l&auml;pi viestinn&auml;n eri vaiheita vian l&ouml;yt&auml;miseksi.</p>
<p>Semioottisen koulukunnan mukaan viestint&auml; taas on merkitysten tuottamista ja vaihtoa. T&auml;rke&auml;&auml; on se, kuinka sanomat (useimmiten tekstit, t&auml;ss&auml; yhteydess&auml; &auml;&auml;net) ja ihmiset toimivat vuorovaikutuksessa tuottaakseen merkityksi&auml;. V&auml;&auml;rink&auml;sitykset eiv&auml;t v&auml;ltt&auml;m&auml;tt&auml; todista viestinn&auml;n ep&auml;onnistuneen, vaan ne saattavat johtua l&auml;hett&auml;j&auml;n ja vastaanottajan kulttuurieroista.<sup id="ref-40_1" class="ref"><a href="#note-40" title="(Fiske 2000, 14--15)">[40]</a></sup>. P&auml;&auml;paino t&auml;ss&auml; tutkimuksessa on semioottisessa l&auml;hestymistavassa. Kognitiotieteiden osalta keskityt&auml;&auml;n muistin asettamiin rajoituksiin sek&auml; seriaaliin ja paralleeliin tiedonk&auml;sittelyyn.</p>
<p>Tutkimus etenee seuraavasti: <a title="Luku 2" href="#ch-2">Luvussa 2</a> perehdyt&auml;&auml;n siihen, miten kuuloaistin avulla saadaan tietoa maailmasta sek&auml; verrataan kuulo- ja n&auml;k&ouml;aistia kesken&auml;&auml;n. <a title="Luku 3" href="#ch-3">Luvussa 3</a> tarkastellaan niit&auml; tekij&ouml;it&auml;, joiden perusteella &auml;&auml;ni paikannetaan tietyst&auml; suunnasta tulevaksi sek&auml; esitet&auml;&auml;n synteettisen spatialisoinnin periaate ja toteutukseen liittyv&auml;t ongelmat. <a title="Luku 4" href="#ch-4">Luvussa 4</a> analysoidaan spatiaalista &auml;&auml;nimaisemaa k&auml;ytt&ouml;liittym&auml;kontekstissa. <a title="Luku 5" href="#ch-5">Luvussa 5</a> kootaan yhteen tutkimuksen keskeiset tulokset ja verrataan niit&auml; aiempiin tutkimuksiin. Lopuksi <a title="Yhteenveto" href="#ch-6">yhteenvedossa</a> pohditaan jatkotutkimusaiheita.</p>
</div>
<div id="ch-2">
<h3>2. Kuuntelemalla tietoa maailmasta <a title="takaisin sis&auml;llysluetteloon" href="#toc-2">^</a></h3>
<p>T&auml;ss&auml; luvussa tarkastellaan, miten saamme kuuntelemalla tietoa maailmasta yhdist&auml;m&auml;ll&auml; t&auml;t&auml; tietoa aiempiin kokemuksiimme. Luku on synteesi kuuntelemisen psykoakustisista, havainnollisista, syntaktisista ja semanttisista tekij&ouml;ist&auml;, ja samalla perustelu semioottiselle l&auml;hestymistavalle.</p>
</div>
<div id="ch-2_1">
<h4>2.1 &Auml;&auml;ni ja sen eteneminen korvaan <a title="takaisin sis&auml;llysluetteloon" href="#toc-2_1">^</a></h4>
<p>&Auml;&auml;ni on sek&auml; semanttinen ett&auml; fysikaalinen k&auml;site<sup id="ref-11_0" class="ref"><a href="#note-11" title="(Beaudouin--Lafon &amp; Gaver 1994, 49--50)">[11]</a></sup>. &Auml;&auml;nen akustisia piirteit&auml; kuvataan fysikaalisilla suureilla (kuten taajuudella), kun taas el&auml;myksellinen &auml;&auml;nimaailma muodostuu lukuisista &auml;&auml;niel&auml;myksiin liittyvist&auml; piirteist&auml;<sup id="ref-54_1" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 15)">[54]</a></sup>. Jauhiaisen<sup id="ref-54_2" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 26--27)">[54]</a></sup> mukaan <em>&auml;&auml;ni fysikaalisena k&auml;sitteen&auml;</em> on &auml;&auml;nil&auml;hteest&auml; pallomaisesti kaikkiin suuntiin etenev&auml;&auml; molekyylien v&auml;r&auml;htely&auml;, joka etenee v&auml;liaineessa aaltomaisina tihentym&auml;- ja harventumavaiheina. Eri aineiden rajapintoja kohdatessaan &auml;&auml;ni <q>osittain heijastuu, osittain imeytyy toiseen aineeseen, absorboituu ja jatkaa kulkuaan toisessa aineessa</q><sup id="ref-54_3" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 37)">[54]</a></sup>.</p>
<p>&Auml;&auml;nen aaltoliikett&auml; kuvataan aallonpituudella, taajuudella ja amplitudilla. Jauhiaisen<sup id="ref-54_4" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 26--27)">[54]</a></sup> mukaan <em>aallonpituus</em> on et&auml;isyys &auml;&auml;niaallon tihentymisvaiheesta toiseen, ja <em>taajuus</em> (frequency, yksikk&ouml;n&auml; hertsi, Hz) ilmoittaa v&auml;r&auml;hdysten lukum&auml;&auml;r&auml;n sekunnissa kuvaten &auml;&auml;nen korkeutta. <em>Amplitudi</em> tarkoittaa v&auml;r&auml;htelyn laajuutta eli poikkeamaa keskiarvosta ja ilmaisee siten &auml;&auml;nen voimakkuutta. <em>&Auml;&auml;nes</em> eli <em>puhdas &auml;&auml;ni</em> tarkoittaa &auml;&auml;nt&auml;, joka sis&auml;lt&auml;&auml; vain yhden taajuuden.<sup id="ref-54_5" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 26--27)">[54]</a></sup>. Gibsonin<sup id="ref-48_2" class="ref"><a href="#note-48" title="(Gibson 1966, 87)">[48]</a></sup> mielest&auml; t&auml;llainen puhdas &auml;&auml;ni aiheuttaa vain merkityksett&ouml;m&auml;n aistimuksen. Merkitykselliset &auml;&auml;net koostuvat h&auml;nen mukaansa paljon monimutkaisemmista variaatioista. Jauhiainen<sup id="ref-54_6" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 26--27)">[54]</a></sup> huomauttaa, ett&auml; k&auml;yt&auml;nn&ouml;ss&auml; kaikki ymp&auml;rist&ouml;ss&auml; kuulemamme &auml;&auml;net koostuvat useasta samanaikaisesta eri taajuisesta v&auml;r&auml;htelyst&auml;. T&auml;llaista &auml;&auml;nt&auml; kutsutaan seos&auml;&auml;neksi, jonka taajuussis&auml;ll&ouml;n kuvausta kutsutaan &auml;&auml;nen <em>spektriksi</em>. Spektri sis&auml;lt&auml;&auml; siis &auml;&auml;nen perustaajuuden ja sen harmoniset osa&auml;&auml;nekset kullakin hetkell&auml;.<sup id="ref-54_7" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 26--27)">[54]</a></sup><sup id="ref-49_0" class="ref"><a href="#note-49" title="(Goldstein 1999, 312--313)">[49]</a></sup>. &Auml;&auml;ni voi olla jokin luonnollinen akustisen ilmi&ouml;n &auml;&auml;ni tai koneellisesti aikaansaatu, synteettinen &auml;&auml;ni<sup id="ref-53_0" class="ref"><a href="#note-53" title="(Huopaniemi 1999, 43--44)">[53]</a></sup>. &Auml;&auml;ni etenee kuulijan korvaan sek&auml; suoraan ett&auml; heijastuen seinist&auml;, lattioista ja katosta tai huonekaluista<sup id="ref-54_8" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 38)">[54]</a></sup>. &Auml;&auml;niaallot saavuttavat ensin korvalehden, joka ohjaa aallot korvak&auml;yt&auml;v&auml;n kautta t&auml;rykalvolle ja edelleen syvemm&auml;lle kuuloelimiin<sup id="ref-54_9" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 43--44)">[54]</a></sup>. <em>&Auml;&auml;ni el&auml;myksellisen&auml; k&auml;sitteen&auml;</em> sen sijaan koostuu nelj&auml;st&auml; peruspiirteest&auml;:</p>
<ul>
<li>&auml;&auml;nen voimakkuudesta kvantitatiivisena ominaisuutena (loudness)</li>
<li>&auml;&auml;nen korkeudesta kvalitatiivisena ominaisuutena (pitch)</li>
<li>&auml;&auml;nen ajallisuus- ja paikallisuusominaisuuksista.</li>
</ul>
<p>&Auml;&auml;niel&auml;mys muodostaa yksitt&auml;isen olion el&auml;mysavaruudessa, ja &auml;&auml;niel&auml;mykset muuttuvat nopeasti ajassa ja seuraavat toinen toistaan<sup id="ref-54_10" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 15--16)">[54]</a></sup>. Havaitsemamme &auml;&auml;nimaailma (auditory scene, auditory space) muodostuu useista samanaikaisista &auml;&auml;nivirroista (auditory stream), jotka voimme erottaa toisistaan ja joita voimme kuunnella selektiivisesti<sup id="ref-54" class="ref"><a href="#note-54_11" title="(Jauhiainen 1995, 19)">[54]</a></sup>. T&auml;ss&auml; yhteydess&auml; voimme rinnastaa &auml;&auml;niel&auml;myksen &auml;&auml;nivirtaan (ks. tarkemmin <a title="kohta 2.2" href="#ch-2_2">kohta 2.2</a>). Jauhiaisen<sup id="ref-54_12" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 18--19)">[54]</a></sup> mukaan &auml;&auml;nen ajallisuus ja paikallisuus ovat t&auml;ss&auml; ja nyt koettuja, ja siten t&auml;rke&auml;mpi&auml; piirteit&auml; el&auml;myksess&auml; kuin voimakkuus ja korkeus. &Auml;&auml;nen paikantamisen avulla voimme mielt&auml;&auml; itsemme suhteessa ymp&auml;r&ouml;iv&auml;&auml;n fyysiseen &auml;&auml;nimaailmaan.<sup id="ref-54_13" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 18--19)">[54]</a></sup>.</p>
<p>Kun kaksi korkeudeltaan ja voimakkuudeltaan samantasoista &auml;&auml;nt&auml; kuulostaa erilaiselta, kyse on erosta &auml;&auml;nen <em>v&auml;riss&auml;</em> (timbre). &Auml;&auml;nen v&auml;ri muodostuu &auml;&auml;nen syttymisen (attack), sammumisen (decay) ja &auml;&auml;nen harmonisen rakenteen perusteella.<sup id="ref-49_1" class="ref"><a href="#note-49" title="(Goldstein 1999, 318, 356)">[49]</a></sup>. Oleellista ei kuitenkaan ole &auml;&auml;nen merkitykset&ouml;n jakaminen korkeuteen, voimakkuuteen tai kestoon, vaan se, miten &auml;&auml;nil&auml;hteet erotellaan toisistaan merkityksellisten tapahtumien havaitsemiseksi ja luokittelemiseksi hierarkioihin<sup id="ref-48_3" class="ref"><a href="#note-48" title="(Gibson 1966, 89)">[48]</a></sup>. Jauhiaisen<sup id="ref-54_14" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 15)">[54]</a></sup> mielest&auml; lyhytkestoiset &auml;&auml;niel&auml;mykset sis&auml;lt&auml;v&auml;t rajoitetusti merkityssis&auml;lt&ouml;&auml;, kun taas pitempikestoiset &auml;&auml;niel&auml;mykset muodostavat mielekk&auml;it&auml; kokonaisuuksia sis&auml;lt&auml;en paitsi tietoa &auml;&auml;nil&auml;hteiden ominaisuuksista, my&ouml;s &auml;&auml;nen v&auml;litt&auml;mi&auml; k&auml;sitteellisi&auml;, tunnepitoisia, esteettisi&auml;, arvostuksellisia tai tahtomista ilmaisevia merkityksi&auml;. Jauhiaisen n&auml;kemys on &auml;&auml;rimm&auml;isen yksinkertaistettu: se ei m&auml;&auml;rittele, mik&auml; on lyhyt ja mik&auml; pitk&auml; &auml;&auml;ni, eik&auml; liioin ota huomioon kontekstin merkityst&auml;. Lyhytkin &auml;&auml;ni voi olla tietyss&auml; kontekstissa eritt&auml;in merkitsev&auml;.</p>
<p>Mansur ym.<sup id="ref-62_0" class="ref"><a href="#note-62" title="(Mansur ym. 1985, 117)">[62]</a></sup> jakavat &auml;&auml;nen seuraaviin parametreihin: korkeus, voimakkuus, spatiaalinen sijainti, kesto, sointiv&auml;ri, &auml;&auml;nen syttyminen sek&auml; ajoitus. Niin v&auml;h&auml;n kuin n&auml;m&auml; erottelut kertovatkin &auml;&auml;nten monimutkaisesta rakenteesta, ne auttavat hahmottamaan tutkimusaluetta ja jakamaan sen pienempiin kokonaisuuksiin. T&auml;ss&auml; tutkimuksessa keskityt&auml;&auml;n ainoastaan &auml;&auml;niel&auml;myksen ajallisuuden ja paikallisuuden dynaamiseen suhteeseen sek&auml; niiden sis&auml;lt&auml;m&auml;&auml;n informaatiosis&auml;lt&ouml;&ouml;n (merkitykseen) k&auml;ytt&ouml;liittym&auml;ss&auml;. Selvyyden vuoksi jatkossa puhutaan pelk&auml;st&auml;&auml;n &auml;&auml;nest&auml; (tai &auml;&auml;niobjektista/ -tapahtumasta, ks. <a title="kohta 2.4" href="#ch-2_4">kohta 2.4</a>).</p>
</div>
<div id="ch-2_2">
<h4>2.2 &Auml;&auml;nten ryhmittely <a title="takaisin sis&auml;llysluetteloon" href="#toc-2_2">^</a></h4>
<p>Ryhmittelemme &auml;&auml;ni&auml; erillisiksi <em>&auml;&auml;nivirroiksi</em> (auditory stream)<sup id="ref-60_2" class="ref"><a href="#note-60" title="(Kramer 1994, 4)">[60]</a></sup>. Bregmanin ja Campbellin<sup id="ref-19_0" class="ref"><a href="#note-19" title="(Bregman ja Campbell 1971, 244)">[19]</a></sup> mukaan &auml;&auml;nivirta muodostuu samanlaisista &auml;&auml;nitapahtumista, jotka erotellaan muista samanaikaisista &auml;&auml;nitapahtumista. Bregman ja Campbell<sup id="ref-19_1" class="ref"><a href="#note-19" title="(Bregman ja Campbell 1971, 244)">[19]</a></sup> olettavat, ett&auml; kuuntelija voi suunnata huomionsa vain yhteen &auml;&auml;nivirtaan kerrallaan. &Auml;&auml;nivirta mentaalisena kokemuksena vastaa visuaalisen objektin kokemista ja on siten analoginen suhteessa hahmopsykologiaan (Gestalt)<sup id="ref-55_0" class="ref"><a href="#note-55" title="(Jones 1993, 98)">[55]</a></sup><sup id="ref-73" class="ref"><a href="#note-73" title="(Smith, Pickett &amp; Williams 1994, 174)">[73]</a></sup><sup id="ref-82_0" class="ref"><a href="#note-82" title="(Williams 1994, 97)">[82]</a></sup>. &Auml;&auml;nivirran ja aistikanavan (ks. Broadbent<sup id="ref-26" class="ref"><a href="#note-26" title="(Broadbent 1958)">[26]</a></sup>) ero Bregmanin ja Campbellin<sup id="ref-19_2" class="ref"><a href="#note-19" title="(Bregmanin ja Campbell 1971, 249)">[19]</a></sup> mukaan on siin&auml;, ett&auml; &auml;&auml;nivirta on kullakin hetkell&auml; j&auml;rjestelty kokonaisuus, eik&auml; sit&auml; voida m&auml;&auml;ritell&auml; yhten&auml; fyysisen&auml; ominaisuutena. &Auml;&auml;nivirran funktiona on j&auml;rjestell&auml; &auml;&auml;nimateriaali ensin, jonka j&auml;lkeen aistikanava voi prosessoida t&auml;t&auml; &auml;&auml;nimateriaalia yksi &auml;&auml;nivirta kerrallaan<sup id="ref-19_3" class="ref"><a href="#note-19" title="(Bregman &amp; Campbell 1971, 249)">[19]</a></sup>. Chion<sup id="ref-33_2" class="ref"><a href="#note-33" title="(Chion 1990, 13)">[33]</a></sup>, Ballas<sup id="ref-7" class="ref"><a href="#note-7" title="(Ballas 1994, 80)">[7]</a></sup> ja Williams<sup id="ref-82_1" class="ref"><a href="#note-82" title="(Williams 1994, 96)">[82]</a></sup> painottavat, ett&auml; &auml;&auml;nivirta on havaintoon perustuva tulkinta &auml;&auml;nil&auml;hteest&auml;, eik&auml; siis vastaa &auml;&auml;nil&auml;hteen aiheuttamaa fysikaalista tapahtumaa. Williamsin<sup id="ref-82_2" class="ref"><a href="#note-82" title="(Williams 1994, 96--97)">[82]</a></sup> mielest&auml; ideaalitilanteessa ollaan silloin, kun havaitsemamme &auml;&auml;nivirta sis&auml;lt&auml;&auml; vain &auml;&auml;nil&auml;hteen tunnistamisessa tarvittavan keskeisen informaation. T&auml;m&auml; on t&auml;rke&auml; huomio: turha informaatio voidaan poistaa suunniteltaessa &auml;&auml;ni&auml; k&auml;ytt&ouml;liittym&auml;&auml;n.</p>
<p>Williams<sup id="ref-82_3" class="ref"><a href="#note-82" title="(Williams 1994, 96)">[82]</a></sup> m&auml;&auml;rittelee &auml;&auml;nten ryhmittelyn havainnolliseksi prosessiksi, jossa kuuntelija erottelee akustisesta signaalista saadun informaation yksitt&auml;isiksi merkityksellisiksi &auml;&auml;nitapahtumiksi. Kuuntelija voi kuunnella yht&auml; &auml;&auml;nil&auml;hdett&auml; ja samalla kuulla, mutta olla kiinnitt&auml;m&auml;tt&auml; huomiotaan muihin &auml;&auml;nil&auml;hteisiin<sup id="ref-48_4" class="ref"><a href="#note-48" title="(Gibson 1966, 83)">[48]</a></sup>. Goldstein<sup id="ref-49_2" class="ref"><a href="#note-49" title="(Goldstein 1999, 359--362)">[49]</a></sup> esitt&auml;&auml; yleiset periaatteet &auml;&auml;nten ryhmittelylle. &Auml;&auml;net ryhmitell&auml;&auml;n ensinn&auml;kin niiden sijainnin perusteella. &Auml;&auml;net, jotka ovat per&auml;isin yksitt&auml;isest&auml; &auml;&auml;nil&auml;hteest&auml;, tulevat yleens&auml; yhdest&auml; sijainnista &auml;&auml;nellisest&auml; avaruudesta. N&auml;in ollen voimme erottaa vasemmalla puolellamme k&auml;ydyn hiljaisen keskustelun takanamme k&auml;ydyst&auml; &auml;&auml;nekk&auml;&auml;st&auml; keskustelusta osittain siksi, ett&auml; ne sijoittuvat eri paikkoihin. Juuri paikantamisen avulla kykenemme havaitsemaan ja erottelemaan &auml;&auml;net toisistaan (<a title="Luku 3" href="#ch-3">luvussa 3</a> k&auml;sitell&auml;&auml;n t&auml;t&auml; tarkemmin).</p>
<p>&Auml;&auml;nen sijainti ei kuitenkaan ole keskeinen (eik&auml; ainoa) tekij&auml; erottelun kannalta: voimme kuunnella kamariorkesteria yhdest&auml; kaiuttimesta ja silti selke&auml;sti erotella yksitt&auml;iset soittimet<sup id="ref-41_0" class="ref"><a href="#note-41" title="(Fitch &amp; Kramer 1994, 308)">[41]</a></sup>. Kuulohavaintoj&auml;rjestelm&auml;mme pystyy siis erottelemaan useita &auml;&auml;nivirtoja "akustisesta suosta" yht&auml; aikaa ilman ett&auml; meid&auml;n t&auml;ytyisi turvautua spatiaalisiin vihjeisiin<sup id="ref-41_1" class="ref"><a href="#note-41" title="(Fitch &amp; Kramer 1994, 308)">[41]</a></sup>. Goldsteinin<sup id="ref-49_3" class="ref"><a href="#note-49" title="(Goldstein 1999, 359--362)">[49]</a></sup> mukaan &auml;&auml;net ryhmitell&auml;&auml;n sijainnin lis&auml;ksi niiden &auml;&auml;nenv&auml;rin, s&auml;velkorkeuden ja esiintymistiheyden perusteella. &Auml;&auml;net jotka alkavat ja loppuvat eri aikaan, ryhmitell&auml;&auml;n eri ryhmiin, kun taas &auml;&auml;net, jotka ovat staattisia ja jatkuvia, ryhmitell&auml;&auml;n samasta &auml;&auml;nil&auml;hteest&auml; tulevaksi.<sup id="ref-49_4" class="ref"><a href="#note-4" title="(Goldstein 1999, 359--362)">[49]</a></sup>.</p>
</div>
<div id="ch-2_3">
<h4>2.3 Aistihavaintoj&auml;rjestelm&auml;t <a title="takaisin sis&auml;llysluetteloon" href="#toc-2_3">^</a></h4>
<p>Gibson<sup id="ref-48_5" class="ref"><a href="#note-48" title="(Gibson 1966, 47)">[48]</a></sup> korostaa aistien olevan aktiivisia mieluummin kuin passiivisia, j&auml;rjestelmi&auml; enemm&auml;n kuin kanavia ja enemm&auml;n toistensa kanssa vuorovaikutuksessa olevia kuin toisensa poissulkevia. Gibson kutsuukin aisteja <em>aktiivisiksi havaintoj&auml;rjestelmiksi</em> (perceptual systems).<sup id="ref-48_6" class="ref"><a href="#note-48" title="(Gibson 1966, 47)">[48]</a></sup>. T&auml;m&auml; on t&auml;rke&auml; huomio: on teht&auml;v&auml; ero kuulemisen ja kuuntelemisen v&auml;lill&auml; (samoin kuin n&auml;kemisen ja katsomisen v&auml;lill&auml;). Ihmisen kuulohavaintoj&auml;rjestelm&auml; mahdollistaa kuulemisen (passiivista), kun taas kuunteleminen on ihmisen aktiivista toimintaa<sup id="ref-48_7" class="ref"><a href="#note-48" title="(Gibson 1966, 49--51)">[48]</a></sup>. Gibsonin<sup id="ref-48_8" class="ref"><a href="#note-48" title="(Gibson 1966, 83)">[48]</a></sup> mielest&auml; kuulohavaintoj&auml;rjestelm&auml; on kuuntelemista varten; kuuleminen sen sijaan on sattumanvaraista.</p>
<p>Kuulohavaintoj&auml;rjestelm&auml;n funktiona ei siis ole vain kuulemisen mahdollistaminen, vaan aktiivinen &auml;&auml;nil&auml;hteen suunnan havaitseminen (ks. <a title="Luku 3" href="#ch-3">luku 3</a>), jolloin voimme suuntautua &auml;&auml;nt&auml; kohti (tai siit&auml; poisp&auml;in!), sek&auml; &auml;&auml;nil&auml;hteen luonteen havaitseminen, jolloin kykenemme tunnistamaan sen<sup id="ref-48_9" class="ref"><a href="#note-48" title="(Gibson 1966, 75)">[48]</a></sup> (ks. <a title="Luku 4" href="#ch-4">luku 4</a>).</p>
</div>
<div id="ch-2_4">
<h4>2.4 Audiovisuaalinen sopimus <a title="takaisin sis&auml;llysluetteloon" href="#toc-2_4">^</a></h4>
<p>Chion<sup id="ref-33_3" class="ref"><a href="#note-33" title="(Chion 1990, 9)">[33]</a></sup> k&auml;ytt&auml;&auml; abstraktia k&auml;sitett&auml; <em>audiovisuaalinen sopimus</em> (audiovisual contract) kuvaamaan &auml;&auml;nellisen ja visuaalisen havainnon vuorovaikutteista suhdetta. Kuuntelija/katselija sulauttaa mieless&auml;&auml;n &auml;&auml;nen ja kuvan yhdeksi kokonaisuudeksi<sup id="ref-33_4" class="ref"><a href="#note-33" title="(Chion 1990, 9)">[33]</a></sup>. Kysymykset "mit&auml; kuulen siin&auml; mink&auml; n&auml;en?" ja "mit&auml; n&auml;en siin&auml; mink&auml; kuulen?" ilment&auml;v&auml;t audiovisuaalista sopimusta<sup id="ref-33_5" class="ref"><a href="#note-33" title="(Chion 1990, 192)">[33]</a></sup>. Seuraavassa tarkastellaan t&auml;t&auml; kuulo- ja n&auml;k&ouml;aistin suhdetta sek&auml; kokonaisuutena ett&auml; kummankin aistin kohdalla erikseen, jotta saadaan selville kunkin vahvimmat puolet. T&auml;ss&auml; tutkimuksessa audiovisuaalinen sopimus viittaa &auml;&auml;nen ja kuvan yht&auml;aikaiseen esitt&auml;miseen multimodaalissa k&auml;ytt&ouml;liittym&auml;ss&auml;.</p>
<p>Kun edellisess&auml; kohdassa m&auml;&auml;rittelimme kuuntelemisen aktiiviseksi toiminnaksi, on tarpeen pohtia sit&auml;, miten se eroaa katselemisesta. Ensinn&auml;kin, voimme kuunnella ja paikantaa sellaisia objekteja, joita emme n&auml;e<sup id="ref-60_3" class="ref"><a href="#note-60" title="(Kramer 1994, 4)">[60]</a></sup>. Schaeffer<sup id="ref-70_0" class="ref"><a href="#note-70" title="(Schaeffer 1967, 91--99)">[70]</a></sup> kutsuu t&auml;t&auml; akusmaattiseksi kuuntelemiseksi (acousmatic listening)<sup id="ref-33_6" class="ref"><a href="#note-33" title="(Chion 1990, 71)">[33]</a></sup>. Siin&auml; miss&auml; n&auml;k&ouml;aistin avulla keskitymme vain yhteen suuntaan ja saamme yksityiskohtaista tietoa silloisessa (rajoittuneessa) n&auml;k&ouml;piiriss&auml;mme olevista objekteista, voimme kuuloaistin avulla tarkkailla ymp&auml;rist&ouml;&auml;mme samanaikaisesti kaikista suunnista<sup id="ref-60_4" class="ref"><a href="#note-60" title="(Kramer 1994, 4)">[60]</a></sup>. T&auml;ss&auml; on ratkaiseva ero: enemm&auml;n kuin puolet senhetkisest&auml; ymp&auml;rist&ouml;st&auml; j&auml;&auml; n&auml;k&ouml;piirimme ulkopuolelle<sup id="ref-66_0" class="ref"><a href="#note-66" title="(Perrott, Saberi, Brown &amp; Strybel 1990, 214)">[66]</a></sup>. Perrottin ym.<sup id="ref-66_1" class="ref"><a href="#note-66" title="(Perrott ym. 1990, 214)">[66]</a></sup> mukaan t&auml;ss&auml; kapeassa n&auml;k&ouml;piiriss&auml; informaation prosessointikapasiteetti on verraten rajattu, ollen tehokkainta vain katseen keskipisteen ymp&auml;rill&auml;. Kuuloaistimme avulla voimme siis m&auml;&auml;ritell&auml;, mitk&auml; osat ymp&auml;rist&ouml;st&auml;mme tuodaan n&auml;k&ouml;aistin alueelle<sup id="ref-48_10" class="ref"><a href="#note-48" title="(Gibson 1966, 83)">[48]</a></sup><sup id="ref-66_2" class="ref"><a href="#note-66" title="(Perrott ym. 1990, 214--215)">[66]</a></sup><sup id="ref-79_0" class="ref"><a href="#note-79" title="(Wenzel 1992, 81)">[79]</a></sup>.</p>
<p>Perrott ym.<sup id="ref-66_3" class="ref"><a href="#note-66" title="(Perrott ym. 1990, 219)">[66]</a></sup> osoittivat tutkimuksessaan, ett&auml; akustinen spatiaalinen informaatio auttaa l&ouml;yt&auml;m&auml;&auml;n n&auml;yt&ouml;lt&auml; objektin nopeammin, kun kohde on n&auml;k&ouml;kent&auml;n ulkopuolella. Viel&auml; merkitt&auml;v&auml;mp&auml;&auml; tutkimuksessa on kuitenkin se, ett&auml; my&ouml;s n&auml;k&ouml;kent&auml;n keskell&auml; oleva kohde l&ouml;ytyi spatiaalisen &auml;&auml;nen avulla nopeammin kuin pelk&auml;st&auml;&auml;n n&auml;&ouml;n avulla<sup id="ref-66_4" class="ref"><a href="#note-66" title="(Perrott ym. 1990, 224)">[66]</a></sup>. Heid&auml;n hypoteesinsa, ett&auml; kuulohavaintoj&auml;rjestelm&auml;n ensisijainen funktio on osoittaa silmille minne katsoa<sup id="ref-66_5" class="ref"><a href="#note-66" title="(Perrott ym. 1990, 214)">[66]</a></sup>, saa siten vahvistusta. &Auml;&auml;nen avulla voidaan siis saada tietoa taka-alan prosesseista. Perrott ym.<sup id="ref-66_6" class="ref"><a href="#note-66" title="(Perrott ym. 1990, 215)">[66]</a></sup> toteavat, ett&auml; ihmiset painottavat kuitenkin enemm&auml;n visuaalista informaatiota kuin mink&auml;&auml;n muun aistin tuottamaa informaatiota. T&auml;m&auml; saattaa olla tunnusomaista l&auml;nsimaiselle kulttuurille (jonka piiriss&auml; tietokoneiden kehitys jostain syyst&auml; tapahtuukin). Luultavasti t&auml;st&auml; syyst&auml; k&auml;ytt&ouml;liittymiss&auml; on k&auml;ytetty yksinomaan visuaalista modaliteettia.</p>
<p>Toinen oleellinen ero suuntautumisen lis&auml;ksi on ajallisuus ja spatiaalisuus. Chionin<sup id="ref-33_7" class="ref"><a href="#note-33" title="(Chion 1990, 11, 136)">[33]</a></sup> sek&auml; Fitchin ja Kramerin<sup id="ref-41_2" class="ref"><a href="#note-41" title="(Fitch ja Kramer 1994, 308)">[41]</a></sup> mukaan n&auml;k&ouml;aistin vahvuutena on objektien spatiaalinen havaitseminen, jolloin kuuloaistille j&auml;&auml; niiden ajallinen ulottuvuus. Perrott ym.<sup id="ref-66_7" class="ref"><a href="#note-66" title="(Perrott ym. 1990, 219)">[66]</a></sup> sek&auml; Fitch ja Kramer<sup id="ref-41_3" class="ref"><a href="#note-41" title="(Fitch ja Kramer 1994, 322--323)">[41]</a></sup> olettavat, ett&auml; n&auml;k&ouml;aisti on kehityksen kuluessa tottunut prosessoimaan spatiaalisia objekteja per&auml;kk&auml;isesti (jolloin katselijan t&auml;ytyy silmien liikkeell&auml; k&auml;yd&auml; kaikki objektit l&auml;pi), kun taas kuuloaisti on erikoistunut useiden v&auml;liaikaisten objektien havaitsemiseen samanaikaisesti. N&auml;kemys on vahvasti yksinkertaistettu: spatiaaliset ja ajalliset ulottuvuudet menev&auml;t aistien kesken my&ouml;s limitt&auml;in, kuten saamme my&ouml;hemmin huomata (ks. my&ouml;s Gibson<sup id="ref-48_11" class="ref"><a href="#note-48" title="(Gibson 1966)">[48]</a></sup>). T&auml;llainen keinotekoinen erottelu on kuitenkin hy&ouml;dyllinen, koska sen avulla p&auml;&auml;st&auml;&auml;n tarkastelemaan kuulon ja n&auml;&ouml;n keskeisi&auml; eroavaisuuksia. Erottelulla on my&ouml;s fysikaaliset perusteet: Gibsonin<sup id="ref-48_12" class="ref"><a href="#note-48" title="(Gibson 1966, 49--51)">[48]</a></sup> ja Gaverin<sup id="ref-43_0" class="ref"><a href="#note-43" title="(Gaver 1989, 71)">[43]</a></sup> mukaan n&auml;k&ouml; perustuu valon heijastukseen erilaisista pinnoista, kun taas &auml;&auml;ni on seurausta materiaalien v&auml;r&auml;htelyst&auml; (aiheuttaen ilman v&auml;r&auml;htely&auml;).</p>
<p>Emme voi kuulla ilmanpaineen absoluuttista arvoa, vain sen muutoksen ajassa<sup id="ref-69_0" class="ref"><a href="#note-69" title="(Scaletti &amp; Craig 1991, 210)">[69]</a></sup>. &Auml;&auml;nen ajallisen ominaisuuden vuoksi se voidaan hyvin liitt&auml;&auml; animoituun grafiikkaan; staattinen visuaalinen ikoni ei v&auml;ltt&auml;m&auml;tt&auml; kuvaa &auml;&auml;nt&auml; parhaalla mahdollisella tavalla<sup id="ref-69_1" class="ref"><a href="#note-69" title="(Scaletti &amp; Craig 1991, 210)">[69]</a></sup><sup id="ref-16_1" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 455)">[16]</a></sup>. Gaver<sup id="ref-43_1" class="ref"><a href="#note-43" title="(Gaver (1989, 70--71)">[43]</a></sup> on p&auml;&auml;ssyt asian ytimeen seuraavalla toteamuksellaan: "sound exists in time and over space, vision exists in space and over time". H&auml;nen mukaansa &auml;&auml;net ovat olemassa ajassa, jolloin niiden alku ja loppu huomataan usein; sit&auml; vastoin visuaaliset objektit ovat pysyvi&auml; ja niiden ilmestyminen tai h&auml;ipyminen huomataan vain satunnaisesti. &Auml;&auml;nt&auml; ei v&auml;ltt&auml;m&auml;tt&auml; kuulla kuin kerran, mutta visuaalista objektia voi aina katsoa uudestaan. T&auml;st&auml; syyst&auml; &auml;&auml;ni sopii erityisen hyvin kuvaamaan v&auml;liaikaisia tapahtumia (kausaaliset tapahtumat, esimerkiksi oven sulkeminen; ks. Fitch &amp; Kramer<sup id="ref-41_4" class="ref"><a href="#note-41" title="(Fitch &amp; Kramer 1994, 324)">[41]</a></sup>), kun taas  staattisia objekteja voidaan paremmin kuvata visuaalisesti. Toisaalta visuaaliset objektit saattavat tukkia n&auml;yt&ouml;n kokonaan. Gaver pohtii, ett&auml; visuaalisia objekteja voidaan sijoittaa samanaikaisesti useisiin paikkoihin ja ett&auml; spatiaalisten samanaikaisten &auml;&auml;nten m&auml;&auml;r&auml; on rajoitetumpi kuin visuaalisten objektien.<sup id="ref-43_2" class="ref"><a href="#note-43" title="(Gaver (1989, 71)">[43]</a></sup>.</p>
<p>Niin t&auml;rkeit&auml; kuin Gaverin huomiot ovatkin, h&auml;nen n&auml;k&ouml;kulmansa t&auml;ss&auml; suhteessa on selv&auml;sti rajoittunut ja aikansa tuote: t&auml;ss&auml; tutkimuksessa tullaan osoittamaan, ett&auml; spatiaalisen &auml;&auml;nen avulla voidaan onnistuneesti esitt&auml;&auml; useita objekteja samanaikaisesti, jolloin my&ouml;s visuaalisten objektien suma n&auml;yt&ouml;ll&auml; h&auml;lvenee. &Auml;&auml;ni todellakin on kiinni ajassa; t&auml;st&auml; on osoituksena se, ettei &auml;&auml;ni&auml; ole s&auml;ilynyt menneilt&auml; ajoilta, toisin kuin visuaalisia esineit&auml;. Vasta &auml;&auml;nen tallennustekniikoiden ansiosta &auml;&auml;nt&auml; on voitu vangita ja toistaa aina uudelleen.</p>
<p>Edell&auml; on ollut puhetta visuaalisesta ja &auml;&auml;nellisest&auml; <em>objektista</em> ja <em>&auml;&auml;nitapahtumasta</em>. Mik&auml; sitten on n&auml;iden ero, ja miten objekti m&auml;&auml;ritell&auml;&auml;n? Visuaaliset objektit voidaan n&auml;hd&auml; ja niiden rajat ovat selv&auml;t. Fitchin ja Kramerin<sup id="ref-41_5" class="ref"><a href="#note-41" title="(Fitch ja Kramer 1994, 308)">[41]</a></sup> mukaan objektin spatiaalinen sijainti ja osien yhten&auml;isyys m&auml;&auml;ritt&auml;v&auml;t visuaalisen objektin, jolloin n&auml;ytt&ouml; voidaan helposti jakaa erillisiksi komponenteiksi. &Auml;&auml;niobjektin kohdalla tilanne on pulmallisempi: miten m&auml;&auml;ritell&auml; &auml;&auml;niobjektin rajat? T&auml;h&auml;n on useita tapoja: (a) sijoittamalla &auml;&auml;net spatiaalisesti, (b) m&auml;&auml;rittelem&auml;ll&auml; objekti vuorovaikutuksessa toisen objektin kanssa, tai (c) Kramerin<sup id="ref-60_5" class="ref"><a href="#note-60" title="(Kramer 1994, 12)">[60]</a></sup> tapaan joko liikuttamalla &auml;&auml;nt&auml; sijainnista toiseen tai liikuttamalla subjektia &auml;&auml;nen l&auml;pi. Kramer (ks. my&ouml;s Blattner ym.<sup id="ref-16_2" class="ref"><a href="#note-16" title="Blattner ym. 1994, 454)">[16]</a></sup>) siis ajattelee &auml;&auml;niobjektin rajaavan "palan" &auml;&auml;nellisest&auml; tilasta juuri liikkeens&auml; avulla. T&auml;ss&auml; tutkimuksessa &auml;&auml;niobjektien erottamiseksi on valittu spatiaalinen ja paikallaan pysyv&auml; &auml;&auml;ni.</p>
<p>Er&auml;s pohdittava asia on my&ouml;s se, onko &auml;&auml;niobjekti yksi &auml;&auml;ni vai sarja nopeita, per&auml;kk&auml;isi&auml; &auml;&auml;ni&auml;. Jones<sup id="ref-55_1" class="ref"><a href="#note-55" title="(Jones 1993, 98)">[55]</a></sup> kutsuu &auml;&auml;nellist&auml; tapahtumaa objektiksi, perustellen sen olevan analoginen suhteessa visuaaliseen objektiin. Schafer<sup id="ref-71_3" class="ref"><a href="#note-71" title="(Schafer 1977, 129--130)">[71]</a></sup> puolestaan nimitt&auml;&auml; laboratorioissa toistettavia &auml;&auml;ni&auml; (siis kontekstistaan irrotettuja &auml;&auml;ni&auml;) &auml;&auml;niobjekteiksi, kun taas &auml;&auml;nitapahtumiksi sellaisia &auml;&auml;ni&auml;, jotka tapahtuvat tietyss&auml; paikassa tiettyn&auml; aikana ja aiheuttavat siten merkityksen. T&auml;ll&ouml;in ne viittaavat kontekstiin, jossa ne tapahtuvat, sis&auml;lt&auml;en alun, keskikohdan ja lopun. Teollisen ajan keinotekoiset &auml;&auml;net sis&auml;lt&auml;v&auml;t l&auml;hes yksinomaan &auml;&auml;nen keskikohdan ilman selke&auml;&auml; alkua tai loppua, toisin kuin luonnolliset &auml;&auml;net<sup id="ref-71_4" class="ref"><a href="#note-71" title="(Schafer 1977, 130)">[71]</a></sup>.</p>
<p>T&auml;ss&auml; tutkimuksessa k&auml;ytet&auml;&auml;n t&auml;st&auml; eteenp&auml;in k&auml;sitteit&auml; &auml;&auml;nitapahtuma ja &auml;&auml;niobjekti rinnakkain, j&auml;lkimm&auml;isen viitatessa sen visuaaliseen vastineeseen. Oleellista on se, mit&auml; &auml;&auml;ni tarkoittaa eri konteksteissa ja se, ett&auml; per&auml;kk&auml;isten &auml;&auml;nten j&auml;rjestys on looginen. T&auml;h&auml;n asiaan palataan kohdassa 2.6. &Auml;&auml;nimaisema muodostuu vuorovaikutteisista &auml;&auml;nitapahtumista, jotka puolestaan syntyv&auml;t erilaisten vuorovaikutusten tuloksena<sup id="ref-16_3" class="ref"><a href="#note-16" title="Blattner ym. 1994, 454)">[16]</a></sup>. Blattnerin ym.<sup id="ref-16_4" class="ref"><a href="#note-16" title="Blattner ym. 1994, 454)">[16]</a></sup> mielest&auml; assosioimalla spatiaalinen &auml;&auml;ni vastaavaan visuaaliseen objektiin my&ouml;s &auml;&auml;ni muistetaan paremmin.</p>
<p>&Auml;&auml;ni siis perustuu vaihteluihin ajassa ja viittaa yleens&auml; muutokseen ja tilan tarkkailuun<sup id="ref-18_0" class="ref"><a href="#note-18" title="(Bly 1982, 374)">[18]</a></sup><sup id="ref-79_1" class="ref"><a href="#note-79" title="(Wenzel 1992, 81)">[79]</a></sup><sup id="ref-60_6" class="ref"><a href="#note-60" title="(Kramer 1994, 4)">[60]</a></sup><sup id="ref-76_0" class="ref"><a href="#note-76" title="(Walker &amp; Brewster 2000, 2)">[76]</a></sup>, kuvan ollessa joko staattinen tai liikkuva (animoitu). Esimerkkin&auml; tilan muutoksesta on viinipullosta l&auml;htev&auml; &auml;&auml;ni sen tyhjentyess&auml;. Chionin<sup id="ref-33_8" class="ref"><a href="#note-33" title="(Chion 1990, 9--10)">[33]</a></sup> mielest&auml; kuitenkin my&ouml;s &auml;&auml;ni voi joissain tilanteissa ilmaista staattisuutta; t&auml;ll&ouml;in &auml;&auml;ness&auml; ei ole mit&auml;&auml;n variaatioita. T&auml;llaisia &auml;&auml;ni&auml; ovat esimerkiksi puhelimen valinta&auml;&auml;ni, kaiuttimen hurina tai jokin &auml;&auml;nisilmukka. On vaikea olla kuulematta &auml;&auml;ness&auml; edes v&auml;h&auml;isi&auml; vihjeit&auml; ep&auml;s&auml;&auml;nn&ouml;llisyydest&auml; tai liikkeest&auml;.<sup id="ref-33_9" class="ref"><a href="#note-33" title="(Chion 1990, 9--10)">[33]</a></sup>. K&auml;ytt&ouml;liittym&auml;kontekstissa on kuitenkin t&auml;rke&auml;&auml;, ettei &auml;&auml;ni ole staattinen, vaan ett&auml; sill&auml; on aina jokin selke&auml; funktio.</p>
<p>Edell&auml; esitetyn perusteella p&auml;&auml;dyt&auml;&auml;n esitt&auml;m&auml;&auml;n Scalettin ja Craigin<sup id="ref-69_2" class="ref"><a href="#note-69" title="(Scalett ja Craig 1991, 210)">[69]</a></sup> k&auml;ytt&auml;m&auml; malli, johon my&ouml;s t&auml;m&auml; tutkimus pohjimmiltaan perustuu. Mallin ideana on, ett&auml; reaalimaailman objektit voidaan esitt&auml;&auml; monella tavalla, t&auml;ss&auml; tapauksessa joko &auml;&auml;nen tai kuvan avulla. Objekteilla voidaan olettaa olevan sek&auml; visuaalisia ett&auml; &auml;&auml;nellisi&auml; ulottuvuuksia<sup id="ref-16_5" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 465)">[16]</a></sup>. Olettamuksena siis on, ett&auml; katseleminen t&auml;ydent&auml;&auml; kuuntelemista ja toisinp&auml;in: t&auml;st&auml; seuraa, ett&auml; saman objektin tarjoama &auml;&auml;nellinen tai kuvallinen informaatio voi tilanteesta riippuen olla my&ouml;s toisteista. KUVIOSSA 1 on havainnollistettu t&auml;t&auml; mallia. Seuraavassa kohdassa tarkastellaan kahta erilaista kuuntelemisen tapaa.</p>
</div>
<div id="ch-2_5">
<h4>2.5 Jokap&auml;iv&auml;inen ja musiikillinen kuuntelu <a title="takaisin sis&auml;llysluetteloon" href="#toc-2_5">^</a></h4>
<p>Gaver<sup id="ref-43_3" class="ref"><a href="#note-43" title="(Gaver 1989, 72--73)">[43]</a></sup> <sup id="ref-44_1" class="ref"><a href="#note-44" title="(Gaver 1993a, 286)">[44]</a></sup><sup id="ref-46_1" class="ref"><a href="#note-46" title="(Gaver 1993c, 1--2)">[46]</a></sup> tekee eron <em>musiikillisen</em> ja <em>jokap&auml;iv&auml;isen</em> kuuntelemisen v&auml;lill&auml;: edellinen viittaa &auml;&auml;niaallon fyysisten attribuuttien havaitsemiseen (esimerkiksi &auml;&auml;nen korkeus), ja j&auml;lkimm&auml;inen &auml;&auml;nil&auml;hteiden havaitsemiseen ymp&auml;rist&ouml;ss&auml;mme. Gaverin mielest&auml; emme oven sulkeutuessa kuule siit&auml; aiheutuvan &auml;&auml;nen korkeutta, vaan sen sijaan saatamme havaita oven koon, materiaalin ja sulkemiseen k&auml;ytetyn voiman.<sup id="ref-43_4" class="ref"><a href="#note-43" title="(Gaver 1989, 72--73)">[43]</a></sup>. Keskeist&auml; Gaverin ajattelussa on se, ett&auml; jokap&auml;iv&auml;isess&auml; el&auml;m&auml;ss&auml;mme emme kuule &auml;&auml;ni&auml; itsess&auml;&auml;n, sellaisenaan, vaan &auml;&auml;nil&auml;hteen ominaisuuksia tietyss&auml; kontekstissa. N&auml;k&ouml;kulma perustuu Gibsonin<sup id="ref-48_13" class="ref"><a href="#note-48" title="(Gibson 1966)">[48]</a></sup> ajatuksiin. Chion<sup id="ref-33_10" class="ref"><a href="#note-33" title="(Chion 1990, 25)">[33]</a></sup> kutsuu t&auml;t&auml; kausaaliseksi kuuntelemiseksi. Chionin<sup id="ref-33_11" class="ref"><a href="#note-33" title="(Chion 1990, 26--27)">[33]</a></sup> mielest&auml; kontekstistaan irrotetun yksitt&auml;isen &auml;&auml;nen tunnistaminen on vaikeaa: saatamme tunnistaa vain &auml;&auml;nil&auml;hteen yleiset piirteet, esimerkiksi "jonkin koneellisen &auml;&auml;nen". Chionin mielest&auml; voimme kuulla &auml;&auml;nen kausaalisesti, eli siis kuulla ja tunnistaa raapimisen tai aistia sen nopeuden, mutta sen sijaan emme kuule mik&auml; raapii mit&auml;<sup id="ref-33_12" class="ref"><a href="#note-33" title="(Chion 1990, 26--27)">[33]</a></sup>.</p>
<p><img id="figure-1" src="/assets/images/2002/06/object.png" alt="Objektin &auml;&auml;nellinen ja visuaalinen esitys" /></p>
<h5>KUVIO 1. Objektin &auml;&auml;nellinen ja visuaalinen esitys <a title="takaisin sis&auml;llysluetteloon" href="#toc-figure_1">^</a></h5>
<p>Chion<sup id="ref-33_13" class="ref"><a href="#note-33" title="(Chion 1990, 27)">[33]</a></sup> painottaa, ett&auml; &auml;&auml;ni on seurausta v&auml;hint&auml;&auml;n kahdesta &auml;&auml;nil&auml;hteest&auml;. Chion siis erottaa &auml;&auml;nil&auml;hteen vuorovaikutuksen muodosta ja eroaa siten hieman Gaverin teoriasta. Chion<sup id="ref-33_14" class="ref"><a href="#note-33" title="(Chion 1990, 28)">[33]</a></sup> k&auml;ytt&auml;&auml; viel&auml; nimityst&auml; semanttinen kuunteleminen, joka tarkoittaa viestin tulkitsemista tietyn koodin tai kielen avulla. K&auml;yt&auml;nn&ouml;ss&auml; semanttinen ja jokap&auml;iv&auml;inen kuunteleminen tarkoittaa samaa asiaa: kyse on &auml;&auml;nten tulkitsemisesta. Gaver<sup id="ref-46_2" class="ref"><a href="#note-46" title="(Gaver (1993c, 18)">[46]</a></sup> painottaa, ettei jokap&auml;iv&auml;ist&auml; kuuntelua voi tutkia pelk&auml;st&auml;&auml;n &auml;&auml;nil&auml;hteiden fyysisten ominaisuuksien perusteella; t&auml;rkeint&auml; on se, mit&auml; kuuntelijat havaitsevat.</p>
<p>Psykologit ovat perinteisesti olleet kiinnostuneita juuri musiikilliseen kuunteluun vaikuttavista havainnollisista ilmi&ouml;ist&auml;, vaikka suurin osa jokap&auml;iv&auml;isest&auml; kuuntelusta ei sit&auml; ole<sup id="ref-46_3" class="ref"><a href="#note-46" title="(Gaver 1993c, 1--2)">[46]</a></sup>. Gaver nimitt&auml;&auml; n&auml;it&auml; perinteisen psykoakustisen tutkimuksen parametreja &auml;&auml;nen primitiivisiksi (fysikaalisiksi) ulottuvuuksiksi<sup id="ref-46_4" class="ref"><a href="#note-46" title="(Gaver 1993c, 1--2)">[46]</a></sup>. Schaeffer<sup id="ref-70_1" class="ref"><a href="#note-70" title="(Schaeffer (1967, 270)">[70]</a></sup> kutsuu t&auml;t&auml; pelkistetyksi kuuntelemiseksi (reduced listening), koska siin&auml; keskityt&auml;&auml;n &auml;&auml;neen itsess&auml;&auml;n, irrotettuna sen syyst&auml; ja merkityksest&auml;<sup id="ref-33_15" class="ref"><a href="#note-33" title="(Chion 1990, 29)">[33]</a></sup>. My&ouml;s Chionin<sup id="ref-33_16" class="ref"><a href="#note-33" title="(Chion 1990, 31)">[33]</a></sup> mielest&auml; &auml;&auml;nell&auml; on kausaalisuutensa lis&auml;ksi my&ouml;s oma esteettinen arvonsa johtuen &auml;&auml;nen v&auml;rist&auml; ja tekstuurista. Gaver<sup id="ref-46_5" class="ref"><a href="#note-46" title="(Gaver 1993c, 1--2)">[46]</a></sup> painottaa kuitenkin, ett&auml; ero on kokemuksessa, ei &auml;&auml;niss&auml;. On siis hyvinkin mahdollista kuunnella my&ouml;s jokap&auml;iv&auml;ist&auml; &auml;&auml;nimaisemaamme musiikkina. Gaver mainitsee t&auml;ss&auml; s&auml;velt&auml;j&auml; John Cagen, joka on hy&ouml;dynt&auml;nyt t&auml;t&auml; seikkaa s&auml;vellyksiss&auml;&auml;n.<sup id="ref-46_6" class="ref"><a href="#note-46" title="(Gaver 1993c, 1--2)">[46]</a></sup>.</p>
<p>Gaverin mielest&auml; jokap&auml;iv&auml;isen kuuntelun tuottama informaatio voi toimia perustana uuden viitekehyksen luomisessa: voimme manipuloida &auml;&auml;nt&auml; sen &auml;&auml;nil&auml;hteen ulottuvuuksien kautta, ei itse &auml;&auml;nen ulottuvuuksien kautta<sup id="ref-46_7" class="ref"><a href="#note-46" title="(Gaver 1993c, 2)">[46]</a></sup>. Gaver vertailee &auml;&auml;ni&auml; seuraavalla tavalla: musiikilliset &auml;&auml;net eiv&auml;t edusta p&auml;ivitt&auml;in kuulemaamme &auml;&auml;nimaisemaa, koska useimmat musiikilliset &auml;&auml;net ovat harmonisia, kun taas jokap&auml;iv&auml;iset &auml;&auml;net eiv&auml;t ole, sis&auml;lt&auml;en my&ouml;s h&auml;lin&auml;&auml;; musiikilliset &auml;&auml;net paljastavat v&auml;hemm&auml;n l&auml;hteist&auml;&auml;n kuin jokap&auml;iv&auml;iset &auml;&auml;net; musiikillisilla instrumenteilla muutokset &auml;&auml;nen korkeudessa tai voimakkuudessa (siis fyysisiss&auml; attribuuteissa) eiv&auml;t ole niin informatiivisia kuin jokap&auml;isten &auml;&auml;nten tuottamat variaatiot.<sup id="ref-46_8" class="ref"><a href="#note-46" title="(Gaver 1993c, 3)">[46]</a></sup>. T&auml;m&auml; on mielenkiintoinen n&auml;k&ouml;kulma, koska t&auml;ll&ouml;in p&auml;&auml;st&auml;&auml;n tarkastelemaan aktiivisesti &auml;&auml;nimaisemaa ajassa, eik&auml; pelk&auml;st&auml;&auml;n passiivisesti "kivettynytt&auml;" musiikillista &auml;rsykett&auml;. Gaverin erittely paljastaa, ett&auml; perinteiset musiikilliset &auml;&auml;net edustavat vain muutamaa prosentin murto-osaa siit&auml; mahdollisesta kapasiteetista, jonka jokap&auml;iv&auml;inen &auml;&auml;niymp&auml;rist&ouml;mme joka hetki tuottaa.</p>
</div>
<div id="ch-2_6">
<h4>2.6 Syntaktiset ja semanttiset tekij&auml;t &auml;&auml;nten tunnistamisessa <a title="takaisin sis&auml;llysluetteloon" href="#toc-2_6">^</a></h4>
<p>K&auml;ytt&ouml;liittym&auml;ss&auml; on t&auml;rke&auml;&auml;, ett&auml; &auml;&auml;nen merkitys on yksiselitteinen; t&auml;t&auml; varten &auml;&auml;nen on oltava tunnistettava. Kieli voidaan jakaa kolmeen tasoon: sanoihin (lexical level), kielioppiin/syntaksiin (syntactic level) ja semantiikkaan<sup id="ref-16_6" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 450)">[16]</a></sup>. Jos n&auml;it&auml; tasoja sovelletaan ei-puhe&auml;&auml;niin, &auml;&auml;nen fysikaaliset attribuutit (esimerkiksi spatiaalisuus) edustavat alinta tasoa -- jolle suurin osa &auml;&auml;nitutkimuksesta on keskittynyt<sup id="ref-16_7" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 450)">[16]</a></sup>. &Auml;&auml;ni&auml; voidaan prosessoida ylh&auml;&auml;lt&auml; alas (top-down) tai alhaalta yl&ouml;s (bottom-up). Howardin ja Ballaksen<sup id="ref-52_0" class="ref"><a href="#note-52" title="(Howard ja Ballas 1980, 431)">[52]</a></sup> mukaan ylh&auml;&auml;lt&auml; alas prosessoiminen perustuu tietoon (knowledge-driven), kun taas alhaalta yl&ouml;s dataan (data-driven). Esimerkiksi puheen havaitsemisessa kuuntelijat k&auml;ytt&auml;v&auml;t sek&auml; kielen syntaktista ja semanttista rakennetta ett&auml; &auml;&auml;nil&auml;hteest&auml; tulevaa havainnollista informaatiota. V&auml;hemm&auml;n on kuitenkin tutkittu syntaktisten ja semanttisten tekij&ouml;iden vaikutusta monimutkaisiin ei-puhe&auml;&auml;niin.<sup id="ref-52_1" class="ref"><a href="#note-52" title="(Howard ja Ballas 1980, 431)">[52]</a></sup>.</p>
<p>Alhaalta yl&ouml;s prosessoitaessa havaitaan &auml;&auml;nen akustisia ominaisuuksia, joista rakennetaan merkityksi&auml; muistin avulla, kun taas ylh&auml;&auml;lt&auml; alas prosessoitaessa tulkitaan &auml;&auml;nen merkitys sen kontekstin ja aiempien kokemusten perusteella, josta edet&auml;&auml;n &auml;&auml;nen yksitt&auml;isten parametrien analysointiin<sup id="ref-8_0" class="ref"><a href="#note-8" title="(Ballas &amp; Howard 1987, 96)">[8]</a></sup><sup id="ref-60_7" class="ref"><a href="#note-60" title="(Kramer 1994, 5)">[60]</a></sup><sup id="ref-49_5" class="ref"><a href="#note-49" title="(Goldstein 1999, 376)">[49]</a></sup><sup id="ref-4_0" class="ref"><a href="#note-4" title="(Anderson 2000, 63)">[4]</a></sup>.</p>
<p>Monilla jokap&auml;iv&auml;isill&auml; monimutkaisilla ei-puhe&auml;&auml;nill&auml; on m&auml;&auml;ritelt&auml;viss&auml; oleva jaksollinen rakenne (siis syntaksi kielen tavoin), samoin kuin semanttinen sis&auml;lt&ouml;, ja ne havaitaan samanlaisten prosessien kautta kuin puhe<sup id="ref-52_2" class="ref"><a href="#note-52" title="(Howard &amp; Ballas 1980, 431)">[52]</a></sup><sup id="ref-62_1" class="ref"><a href="#note-62" title="(Mansur ym. 1985, 117)">[62]</a></sup><sup id="ref-8_1" class="ref"><a href="#note-8" title="(Ballas &amp; Howard 1987, 96)">[8]</a></sup><sup id="ref-16_8" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 448)">[16]</a></sup>. Erojakin toki on: kieli viittaa sosiaalisiin merkityksiin, kun taas ymp&auml;rist&ouml;n ei-puhe&auml;&auml;net viittaavat kausaalisiin tapahtumiin (sidottu akustiikan fysikaalisiin lakeihin)<sup id="ref-48_14" class="ref"><a href="#note-48" title="(Gibson 1966, 91)">[48]</a></sup><sup id="ref-8_2" class="ref"><a href="#note-8" title="(Ballas &amp; Howard 1987, 98)">[8]</a></sup>. Esimerkiksi oven avaaminen ja henkil&ouml;n astuminen huoneeseen muodostavat jakson ajallisesti j&auml;rjestettyj&auml; &auml;&auml;nitapahtumia. T&auml;llaisilla jaksoilla on tilap&auml;inen rakenne, koska ne koostuvat yksitt&auml;isist&auml; &auml;&auml;nitapahtumista, jotka syntyv&auml;t &auml;&auml;nil&auml;hteiden sanelemassa j&auml;rjestyksess&auml; ja joilla on &auml;&auml;nil&auml;hteist&auml; riippuva kesto.<sup id="ref-52_3" class="ref"><a href="#note-52" title="(Howard &amp; Ballas 1980, 431)">[52]</a></sup>.</p>
<p>My&ouml;s Deutschin<sup id="ref-37_0" class="ref"><a href="#note-37" title="(Deutsch 1980, 381)">[37]</a></sup> tutkimus tukee t&auml;t&auml; n&auml;kemyst&auml; rakenteen merkityksest&auml;: voimme prosessoida monimutkaistakin informaatiota sarjallisesti, jos informaatio on systemaattisesti organisoitu ja havaitsija ymm&auml;rt&auml;&auml; sen rakenteen. Ryhmittelemme sarjallisia kuvioita jaksoihin, joita sitten j&auml;rjestelemme hierarkioihin. Esimerkiksi kieless&auml; merkityksellisen lauseen muodostavat sanat havaitaan ja muistetaan paremmin kuin vain sanat sattumanvaraisessa j&auml;rjestyksess&auml;.<sup id="ref-37_1" class="ref"><a href="#note-37" title="(Deutsch 1980, 381)">[37]</a></sup>. T&auml;m&auml; seikka on keskeinen sijoitettaessa &auml;&auml;ni&auml; k&auml;ytt&ouml;liittym&auml;n toimintoihin.</p>
<p>Ei-puhe&auml;&auml;nten kohdalla syntaksi syntyy niist&auml; mahdollisista v&auml;liaikaisista suhteista, joista sarja &auml;&auml;nitapahtumia voi kesken&auml;&auml;n muodostaa j&auml;rkev&auml;n kokonaisuuden (esimerkiksi a--a--c--d--d)<sup id="ref-52_4" class="ref"><a href="#note-52" title="Howard &amp; Ballas 1980, 436">[52]</a></sup>. Howardin ja Ballaksen<sup id="ref-52_5" class="ref"><a href="#note-52" title="Howard &amp; Ballas 1980, 436, 438">[52]</a></sup> mukaan t&auml;m&auml;n kokonaisuuden on oltava sek&auml; syntaktisesti ett&auml; semanttisesti j&auml;rkev&auml;: syntaksin t&auml;ytyy pohjautua &auml;&auml;nitapahtumien v&auml;liaikaiseen rakenteeseen, ja yksitt&auml;isten &auml;&auml;nitapahtumien t&auml;ytyy noudattaa syntaksia. Muutoin kuuntelijoilla on vaikeuksia havaita rakennetta.<sup id="ref-52_6" class="ref"><a href="#note-52" title="Howard &amp; Ballas 1980, 436, 438">[52]</a></sup>. T&auml;t&auml; seikkaa voidaan hy&ouml;dynt&auml;&auml; jakamalla k&auml;ytt&ouml;liittym&auml;n toiminnot &auml;&auml;nitapahtumien jaksoiksi: jakso koostuu toiminnoista, jotka k&auml;ytt&auml;j&auml; tekee suorittaakseen jonkin teht&auml;v&auml;n.</p>
<p>Warrenin ja Verbruggen<sup id="ref-78_0" class="ref"><a href="#note-78" title="(Warren ja Verbrugge 1984)">[78]</a></sup> tavoitteena oli l&ouml;yt&auml;&auml; ne tekij&auml;t, joiden perusteella kuuntelija tunnistaa eri vuorovaikutuksen muodon. He tutkivat kahta eri tapausta, pullon s&auml;rkymist&auml; ja pomppimista kovalla alustalla, ja huomasivat, ett&auml; spektraaliset erot eiv&auml;t olleet ratkaisevia tunnistamisessa. Kuuntelijat kykenev&auml;t erottamaan pullon pomppimisen ja s&auml;rkymisen toisistaan vain niiden ajallisten jaksojen perusteella.<sup id="ref-78_1" class="ref"><a href="#note-78" title="(Warren ja Verbrugge 1984, 711)">[78]</a></sup>. T&auml;m&auml; tutkimus on keskeinen, koska se vahvistaa edell&auml; k&auml;sitelty&auml; n&auml;kemyst&auml; &auml;&auml;nitapahtumien v&auml;liaikaisen rakenteen merkityksest&auml;. Pomppiva pullo aiheuttaa erilaisen v&auml;liaikaisen jakson &auml;&auml;nitapahtumia (t&auml;ss&auml; tapauksessa iskuja) kuin s&auml;rkyv&auml; pullo. Kuuntelijat reagoivat rytmiin halukkaammin kuin mihink&auml;&auml;n muuhun &auml;&auml;nen parametriin<sup class="ref"><a href="#4" title="(Blattner, Sumikawa &amp; Greenberg 1989, 23)">[4]</a></sup>. Luultavasti t&auml;st&auml; syyst&auml; v&auml;liaikaisen rakenteen merkitys on niin ratkaiseva tunnistamisessa.</p>
<p>Voimme k&auml;ytt&auml;&auml; my&ouml;s kontekstia apuna objektien tunnistamisessa ja merkityksenannossa<sup id="ref-8_3" class="ref"><a href="#note-8" title="(Ballas &amp; Howard 1987, 98)">[8]</a></sup><sup id="ref-9" class="ref"><a href="#note-9" title="(Ballas &amp; Mullins 1991)">[9]</a></sup><sup id="ref-4_1" class="ref"><a href="#note-4" title="(Anderson 2000, 63)">[4]</a></sup>. Usein hyvinkin erilaiset fysikaaliset tapahtumat aiheuttavat samankaltaisia &auml;&auml;ni&auml;<sup id="ref-16_9" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 450)">[16]</a></sup>. Schafer<sup id="ref-71_5" class="ref"><a href="#note-71" title="(Schafer 1977, 150)">[71]</a></sup> ottaa esimerkin: k&auml;&auml;rmeen sihin&auml; ja kattilan kiehuminen ovat &auml;&auml;nen&auml; l&auml;hell&auml; toisiaan, mutta her&auml;tt&auml;v&auml;t eri kontekstissa erilaisen kokemuksen. Kun n&auml;m&auml; kaksi &auml;&auml;nt&auml; irroitetaan kontekstistaan ja toistetaan nauhalta, niiden identiteetti h&auml;m&auml;rtyy. Korva ei ole tarpeeksi tarkka erottamaan n&auml;iden kahden &auml;&auml;nen fysikaalisia eroja erottaakseen k&auml;&auml;rmeen sihin&auml;n ja veden kiehumisen toisistaan nauhalta.<sup id="ref-71_6" class="ref"><a href="#note-71" title="(Schafer 1977, 150)">[71]</a></sup>. Toisena esimerkkin&auml; voisi olla &auml;&auml;ni "klik-klik": t&auml;llainen &auml;&auml;ni voi kuulua kuulak&auml;rkikyn&auml;st&auml;, valokatkaisijasta, nitojasta tai kamerasta. Ainoastaan konteksti voi poistaa ep&auml;ilyksen siit&auml;, mist&auml; on kyse. Ballas<sup id="ref-6_0" class="ref"><a href="#note-6" title="(Ballas 1993)">[6]</a></sup> arvioi akustisia, ekologisia, havainnollisia ja kognitiivisia tekij&ouml;it&auml;, jotka ovat keskeisi&auml; jokap&auml;iv&auml;isten &auml;&auml;nten tunnistamisessa. Tutkimuksessa oli mukana 41 lyhytt&auml; ja toisistaan eroavaa jokap&auml;iv&auml;ist&auml; &auml;&auml;nt&auml;. Tutkimus osoitti, ett&auml; &auml;&auml;nil&auml;hteen tunnistamiseen vaikuttavat ainakin akustiset (fysikaaliset) muuttujat, ekologinen frekvenssi, kausaalinen ep&auml;varmuus ja &auml;&auml;nen tyypillisyys<sup id="ref-6_1" class="ref"><a href="#note-6" title="(Ballas 1993, 262)">[6]</a></sup>. Tutut &auml;&auml;net siis tunnistetaan nopeammin<sup id="ref-8_4" class="ref"><a href="#note-8" title="(Ballas &amp; Howard 1987, 103)">[8]</a></sup><sup id="ref-6_2" class="ref"><a href="#note-6" title="(Ballas 1993, 256)">[6]</a></sup>.</p>
<p>Edell&auml; on alustavasti k&auml;sitelty &auml;&auml;nten havaitsemiseen ja &auml;&auml;nil&auml;hteiden tunnistamiseen liittyvi&auml; asioita. Luvun lopuksi on tarpeen koota keskeiset huomiot. Kuulohavaintoj&auml;rjestelm&auml;n ansiosta voimme aktiivisesti suuntautua &auml;&auml;nivirtaa kohti, kohdistaa katseemme t&auml;h&auml;n objektiin sek&auml; tunnistaa sen joko kuulo- tai n&auml;k&ouml;aistimme avulla. Jokap&auml;iv&auml;iset &auml;&auml;net voivat v&auml;litt&auml;&auml; hienovaraisempaa informaatiota &auml;&auml;nil&auml;hteest&auml; kuin (perinteisten) musiikillisten instrumenttien tuottamat &auml;&auml;net. Kuuloaistilla tunnistettaessa on varmistettava, ett&auml; &auml;&auml;nitapahtumien sarja noudattaa syntaksia: t&auml;ll&ouml;in &auml;&auml;nitapahtumien muodostama kokonaisuus on semanttisesti looginen ja ymm&auml;rrett&auml;v&auml;.</p>
<p>Anderson<sup id="ref-4_2" class="ref-4_2"><a href="#note-4" title="(Anderson 2000, 81)">[4]</a></sup> summaa luvun viel&auml; seuraavasti: valitsemme &auml;&auml;nen, johon suuntaudumme, &auml;&auml;nen fysikaalisten ominaisuuksien perusteella (esimerkiksi korkeuden perusteella), jolloin "voimistamme" kyseist&auml; &auml;&auml;nt&auml; ja vaimennamme muut &auml;&auml;net. N&auml;m&auml; muut &auml;&auml;net eiv&auml;t kuitenkaan kokonaan vaimennu, vaan kiinnitt&auml;v&auml;t huomiomme jos ne ovat fyysisilt&auml; ominaisuuksiltaan korostavia (esimerkiksi kova &auml;&auml;ni), semanttiselta sis&auml;ll&ouml;lt&auml;&auml;n kiintoisia (jos nimemme mainitaan) tai yhtenev&auml;isi&auml; sill&auml; hetkell&auml; prosessoimamme &auml;&auml;nen kanssa.<sup id="ref-4_3" class="ref"><a href="#note-4" title="(Anderson 2000, 81)">[4]</a></sup>. <a title="Luku 3" href="#ch-3">Seuraavassa luvussa</a> keskityt&auml;&auml;n tarkemmin yhteen &auml;&auml;nen parametreista. Spatiaaliset jokap&auml;iv&auml;iset &auml;&auml;net toimivat analogiana kielen sanoihin ja voivat muodostaa syntaksin -- ja siten merkityksen -- k&auml;ytt&ouml;liittym&auml;kontekstissa.</p>
</div>
<div id="ch-3">
<h3>3. Spatiaalinen &auml;&auml;ni <a title="takaisin sis&auml;llysluetteloon" href="#toc-3">^</a></h3>
<p><span class="drop">&Auml;</span><span class="lead-in">&auml;ni v&auml;litt&auml;&auml; informaatiota</span> &auml;&auml;nil&auml;hteen ja ymp&auml;rist&ouml;n lis&auml;ksi my&ouml;s sijainnista<sup id="ref-46_9" class="ref"><a href="#note-46" title="(Gaver 1993c, 7)">[46]</a></sup>. Visuaalisen n&auml;kyvyyden heiketess&auml; -- esimerkiksi huonon valaistuksen vuoksi -- t&auml;ytyy turvautua spatiaaliseen &auml;&auml;nimaisemaan<sup id="ref-49_6" class="ref"><a href="#note-49" title="(Goldstein 1999, 242)">[49]</a></sup>. Samassa tilanteessa ollaan my&ouml;s silloin, kun n&auml;ytt&ouml; on liian t&auml;ynn&auml; visuaalista informaatiota. Kuten <a title="Luku 2" href="#ch-2">edellisess&auml; luvussa</a> todettiin, kuuntelija voi erottaa &auml;&auml;nivirtoja my&ouml;s yhdest&auml; kaiuttimesta. &Auml;&auml;ni&auml; ryhmitell&auml;&auml;n siis my&ouml;s muiden muuttujien kuin sijainnin perusteella. Onko spatiaalisen &auml;&auml;nen funktio siten vain immersiivisyyden lis&auml;&auml;minen tai navigointi tilassa? T&auml;ss&auml; luvussa tarkastellaan spatiaalista &auml;&auml;nt&auml; ja pyrit&auml;&auml;n l&ouml;yt&auml;m&auml;&auml;n tapoja sen hy&ouml;dynt&auml;miseen k&auml;ytt&ouml;liittym&auml;ss&auml;. Jokap&auml;iv&auml;isen spatiaalisen &auml;&auml;nimaisemamme hy&ouml;dynt&auml;minen k&auml;ytt&ouml;liittym&auml;ss&auml; voi parhaimmillaan johtaa intuitiiviseen vuorovaikutukseen.</p>
<p>Spatiaalisuus pit&auml;&auml; sis&auml;ll&auml;&auml;n useita tekstuureita: <em>polyfonia</em> muodostuu kahdesta tai useammasta samanaikaisesta, yht&auml; t&auml;rke&auml;st&auml; melodiasta; <em>homofonia</em> taas yhdest&auml; p&auml;&auml;melodiasta ja useista muista, s&auml;est&auml;vist&auml; melodioista<sup id="ref-15" class="ref"><a href="#note-15" title="(Blattner, Greenberg &amp; Kamegai 1992, 101)">[15]</a></sup>. K&auml;ytt&ouml;liittym&auml;n kokonais&auml;&auml;nimaisema voisi siten muodostua polyfonisista &auml;&auml;nivirroista sijoiteltuna spatiaalisesti. &Auml;&auml;nimaisema voisi osin olla my&ouml;s homofoninen, riippuen &auml;&auml;nten t&auml;rkeydest&auml; ja luokittelusta k&auml;ytt&ouml;liittym&auml;n eri konteksteissa. Ennen spatiaalisen &auml;&auml;nen tarkempaa m&auml;&auml;rittely&auml; on tarpeen k&auml;sitell&auml; niit&auml; tekij&ouml;it&auml;, joiden perusteella &auml;&auml;ni paikannetaan tietyst&auml; suunnasta tulevaksi. Luvussa pohditaan my&ouml;s spatialisoinnin toteutukseen liittyvi&auml; ongelmia ja esitell&auml;&auml;n spatiaalista &auml;&auml;nt&auml; hy&ouml;dynt&auml;vi&auml; sovelluksia. Spatialisointia ja auralisaatiota voidaan t&auml;m&auml;n j&auml;lkeen tarkastella semioottisessa viitekehyksess&auml; kuuntelijan n&auml;k&ouml;kulmasta <a title="Luku 4" href="#ch-4">luvussa 4</a>.</p>
</div>
<div id="ch-3_1">
<h4>3.1 &Auml;&auml;nen paikantaminen <a title="takaisin sis&auml;llysluetteloon" href="#toc-3_1">^</a></h4>
<p>Jauhiainen<sup id="ref-54_15" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 150)">[54]</a></sup> m&auml;&auml;rittelee <em>lokalisaation</em> &auml;&auml;nen paikantamiseksi ilman kuulokkeita ja <em>lateralisaation</em> &auml;&auml;nen paikantamiseksi kuulokkeita k&auml;ytt&auml;m&auml;ll&auml;.  Lateralisaatio viittaa &auml;&auml;nen paikantumiseen sivuun keskipisteest&auml;, eli sijoittumista keskipisteest&auml; jompaan kumpaan korvaan<sup id="ref-54_16" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 150)">[54]</a></sup>. Seuraavassa tarkastellaan niit&auml; tekij&ouml;it&auml;, joiden perusteella &auml;&auml;ni paikannetaan tietyst&auml; suunnasta tulevaksi.</p>
<p>Vaihe-ero korvien v&auml;lill&auml; (interaural delay time, IDT) on merkitt&auml;v&auml; tekij&auml; paikantamisessa<sup id="ref-29_0" class="ref"><a href="#note-29" title="(Burgess 1992b, 54)">[29]</a></sup>. Vaihe tarkoittaa v&auml;r&auml;htelyn ajankohtaa tiettyn&auml; hetken&auml;. Jos viivett&auml; ei ole, &auml;&auml;ni tulee suoraan edest&auml;, takaa tai yl&auml;puolelta. Jos &auml;&auml;ni tulee sivulta, &auml;&auml;niaallot tulevat perille eri aikaan eri korvaan. Viive voi enimmill&auml;&auml;n olla 0.63 millisekuntia, jonka aikana &auml;&auml;ni kulkee p&auml;&auml;n l&auml;pimitan pituisen matkan.<sup id="ref-29_1" class="ref"><a href="#note-29" title="(Burgess 1992b, 54)">[29]</a></sup>. &Auml;&auml;nen voimakkuusero korvien v&auml;lill&auml; (interaural intensity difference, IID) on toinen merkitt&auml;v&auml; tekij&auml; &auml;&auml;nen paikantamisessa<sup id="ref-57_1" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>.</p>
<p>Jos &auml;&auml;ni tulee sivusta, sen t&auml;ytyy ennen toiseen korvaan etenemist&auml;&auml;n kiert&auml;&auml; ensin p&auml;&auml;n ymp&auml;ri. P&auml;&auml; imee itseens&auml; osan &auml;&auml;niaalloista, joten alkuper&auml;inen &auml;&auml;ni tulee toiseen korvaan hieman vaimennettuna. T&auml;t&auml; ilmi&ouml;t&auml; kutsutaan p&auml;&auml;n aiheuttamaksi &auml;&auml;nen vaimenemiseksi (head shadow effect).<sup id="ref-29_2" class="ref"><a href="#note-29" title="(Burgess 1992b, 54)">[29]</a></sup>. Samoin &auml;&auml;nen tullessa takaa korvalehdet vaimentavat &auml;&auml;nt&auml; hieman verrattuna siihen, ett&auml; &auml;&auml;ni tulisi edest&auml;<sup id="ref-50_1" class="ref"><a href="#note-50" title="(Goose &amp; M&ouml;ller 1999, 365)">[50]</a></sup>. Alle 1500 Hz:n taajuiset &auml;&auml;niaallot ovat jo niin pitki&auml;, ett&auml; ne taipuvat p&auml;&auml;n ymp&auml;ri, jolloin voimakkuuseroa on vaikea havaita; paikantaminen tapahtuu t&auml;ll&ouml;in p&auml;&auml;asiassa vaihe-eron perusteella. Yli 1500 Hz:n taajuudet taas heijastuvat poisp&auml;in ja vaimentuvat p&auml;&auml;n vaikutuksesta, jolloin paikantaminen tehd&auml;&auml;n p&auml;&auml;asiassa voimakkuuseron mukaan. 1500 Hz:n raja johtuu siit&auml;, ett&auml; 1500 Hz:n &auml;&auml;niaallon aallonpituus on sama kuin p&auml;&auml;n l&auml;pimitta.<sup id="ref-57_2" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>. Havaitsemme &auml;&auml;nen sijainnin sivusuunnassa siis sek&auml; vaihe- ett&auml; voimakkuuseron perusteella.</p>
<p>Korvalehden ja -k&auml;yt&auml;v&auml;n  merkitys (pinna and ear canal response) &auml;&auml;nen paikantamisessa on kaksikorvaisuuden ohella ratkaiseva. Koska jo vaihe- ja voimakkuuseron perusteella paikannamme &auml;&auml;ni&auml; vaaka-akselilla, korvalehti&auml; tarvitaan oikeastaan vain &auml;&auml;nten paikantamiseen pystyakselilla. T&auml;m&auml;n lis&auml;ksi korvalehti&auml; tarvitaan luomaan vaikutelma siit&auml;, ett&auml; &auml;&auml;ni todellakin tulee p&auml;&auml;n ulkopuolelta eik&auml; sis&auml;lt&auml;. Korvalehdet ohjaavat &auml;&auml;nen korvak&auml;yt&auml;v&auml;&auml;n, mutta samalla korvalehtien ep&auml;s&auml;&auml;nn&ouml;llinen muoto muuttaa &auml;&auml;nen spektri&auml; vaimentamalla ja voimistamalla tiettyj&auml; taajuuksia &auml;&auml;nen tulosuunnan ja kunkin ihmisen yksil&ouml;llisen anatomian mukaan. T&auml;m&auml;n j&auml;lkeen aivot vertaavat ja tulkitsevat saatua tietoa &auml;&auml;nen paikantamiseksi.<sup id="ref-57_3" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>.</p>
<p>Ihmisen yl&auml;ruumis ja olkap&auml;&auml;t heijastavat tiettyj&auml; taajuuksia (shoulder echoes). N&auml;m&auml; heijastukset saapuvat korviin hieman my&ouml;hemmin riippuen &auml;&auml;nen tulokulmasta. My&ouml;s t&auml;m&auml; informaatio auttaa &auml;&auml;nen tulosuunnan havainnoimisessa.<sup id="ref-29_3" class="ref"><a href="#note-29" title="(Burgess 1992b, 54)">[29]</a></sup>. On luonnollista, ett&auml; k&auml;&auml;nn&auml;mme p&auml;&auml;t&auml;mme halutessaan tarkemmin selvitt&auml;&auml; &auml;&auml;nen suunnan. Jos k&auml;&auml;nn&auml;mme p&auml;&auml;t&auml;mme sivulta tulevaa &auml;&auml;nt&auml; kohden, koemme &auml;&auml;nen nyt tulevan keskelt&auml;. P&auml;&auml;n liikkeen avulla on siis mahdollista paikantaa &auml;&auml;ni tarkemmin. Wun, Duhin, Ouhyoungin ja Wun<sup id="ref-83_0" class="ref"><a href="#note-83" title="(Wu, Duh, Ouhyoung ja Wu 1997, 17)">[83]</a></sup> tutkimuksen mukaan p&auml;&auml;n k&auml;&auml;nt&auml;minen &auml;&auml;nen suuntaan parantaa paikantamista 90 % verrattuna p&auml;&auml;n pit&auml;miseen paikallaan. Esimerkiksi jos &auml;&auml;ni tulee etuoikealta, vaihe- ja voimakkuuserot ovat samat, jolloin &auml;&auml;nil&auml;hde voisi teoriassa olla "peilikuva&auml;&auml;nen&auml;" my&ouml;s takaoikealla<sup id="ref-12_0" class="ref"><a href="#note-12" title="(Begault 1991, 866)">[12]</a></sup>. Tilanne aiheuttaa ep&auml;tietoisuutta, jos p&auml;&auml; pidet&auml;&auml;n paikallaan. P&auml;&auml;n k&auml;&auml;nt&auml;minen oikealle poistaa heti peilikuva&auml;&auml;nen vaihe- ja voimakkuuserojen muuttuessa. T&auml;ll&ouml;in h&auml;vi&auml;&auml; ep&auml;tietoisuus siit&auml;, tuleeko &auml;&auml;ni edest&auml; vai takaa.</p>
<p>My&ouml;s n&auml;k&ouml;aisti vaikuttaa paikantamiseen, joskin yll&auml;tt&auml;v&auml;ll&auml; tavalla. Hylk&auml;&auml;mme kuuloaistin tuoman informaation, jos se on ristiriidassa n&auml;kem&auml;mme &auml;&auml;nil&auml;hteen sijainnin kanssa<sup id="ref-29_4" class="ref"><a href="#note-29" title="(Burgess 1992b, 55)">[29]</a></sup><sup id="ref-49_7" class="ref"><a href="#note-49" title="(Goldstein 1999, 242)">[49]</a></sup>. Uskomme siis mieluummin n&auml;k&ouml;- kuin kuuloaistia.</p>
<p>Huopaniemen<sup id="ref-53_1" class="ref"><a href="#note-53" title="(Huopaniemi 1999, 34)">[53]</a></sup> mukaan <em>huonekaiku</em> (room impulse response, RIR) voidaan jakaa suoraan &auml;&auml;neen, ensiheijastumiin ja j&auml;lkikaiuntaan. <em>Suora &auml;&auml;ni</em> on &auml;&auml;ni, joka saapuu korvaan suoraan heijastumatta ensin mist&auml;&auml;n pinnasta. <em>Ensiheijastumat</em> (early echo response) ovat &auml;&auml;ni&auml;, jotka saapuvat kuulijan korvaan 50--100 millisekunnin kuluessa &auml;&auml;nen syntymisest&auml;<sup id="ref-29_5" class="ref"><a href="#note-29" title="(Burgess 1992b, 55)">[29]</a></sup>. Binauraalinen (kaksikanavainen) huonekaiku (binaural room impulse response, BRIR) riippuu kuulijan ja &auml;&auml;nil&auml;hteen sijainnista sek&auml; huoneen ominaisuuksista tietyll&auml; hetkell&auml;<sup id="ref-58_0" class="ref"><a href="#note-58" title="(Kleiner, Dalenbeck &amp; Svensson 1993, 865)">[58]</a></sup>.</p>
<p><em>J&auml;lkikaiunta</em> tarkoittaa ensiheijastuman j&auml;lkeisi&auml; &auml;&auml;nen heijastuksia. Huoneen kaikuisuutta mitataan j&auml;lkikaiunta-aikana (reverberation time), jota mitataan voimakkaalla lyhyell&auml; &auml;&auml;nipulssilla. Jauhiaisen<sup id="ref-54_17" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 38)">[54]</a></sup> mukaan j&auml;lkikaiunta-aika on aika, joka kuluu &auml;&auml;nitason pienenemiseen 60 dB:iin k&auml;ytetyn &auml;&auml;nipulssin huippuarvosta. Suora &auml;&auml;ni tulee ensimm&auml;isen&auml; suoraan kuulijan korvaan, ja kaikki ensi- ja j&auml;lkiheijastumat saapuvat t&auml;m&auml;n j&auml;lkeen eri aikoihin ja eri suunnista. Suoran &auml;&auml;nen perusteella saamme vihjeit&auml; &auml;&auml;nil&auml;hteen suunnasta ja heijastumien m&auml;&auml;r&auml;n sek&auml; &auml;&auml;nen voimakkuuden perusteella &auml;&auml;nen et&auml;isyydest&auml; ja tilan ominaisuuksista.<sup id="ref-29_6" class="ref"><a href="#note-29" title="(Burgess 1992b, 57)">[29]</a></sup><sup id="ref-57_4" class="ref"><a href="#note-4" title="(Kendall 1995)">[57]</a></sup><sup id="ref-63_0" class="ref"><a href="#note-63" title="(McGrath 1995, 1--2)">[63]</a></sup>.</p>
<p>&Auml;&auml;nil&auml;hteen liikkuessa sen suunta ja et&auml;isyys muuttuvat. <em>Doppler-ilmi&ouml;</em> (doppler-effect) syntyy, kun kohteen l&auml;hestyess&auml; &auml;&auml;niaallot tihentyv&auml;t, jolloin aallonpituus lyhenee ja &auml;&auml;nen korkeus nousee. Vastaavasti kohteen loitontuessa &auml;&auml;niaallot harventuvat, jolloin &auml;&auml;nen korkeus laskee. T&auml;st&auml; voimme p&auml;&auml;tell&auml;, ett&auml; &auml;&auml;nil&auml;hde liikkuu. Mit&auml; nopeammin &auml;&auml;nil&auml;hde liikkuu suoraan meit&auml; kohti tai meist&auml; poisp&auml;in l&auml;hiet&auml;isyydell&auml;, sit&auml; suurempi on &auml;&auml;nen korkeuden muutos. N&auml;in voimme saada tietoa &auml;&auml;nil&auml;hteen et&auml;isyydest&auml; ja suunnasta.<sup id="ref-71_7" class="ref"><a href="#note-71" title="(Schafer 1977, 80)">[71]</a></sup><sup id="ref-13_1" class="ref"><a href="#note-13" title="(Begault 1994, 40)">[13]</a></sup>.</p>
<p>&Auml;&auml;nen paikantamiseen vaikuttavat siis vaihe- ja voimakkuuserot korvien v&auml;lill&auml;, p&auml;&auml;n aiheuttama &auml;&auml;nen vaimeneminen, korvalehden ja korvak&auml;yt&auml;v&auml;n muoto, heijastumat olkap&auml;ist&auml; ja yl&auml;ruumiista, p&auml;&auml;n liike, n&auml;k&ouml;aisti, suora &auml;&auml;ni, ensiheijastumat, j&auml;lkikaiunta-aika, &auml;&auml;nil&auml;hteen liikkuminen ja Dopplerin ilmi&ouml;. N&auml;iden tekij&ouml;iden vaikutukset &auml;&auml;nen spektriin ovat mitattavissa siirtofunktion avulla. Siirtofunktion m&auml;&auml;rittelemisen j&auml;lkeen esitet&auml;&auml;n menetelm&auml;, jolla &auml;&auml;neen lis&auml;t&auml;&auml;n keinotekoisesti vihjeit&auml; tilasta ja suunnasta.</p>
</div>
<div id="ch-3_2">
<h4>3.2 Siirtofunktio <a title="takaisin sis&auml;llysluetteloon" href="#toc-3_2">^</a></h4>
<p>Begaultin<sup id="ref-12_1" class="ref"><a href="#note-12" title="(Begault 1991, 864)">[12]</a></sup> mukaan <em>siirtofunktion</em> (head related transfer function, HRTF) avulla saadaan selville, miten &auml;&auml;nen spektri muuttuu &auml;&auml;nen kulkiessa p&auml;&auml;n ulkopuolisesta &auml;&auml;nil&auml;hteest&auml; ulkokorvan l&auml;pi t&auml;rykalvolle. Siirtofunktio on erilainen kummassakin korvassa, ja se m&auml;&auml;ritet&auml;&auml;n mittaamalla t&auml;rykalvoon saapuvan &auml;&auml;nen spektrin muutokset verrattuna &auml;&auml;nil&auml;hteest&auml; l&auml;htev&auml;n &auml;&auml;nen spektriin. T&auml;ll&ouml;in voidaan tietokoneen avulla laskea alkuper&auml;isen signaalin ja koehenkil&ouml;n korviin tulevan signaalin perusteella kyseisen henkil&ouml;n siirtofunktiot kunkin &auml;&auml;nil&auml;hteen suhteen. Siirtofunktio vaihtelee &auml;&auml;nil&auml;hteen sijainnin ja kuulijan p&auml;&auml;n asennon v&auml;lisen suhteen mukaan kullakin hetkell&auml;.<sup id="ref-12_2" class="ref"><a href="#note-12" title="(Begault 1991, 864)">[12]</a></sup><sup id="ref-57_5" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>.</p>
<p>Aina ei ole mahdollista mitata jokaisen yksil&ouml;llisen k&auml;ytt&auml;j&auml;n siirtofunktioita. My&ouml;s yleisen, keskiarvoisen siirtofunktion avulla p&auml;&auml;st&auml;&auml;n todentuntuisiin tuloksiin paikantamisessa (parhaiten kuitenkin vaaka-akselilla)<sup id="ref-12_3" class="ref"><a href="#note-12" title="(Begault 1991, 865)">[12]</a></sup><sup id="ref-81_0" class="ref"><a href="#note-81" title="(Wenzel, Wightman &amp; Kistler 1991, 358)">[81]</a></sup><sup id="ref-50_2" class="ref"><a href="#note-50" title="(Goose &amp; M&ouml;ller 1999, 365)">[50]</a></sup>. Keskiarvoinen siirtofunktio on m&auml;&auml;ritetty mittaamalla se suurelta m&auml;&auml;r&auml;lt&auml; ihmisi&auml; ja laskemalla keskiarvo. Toinen mahdollisuus on k&auml;ytt&auml;&auml; keskim&auml;&auml;r&auml;ist&auml; paremman "paikantajan" siirtofunktiota<sup id="ref-12_4" class="ref"><a href="#note-12" title="(Begault 1991, 865)">[12]</a></sup>. Mittaukset tehd&auml;&auml;n yleens&auml; kaiuttomassa huoneessa eri suunnista tulevilla &auml;&auml;nill&auml; laajalla taajuusalueella<sup id="ref-63_1" class="ref"><a href="#note-63" title="(McGrath 1995, 3)">[63]</a></sup>.</p>
</div>
<div id="ch-3_3">
<h4>3.3 &Auml;&auml;nen synteettinen spatialisointi <a title="takaisin sis&auml;llysluetteloon" href="#toc-3_3">^</a></h4>
<p><em>Spatialisointi</em> tarkoittaa Goosen ja M&ouml;llerin<sup id="ref-50_3" class="ref"><a href="#note-50" title="(Goose ja M&ouml;ller 1999, 363)">[50]</a></sup> mukaan &auml;&auml;nen prosessointia siten, ett&auml; &auml;&auml;ni koetaan tulevan kolmiulotteisesta &auml;&auml;nikent&auml;st&auml; (tietyst&auml; tunnistettavasta suunnasta) kuulijan ulkopuolelta. Burgessin<sup id="ref-28_0" class="ref"><a href="#note-28" title="(Burgess 1992a, 2)">[28]</a></sup><sup id="ref-29_7" class="ref"><a href="#note-29" title="(1992b, 53)">[29]</a></sup> mukaan digitaalinen monauraalinen &auml;&auml;ni voidaan keinotekoisesti spatialisoida binauraaliseksi &auml;&auml;neksi digitaalisten suodatinalgoritmien avulla, kun tiedet&auml;&auml;n joko yksil&ouml;llinen tai keskiarvoinen siirtofunktio. T&auml;t&auml; kutsutaan synteettiseksi spatialisoinniksi.</p>
<p>Sek&auml; stereo&auml;&auml;ni ett&auml; binauraalinen &auml;&auml;ni viittaavat kahden kanavan k&auml;ytt&ouml;&ouml;n, mutta poikkeavat &auml;&auml;nitystekniikoiltaan ja &auml;&auml;nentoisto-ominaisuuksiltaan toisistaan (monauraalinen viittaa yhden kanavan k&auml;ytt&ouml;&ouml;n). Burgessin<sup id="ref-28_1" class="ref"><a href="#note-28" title="(Burgess 1992a, 1)">[28]</a></sup><sup id="ref-29_8" class="ref"><a href="#note-29" title="(1992b, 53)">[29]</a></sup> mukaan stereo&auml;&auml;nitys tarkoittaa monilla toisistaan erossa olevilla mikrofoneilla tehty&auml; &auml;&auml;nityst&auml;, jota kuunnellessaan kuulija voi havaita &auml;&auml;nil&auml;hteen sijainnin &auml;&auml;nikent&auml;ss&auml;. T&auml;ll&ouml;in sijainti on kuitenkin rajoitettu siihen vaakasuoraan linjaan, joka muodostuu kahden kaiuttimen v&auml;lille tai kuulijan vasemman ja oikean korvan v&auml;lille kuulokkeilla kuunneltaessa (&auml;&auml;ni ei siis tunnu kuuluvan riitt&auml;v&auml;sti p&auml;&auml;n ulkopuolelta)<sup id="ref-57_6" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>. Stereo&auml;&auml;nitys ei kaksiulotteisena vastaa reaalitodellisuudessa korviimme tulevaa &auml;&auml;nt&auml;, koska se sis&auml;lt&auml;&auml; vain alkeellisen syvyysvaikutelman (l&auml;hell&auml;--kaukana) ja leveysvaikutelman (vasen--oikea). Kolmiulotteinen &auml;&auml;ni (three-dimensional sound) luo illuusion syvyyden ja leveyden lis&auml;ksi my&ouml;s korkeudesta.</p>
<p>Kuulija voi siis paikantaa &auml;&auml;ni&auml; kaikista suunnista oman p&auml;&auml;ns&auml; ulkopuolelta, my&ouml;s edest&auml; ja takaa<sup id="ref-83_1" class="ref"><a href="#note-83" title="(Wu ym. 1997, 16)">[83]</a></sup>. Olemme jatkuvasti t&auml;llaisen akustisen kolmiulotteisen &auml;&auml;nikent&auml;n ymp&auml;r&ouml;im&auml;n&auml;. Binauraalinen &auml;&auml;nitys ei ole sidottu vertikaaliseen linjaan (toisin kuin stereossa), vaan &auml;&auml;net tuntuvat tulevan tietyst&auml; paikasta p&auml;&auml;n ulkopuolelta. Binauraalinen &auml;&auml;nitys kuulostaa realistisemmalta kuin stereo&auml;&auml;nitys. Binauraalinen &auml;&auml;ni voidaan Jot'n<sup id="ref-56_0" class="ref"><a href="#note-56" title="(Jot 1997, 56)">[56]</a></sup> mukaan toteuttaa kahdella tavalla: (a) &auml;&auml;nitt&auml;m&auml;ll&auml; &auml;&auml;nitapahtuma omassa akustisessa ymp&auml;rist&ouml;ss&auml;&auml;n tai (b) syntetisoimalla virtuaalinen &auml;&auml;nitapahtuma. KUVIOSSA 2 on havainnollistettu binauraalisen &auml;&auml;nen nauhoitusta ja toistoa (kohta (a))<sup id="ref-63_2" class="ref"><a href="#note-63" title="(McGrath 1995, 3)">[63]</a></sup>, ja KUVIOSSA 3 siirtofunktioiden mittausta ja simulointia (kohta (b))<sup id="ref-63_3" class="ref"><a href="#note-63" title="(McGrath 1995, 3)">[63]</a></sup>.</p>
<p><img id="figure-2" src="/assets/images/2002/06/bin_rec.png" alt="Binauraalinen &auml;&auml;nitys ja toisto" /></p>
<h5>KUVIO 2. Binauraalinen &auml;&auml;nitys ja toisto <a title="takaisin sis&auml;llysluetteloon" href="#toc-figure_2">^</a></h5>
<p>Ensiksi mainitussa tapauksessa &auml;&auml;nitys tehd&auml;&auml;n joko l&auml;himikityksell&auml; tai keinop&auml;&auml;n (dummy head, artificial head) tai koehenkil&ouml;n korvak&auml;yt&auml;viin asennetuilla mikrofoneilla. T&auml;ll&ouml;in &auml;&auml;nitapahtuma sis&auml;lt&auml;&auml; sek&auml; paikantamiseen ett&auml; huonekaikuun liittyv&auml;t elementit. Menettely kuitenkin hankaloittaa &auml;&auml;nen j&auml;lkik&auml;sittely&auml;. Kun taas &auml;&auml;nitapahtuma on synteettinen, paikantamiseen ja tilan akustisiin ominaisuuksiin liittyv&auml;t parametrit lis&auml;t&auml;&auml;n &auml;&auml;neen signaalinprosessoinnin avulla keinotekoisesti, &auml;&auml;nitt&auml;misen j&auml;lkeen siirtofunktion avulla<sup id="ref-57_7" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>. &Auml;&auml;nen binauraalisen k&auml;sittelyn avulla voidaan siis luoda kolmiulotteinen &auml;&auml;nikentt&auml; kahden kanavan avulla<sup id="ref-56_1" class="ref"><a href="#note-56" title="(Jot 1997, 60)">[56]</a></sup>.</p>
<p><img id="figure-3" src="/assets/images/2002/06/hrtf.png" alt="Siirtofunktioiden  mittaus ja simulointi" /></p>
<h5>KUVIO 3. Siirtofunktioiden  mittaus ja simulointi <a title="takaisin sis&auml;llysluetteloon" href="#toc-figure_3">^</a></h5>
<p>Burgess<sup id="ref-29_9" class="ref"><a href="#note-29" title="(Burgess 1992b, 55)">[29]</a></sup> kuvaa spatialisointiprosessia seuraavassa esitett&auml;v&auml;ll&auml; tavalla: Kutakin &auml;&auml;nil&auml;hteen koordinaattia pysty- ja vaakatasolla vastaa yksi siirtofunktio-suodatinpari kumpaakin korvaa varten. Jotta kuulija voi sijoittaa &auml;&auml;nen tiettyyn paikkaan &auml;&auml;nikent&auml;ss&auml;, kyseinen &auml;&auml;ni on prosessoitava vastaavalla suodatinparilla. Burgess<sup id="ref-29_10" class="ref"><a href="#note-29" title="(Burgess 1992b, 55)">[29]</a></sup> esitt&auml;&auml; <em>silmukka-algoritmin &auml;&auml;nten reaaliaikaiselle spatialisoinnille:</em></p>
<p>Prosessi 1:</p>
<ul>
<li>p&auml;ivit&auml; &auml;&auml;nen sijainti</li>
<li>hanki halutut vaaka- ja pystykoordinaatit</li>
<li>etsi l&auml;himm&auml;t siirtofunktio-suodatinparit</li>
<li>hanki haluttu suodatinpari</li>
<li>l&auml;het&auml; suodatinpari prosessi 2:seen</li>
</ul>
<p>Prosessi 2:</p>
<ul>
<li>k&auml;yt&auml; suodatinta</li>
<li>jaa monauraalinen l&auml;hdesignaali binauraaliseksi</li>
<li>lis&auml;&auml; vasen  ja oikea suodatin signaaleihin</li>
<li>konvertoi &auml;&auml;nikanavat analogisiksi ja soita &auml;&auml;ni</li>
<li>korvaa nykyinen suodatinpari uudella (takaisin prosessiin 1)</li>
</ul>
<p>Burgessin<sup id="ref-29_11" class="ref"><a href="#note-29" title="(Burgess 1992b, 53)">[29]</a></sup> mukaan uudet digitaaliset signaaliprosessorit mahdollistavat jo reaaliaikaisen spatialisoinnin. Prosessissa 2 jokainen yksitt&auml;inen monauraalinen &auml;&auml;ni siis jaetaan oikealle ja vasemmalle kanavalle, jonka j&auml;lkeen saadut stereoparit prosessoidaan halutulla suodattimella. Lopuksi kaikki valmiit stereoparit summataan yhdeksi stereotulosteeksi, joka toistetaan joko kuulokkeilla tai kaiuttimilla. Prosessi vaatii koneelta eritt&auml;in paljon laskutehoa, varsinkin jos tarkoituksena on luoda monipuolinen useista yksitt&auml;isist&auml; &auml;&auml;nil&auml;hteist&auml; muodostunut kolmiulotteinen &auml;&auml;nikentt&auml;.</p>
<p>Alten<sup id="ref-3" class="ref"><a href="#note-3" title="(Alten 1999, 417)">[3]</a></sup> mainitsee stereo&auml;&auml;nen ja kolmiulotteisen (binauraalisen) &auml;&auml;nen lis&auml;ksi viel&auml; <em>surround-&auml;&auml;nen</em> menetelm&auml;n&auml; luoda spatiaalinen &auml;&auml;nikentt&auml;. Kolmiulotteinen surround-&auml;&auml;ni saadaan aikaan sijoittamalla kaiuttimia eri puolille kuulijaa. T&auml;llaiseen monikaiutinj&auml;rjestelm&auml;&auml;n ei kuitenkaan t&auml;ss&auml; tutkimuksessa puututa, vaan spatialisoidun &auml;&auml;nen toisto rajoitetaan tapahtuvaksi kuulokkeilla tai vaihtoehtoisesti kahdella kaiuttimella (ks. <a title="kohta 3.5" href="#ch-3_5">kohta 3.5</a>). Spatialisointi on siis menettelytapa, jolla luodaan kolmiulotteinen &auml;&auml;nikentt&auml;, josta voidaan erottaa ja paikantaa &auml;&auml;nil&auml;hteit&auml; eri suunnissa. Kun &auml;&auml;net on spatialisoitu, kuulija voi erottaa &auml;&auml;nikent&auml;st&auml; eri l&auml;hteit&auml;, keskitty&auml; niihin ja sivuuttaa muut.</p>
<p>Asia erikseen on "mentaalinen" spatialisaatio. Chionin<sup id="ref-33_17" class="ref"><a href="#note-33" title="(Chion 1990, 69)">[33]</a></sup> mukaan perinteisess&auml; monauraalisessa elokuvassa sijainti, josta &auml;&auml;ni fyysisesti tulee, ei ole sama kuin mist&auml; se koetaan tulevan. Esimerkiksi jos henkil&ouml; elokuvassa k&auml;velee ruudun halki, askeleet koetaan kuuluvan ja seuraavan henkil&ouml;&auml;, vaikka ne todellisuudessa kuuluvat samasta staattisesta kaiuttimesta.<sup id="ref-33_18" class="ref"><a href="#note-33" title="(Chion 1990, 69)">[33]</a></sup>. T&auml;ll&ouml;in spatiaalisuus koetaan &auml;&auml;nen ja kuvan yhteisvaikutuksena mielen tasolla, ei fyysisesti (ks. audiovisuaalinen sopimus, <a title="kohta 2.4" href="#ch-2_4">kohta 2.4</a>).</p>
</div>
<div id="ch-3_4">
<h4>3.4 Auralisaatio  <a title="takaisin sis&auml;llysluetteloon" href="#toc-3_4">^</a></h4>
<p><em>Auralisaatio</em> on visualisaation vastine kuuloaistin alueella<sup id="ref-63_4" class="ref"><a href="#note-63" title="(McGrath 1995, 1)">[63]</a></sup>. Begaultin<sup id="ref-13_2" class="ref"><a href="#note-13" title="(Begault 1994, 145)">[13]</a></sup> mukaan auralisaatiossa luodaan jokin akustinen virtuaalitila huonekaiun mallintamisen ja synteettisen spatialisoinnin avulla. Siirtofunktio-suodattimilla prosessoidaan sek&auml; suora &auml;&auml;ni ett&auml; heijastuneet &auml;&auml;net. Kendallin<sup id="ref-57_8" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup> mukaan et&auml;isyys- ja tilavaikutelma luodaan &auml;&auml;neen kontrolloimalla ensiheijastumien ja j&auml;lkikaiunnan m&auml;&auml;r&auml;&auml;. Kleiner ym.<sup id="ref-58_1" class="ref"><a href="#note-58" title="(Kleiner ym. 1993, 861)">[58]</a></sup> ovat m&auml;&auml;ritelleet auralisaation seuraavasti:</p>
<blockquote>
<p class="quote">Auralization is the process of rendering audible, by physical or mathematical modeling, the sound field of a source in a space, in such a way as to simulate the binaural listening experience at a given position in the modeled space.</p>
<p class="author">Kleiner ym. (1993, 861)</p>
</blockquote>
<p>Tavoitteena auralisaatiossa on siis luoda vaikutelma jonkin tilan akustisista ominaispiirteist&auml;, siihen liittyvist&auml; &auml;&auml;nist&auml; sek&auml; niiden sijainnista &auml;&auml;nikent&auml;ss&auml; riippuen kuulijan sen hetkisest&auml; sijainnista kyseisess&auml; tilassa. T&auml;m&auml; tila voi olla joko jonkin olemassaolevan paikan virtuaalinen vastine tai t&auml;ysin kuviteltu tila. &Auml;&auml;nimateriaali suodatetaan ja prosessoidaan digitaalisesti, jolloin tuloksena on edell&auml;mainittu illuusio, joka on luotu tietyn paikan akustisten tunnuspiirteiden avulla.<sup id="ref-58_2" class="ref"><a href="#note-58" title="(Kleiner ym. 1993, 861)">[58]</a></sup>. Auralisaatioj&auml;rjestelm&auml; koostuu yksinkertaisimmillaan &auml;&auml;nil&auml;hteest&auml;, tilasta ja kuulijasta, jotka on mallinnettava erikseen<sup id="ref-58_3" class="ref"><a href="#note-58" title="(Kleiner ym. 1993, 862)">[58]</a></sup><sup id="ref-13_3" class="ref"><a href="#note-13" title="(Begault 1994, 4)">[13]</a></sup>. Siin&auml; miss&auml; spatialisoinnilla tarkoitetaan &auml;&auml;nen teknist&auml; prosessointimenetelm&auml;&auml;, auralisaatiolla viitataan t&auml;ss&auml; tutkimuksessa kattavampaan prosessiin, joka pit&auml;&auml; sis&auml;ll&auml;&auml;n koko &auml;&auml;nimaiseman mallintamisen. K&auml;ytt&ouml;liittym&auml;ss&auml; oleellista on, ett&auml; mallinnus t&auml;ht&auml;&auml; tehokkaaseen vuorovaikutukseen ja tavoitteelliseen toimintaan.</p>
</div>
<div id="ch-3_5">
<h4>3.5 Kaiutin- ja kuuloke&auml;&auml;nentoiston vastakkainasettelu <a title="takaisin sis&auml;llysluetteloon" href="#toc-3_5">^</a></h4>
<p>Ongelmana kaiutin&auml;&auml;nentoistossa on, ett&auml; vasemmasta kaiuttimesta kuuluva &auml;&auml;ni havaitaan my&ouml;s oikeassa korvassa ja toisinp&auml;in (crosstalk)<sup id="ref-53_2" class="ref"><a href="#note-53" title="(Huopaniemi 1999, 30)">[53]</a></sup>. Ongelmaa on pyritty minimoimaan kehitt&auml;m&auml;ll&auml; tekniikoita ristikk&auml;isten signaalien eliminoimiseksi (crosstalk cancelled binaural processing). Huopaniemi<sup id="ref-53_3" class="ref"><a href="#note-53" title="(Huopaniemi 1999, 30)">[53]</a></sup> mainitsee kaksi rajoitusta binauraalisessa kaiutinkuuntelussa: ensinn&auml;kin kuulijan on oltava paikallaan ja toiseksi kuunteluhuoneen on oltava mahdollisimman kaiuton. Kendallin<sup id="ref-57_9" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup> mukaan 1 millisekunnin aikana tulevat heijastukset tuhoavat siirtofunktion vaikutuksen, joten heijastukset kaiuttimien ja kuulijan l&auml;hell&auml; on eliminoitava.</p>
<p>Kolmiulotteinen spatialisointi kaiuttimilla toistettaessa onnistuu siis parhaiten silloin, kun kuulijan sijainti kaiuttimiin n&auml;hden on etuk&auml;teen tiedossa ja pysyy samana koko ajan. T&auml;m&auml; viittaisi siihen, ett&auml; kolmiulotteista &auml;&auml;nt&auml; voitaisiin k&auml;ytt&auml;&auml; kotitietokoneeseen liitettyjen kahden kaiuttimen avulla, koska tietokoneen k&auml;ytt&auml;j&auml; istuu koko ajan paikallaan. Ongelmana ovat kuitenkin suuret tehovaatimukset ja kaiun eliminointi kotioloissa. "Crosstalkin" luotettava eliminointi voisi lis&auml;t&auml; kaksikanavaisen, kolmiuloitteisen &auml;&auml;nentoiston mahdollisuuksia multimediak&auml;ytt&ouml;liittymiss&auml; ja kotikoneissa<sup id="ref-56_2" class="ref"><a href="#note-56" title="(Jot 1997, 62)">[56]</a></sup>. Kaiutinkuuntelu on helpompi toteuttaa kuin kuulokekuuntelu, mutta se ei tuota yht&auml; luotettavaa tulosta. Kaiutinkuuntelun onnistuminen riippuu Jot'n<sup id="ref-56_3" class="ref"><a href="#note-56" title="(Jot 1997, 60)">[56]</a></sup> mukaan ainakin k&auml;ytetyst&auml; tekniikasta, simuloitavien &auml;&auml;nten suunnista, kaiuttimien suuntaavuudesta sek&auml; kuunteluhuoneen koosta ja akustisista ominaisuuksista. Kaiutinkuuntelussa paikantaminen etualalla on huomattavasti helpompaa kuin paikantaminen takana tai yl&auml;puolella<sup id="ref-56_4" class="ref"><a href="#note-56" title="(Jot 1997, 62)">[56]</a></sup>.</p>
<p>Etuna kuuloke&auml;&auml;nentoistossa taas on, ett&auml; kuunteluhuoneen akustiikka tai kuulijan sijainti huoneessa eiv&auml;t vaikuta kuulokokemukseen<sup id="ref-53_4" class="ref"><a href="#note-53" title="(Huopaniemi 1999, 30)">[53]</a></sup>. Kuulokkeet my&ouml;s mahdollistavat spatiaalisen &auml;&auml;nil&auml;hteen sijainnin tarkemman kontrollin<sup id="ref-81_1" class="ref"><a href="#note-81" title="(Wenzel ym. 1991, 351)">[81]</a></sup><sup id="ref-63_5" class="ref"><a href="#note-63" title="(McGrath 1995, 4)">[63]</a></sup><sup id="ref-14" class="ref"><a href="#note-14" title="(Begault 1999, 14)">[14]</a></sup>. Kendallin<sup id="ref-57_10" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup> mielest&auml; haittana voi kuitenkin olla se, ett&auml; huolimatta vaihe- ja voimakkuuseroista &auml;&auml;nt&auml; ei koeta tulevan riitt&auml;v&auml;sti p&auml;&auml;n ulkopuolelta, vaan &auml;&auml;ni vain lateralisoituu joko vasempaan tai oikeaan kuulokkeeseen. Toinen ongelma on etu- ja taka-alan sekoittaminen, jota kuitenkin voidaan v&auml;hent&auml;&auml; liioittelemalla huomattavasti niit&auml; &auml;&auml;nen spektraalisia muunnoksia, joita edess&auml; ja takana olevat &auml;&auml;nil&auml;hteet aiheuttavat<sup id="ref-57_11" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>. Kuulokekuuntelun avulla voidaan luoda luonnollisen tuntuinen kolmiulotteinen &auml;&auml;nikentt&auml;, mutta haittana on kallis ja monimutkainen toteutus. Tekniikan kehittyess&auml; t&auml;m&auml; ongelma poistunee, jolloin my&ouml;s kaupallisissa sovelluksissa voidaan kuulla hyv&auml;tasoista spatiaalista &auml;&auml;nt&auml;.</p>
</div>
<div id="ch-3_6">
<h4>3.6 &Auml;&auml;nen spatialisoinnin ongelmat <a title="takaisin sis&auml;llysluetteloon" href="#toc-3_6">^</a></h4>
<p>Suurimmat haasteet kolmiulotteisen &auml;&auml;nikent&auml;n toteuttamisessa ovat Begaultin<sup id="ref-12_5" class="ref"><a href="#note-12" title="(Begault 1991, 865">[12]</a></sup> ja Kleinerin ym.<sup id="ref-58_4" class="ref"><a href="#note-58" title="(Kleiner ym. 1993, 865">[58]</a></sup> mukaan seuraavat: edess&auml; ja takana olevien peilikuva&auml;&auml;nten poistaminen, paikantamisvirheiden minimointi, ihmisen havaintokyvylle riitt&auml;v&auml;n siirtofunktiomittaustason saavuttaminen mahdollisimman pienell&auml; datam&auml;&auml;r&auml;ll&auml; sek&auml; ratkaisun l&ouml;yt&auml;minen mitattujen siirtofunktioiden ja havaitun kuulokuvan v&auml;lill&auml; vallitseviin ristiriitoihin.</p>
<p>Kuulijan voi olla vaikea paikantaa &auml;&auml;ni edest&auml; tai takaa tulevaksi<sup id="ref-29_12" class="ref"><a href="#note-29" title="(Burgess 1992b, 56)">[29]</a></sup>. Kendallin<sup id="ref-57_12" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup> mukaan n&auml;m&auml; paikantamisvaikeudet pystyakselilla johtuvat korvien saamasta yht&auml;suuresta vaihe- ja voimakkuusinformaatiosta, eli peilikuva&auml;&auml;nest&auml;. T&auml;ll&ouml;in paikantaminen perustuu v&auml;h&auml;isiin spektraalisiin eroihin siirtofunktion perusteella<sup id="ref-12_6" class="ref"><a href="#note-6" title="(Begault 1991, 866)">[12]</a></sup><sup id="ref-54_18" class="ref"><a href="#note-54" title="(Jauhiainen 1995, 152)">[54]</a></sup><sup id="ref-57_13" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>. Burgessin<sup id="ref-29_13" class="ref"><a href="#note-29" title="(Burgess 1992b, 57)">[29]</a></sup> mukaan p&auml;&auml;asialliset vihjeet &auml;&auml;nen sijainnista kuulijan edess&auml; tai takana saadaan p&auml;&auml;n k&auml;&auml;nt&auml;misen ja korvalehtien vaikutuksen perusteella. My&ouml;s simuloidun huoneen ensiheijastumien lis&auml;&auml;minen spatialisoituun &auml;&auml;neen helpottaa Burgessin<sup id="ref-29_14" class="ref"><a href="#note-29" title="(Burgess 1992b, 57)">[29]</a></sup> mukaan &auml;&auml;nen paikantumista eteen tai taakse.</p>
<p>N&auml;it&auml; paikantamiseen liittyvi&auml; ongelmia voidaan huomattavasti v&auml;hent&auml;&auml;, jos spatialisaatioj&auml;rjestelm&auml;&auml;n liitet&auml;&auml;n erityinen laite, joka tarkkailee p&auml;&auml;n asentoa<sup id="ref-63_6" class="ref"><a href="#note-63" title="(McGrath 1995, 5)">[63]</a></sup>. T&auml;llainen "head tracker" v&auml;litt&auml;&auml; tiedot p&auml;&auml;n asennosta tietokoneelle, joka p&auml;ivitt&auml;&auml; samanaikaisesti suodatinparien suuntatiedot. N&auml;in kuulija kokee p&auml;&auml;t&auml; k&auml;&auml;nt&auml;ess&auml;&auml;n &auml;&auml;nil&auml;hteen pysyv&auml;n koko ajan samassa paikassa<sup id="ref-57_14" class="ref"><a href="#note-57" title="(Kendall 1995)">[57]</a></sup>. T&auml;ll&auml; tavalla voidaan todellisuutta j&auml;ljent&auml;m&auml;ll&auml; lis&auml;t&auml; kokemusta, ett&auml; &auml;&auml;ni tulee p&auml;&auml;n ulkopuolelta. Jos &auml;&auml;nt&auml; ei koeta tulevan riitt&auml;v&auml;n vahvasti p&auml;&auml;n ulkopuolelta, se saattaa johtua ep&auml;tarkasti mitatusta siirtofunktiosta<sup id="ref-29_15" class="ref"><a href="#note-29" title="(Burgess 1992b, 56)">[29]</a></sup>.</p>
<p>Synteettisesti spatialisoitu &auml;&auml;nikentt&auml; -- virtuaalinen kuulokokemus -- voi poiketa suurestikin j&auml;ljitelt&auml;v&auml;st&auml; akustisesta kuulokokemuksesta. Virheit&auml; voi esiinty&auml; joko &auml;&auml;nil&auml;hteen, tilan tai kuuntelijan mallinnuksessa. Kolme keskeisint&auml; paikantamisvirheiden aiheuttajaa ovat ep&auml;tarkat siirtofunktiot, k&auml;ytett&auml;vien &auml;&auml;nten erilaiset ominaispiirteet (esim. taajuus ja voimakkuus) sek&auml; j&auml;rjestelm&auml;n spatiaalinen erotuskyky<sup id="ref-12_7" class="ref"><a href="#note-12" title="(Begault 1991, 865)">[12]</a></sup>. Begault<sup id="ref-12_8" class="ref"><a href="#note-12" title="(Begault 1991, 865)">[12]</a></sup>toteaa my&ouml;s, ett&auml; vaikka n&auml;m&auml; kaikki kolme tekij&auml;&auml; olisivatkin kunnossa, ongelmia voi silti aiheuttaa kuulijoiden vaihteleva paikantamiskyky. Useimmiten on tyydytt&auml;v&auml; kompromissiin ja k&auml;ytett&auml;v&auml; keskim&auml;&auml;r&auml;isi&auml; siirtofunktioita. Lukemattomien yksitt&auml;isten &auml;&auml;nten spatialisaatio eri puolille kolmiuloitteista &auml;&auml;nikentt&auml;&auml; vaatii tietokoneelta suurta suorituskyky&auml;. P&auml;&auml;m&auml;&auml;r&auml;n&auml; spatialisoinnissa on pidett&auml;v&auml; riitt&auml;v&auml;n tarkkaa akustisen ymp&auml;rist&ouml;n virtuaalitoistoa mahdollisimman pienell&auml; datam&auml;&auml;r&auml;ll&auml;. Akustista tilaa ei tietenk&auml;&auml;n aina tarvitse edes t&auml;ytt&auml;&auml;. Kuten Chion<sup id="ref-33_19" class="ref"><a href="#note-33" title="(Chion 1990, 154)">[33]</a></sup> sanoo: spatiaalisuus suurentaa sit&auml; tilaa, joka mahdollisesti voidaan t&auml;ytt&auml;&auml; &auml;&auml;nill&auml;. T&auml;ll&ouml;in p&auml;&auml;st&auml;&auml;n Blyn<sup id="ref-18_1" class="ref"><a href="#note-18" title="(Bly 1982, 375)">[18]</a></sup> mainitsemaan uuteen ulottuvuuteen. Seuraavassa kohdassa k&auml;sitell&auml;&auml;n t&auml;t&auml; uutta ulottuvuutta muutaman sovelluksen kautta.</p>
</div>
<div id="ch-3_7">
<h4>3.7 Spatiaalista &auml;&auml;nt&auml; hy&ouml;dynt&auml;vi&auml; sovelluksia <a title="takaisin sis&auml;llysluetteloon" href="#toc-3_7">^</a></h4>
<p>Akustinen ekologia sopii hyvin l&auml;ht&ouml;kohdaksi k&auml;ytt&ouml;liittym&auml;suunnittelulle, koska spatiaalinen &auml;&auml;ni kuuluu luonnolliseen &auml;&auml;niymp&auml;rist&ouml;&ouml;mme. K&auml;ytt&ouml;liittym&auml;suunnittelija ei kuitenkaan ole sidottu fyysiseen &auml;&auml;niymp&auml;rist&ouml;&ouml;n<sup id="ref-60_8" class="ref"><a href="#note-60" title="(Kramer 1994, 56)">[60]</a></sup>. Tietokonepeleiss&auml; on k&auml;ytetty jonkin verran kolmiulotteista &auml;&auml;nt&auml;, joskin Goosen ja M&ouml;llerin<sup id="ref-50_4" class="ref"><a href="#note-50" title="(Goose ja M&ouml;ller 1999, 366)">[50]</a></sup> mukaan n&auml;it&auml; &auml;&auml;niefektej&auml; on k&auml;ytetty l&auml;hes yksinomaan tunnelman luomiseen, eik&auml; peleiss&auml; ole juurikaan hy&ouml;dynnetty &auml;&auml;nten spatialisointia. Spatialisoinnin avulla voidaan kuitenkin tarjota lis&auml;informaatiota ja lis&auml;t&auml; pelin todentuntuisuutta. Wenzelin ym.<sup id="ref-81_2" class="ref"><a href="#note-81" title="(Wenzel ym. 1991, 351)">[81]</a></sup> ja Wenzelin<sup id="ref-80_0" class="ref"><a href="#note-80" title="(Wenzel 1994, 38)">[80]</a></sup> mukaan spatiaalisen &auml;&auml;nen k&auml;yt&ouml;ll&auml; on ainakin kaksi etua: (a) objektien ja niiden v&auml;listen suhteiden havaitseminen kolmiulotteisessa teht&auml;v&auml;avaruudessa ja (b) useiden &auml;&auml;nivirtojen havaitseminen samanaikaisesti, jolloin kuulija voi vaihdella huomiotaan eri &auml;&auml;nivirtojen kesken. T&auml;ll&ouml;in siis yhdistet&auml;&auml;n objektien merkityksi&auml; ja suuntatietoa. T&auml;t&auml; seikkaa on k&auml;ytetty hyv&auml;ksi jo useissa sovelluksissa ja prototyypeiss&auml;, joista seuraavassa esitell&auml;&auml;n t&auml;rkeimm&auml;t.</p>
<p>"AudioStreamer"-sovellus perustuu &auml;&auml;nen spatiaaliselle erottelulle ja samanaikaiselle kuuntelulle; k&auml;ytt&auml;j&auml; voi p&auml;&auml;t&auml;&auml;n k&auml;&auml;nt&auml;m&auml;ll&auml; valita mieleisens&auml; kanavan kolmesta vaihtoehdosta, jolloin kyseisen kanavan &auml;&auml;nenvoimakkuus kasvaa<sup id="ref-72" class="ref"><a href="#note-72" title="(Schmandt &amp; Mullins 1995, 218)">[72]</a></sup>. Sovelluksessa k&auml;ytt&auml;j&auml; siis kommunikoi k&auml;ytt&ouml;liittym&auml;n kanssa p&auml;&auml;n liikkeiden avulla (manuaalisen k&auml;ytt&ouml;liittym&auml;n sijaan), ja per&auml;kk&auml;inen &auml;&auml;nentoisto on korvattu monikanavaisella &auml;&auml;nentoistolla. Sovellus perustuu paikallaan pysyville &auml;&auml;nil&auml;hteille. Sawhney ja Schmandt<sup id="ref-68_0" class="ref"><a href="#note-68" title="(Sawhney ja Schmandt 1997, 110)">[68]</a></sup> ovat k&auml;ytt&auml;neet radiota metaforana &auml;&auml;nitiedostojen selaamisessa ja kokeilleet ajatuksiaan "Nomadic Radio"--prototyypiss&auml;. He esittelev&auml;t <em>kolme spatiaalisen kuuntelun toimintatilaa</em><sup id="ref-68_1" class="ref"><a href="#note-68" title="(Sawhney ja Schmandt 1997, 111)">[68]</a></sup>:</p>
<dl>
<dt><em>L&auml;hetys:</em></dt>
<dd>viesti l&auml;hetet&auml;&auml;n tietyst&auml; sijainnista tilassa. Viesti on kuultavissa taka-alalla hetken ennen h&auml;ipymist&auml;&auml;n kuulumattomiin, ellei k&auml;ytt&auml;j&auml; reagoi siihen ennen sit&auml;. Vertaus perustuu radion kuunteluun, jossa kuulija aktivoituu vasta sitten, kun kuulee mielenkiintoisen kohdan.</dd>
<dt><em>Selaus:</em></dt>
<dd>k&auml;ytt&auml;j&auml; voi selata viestej&auml; ja tuoda jonkun niist&auml; etualalle. T&auml;m&auml; vertaus perustuu radiokanavien aktiiviseen kuunteluun ja selailuun, kunnes mieluisa kanava l&ouml;ytyy.</dd>
<dt><em>Vilkaiseminen:</em></dt>
<dd>Nopea katsaus kaikkiin viesteihin siirt&auml;m&auml;ll&auml; ne kuuntelualueen keskelle.</dd>
</dl>
<p>Radio-metafora vaikuttaa olevan k&auml;ytt&ouml;kelpoinen (vaikka siin&auml; onkin lis&auml;ominaisuutena spatiaalisuus). Koska &auml;&auml;ni on v&auml;liaikaista, sen avulla ei voi selata useita tiedostoja samalla tavalla kuin teksti&auml; ja kuvia n&auml;k&ouml;aistin avulla <sup id="ref-59_0" class="ref"><a href="#note-59" title="(Kobayashi &amp; Schmandt 1997, 194)">[59]</a></sup><sup id="ref-68_2" class="ref"><a href="#note-68" title="(Sawhney &amp; Schmandt 1997, 109--110)">[68]</a></sup>. &Auml;&auml;nen sijainnin avulla voidaan antaa tietoa viestin kategoriasta tai kiireellisyydest&auml;<sup id="ref-68_3" class="ref"><a href="#note-68" title="(Sawhney &amp; Schmandt 1997, 109--110)">[68]</a></sup>. "Multimedia Browser"--prototyypiss&auml; Fernstr&ouml;m ja Bannon<sup id="ref-39" class="ref"><a href="#note-39" title="(Fernstr&ouml;m ja Bannon 1997)">[39]</a></sup> kokeilivat sijoittaa useita &auml;&auml;nitiedostoja stereo&auml;&auml;nikentt&auml;&auml;n niiden visuaalisen sijainnin mukaan n&auml;yt&ouml;ll&auml;. Osoittamalla nuolella tietty&auml; visuaalista objektia, vastaava &auml;&auml;nitiedosto soi samassa sijainnissa.</p>
<p>Kobayashi ja Schmandt<sup id="ref-59_1" class="ref"><a href="#note-59" title="(Kobayashi ja Schmandt 1997)">[59]</a></sup> kehittiv&auml;t spatiaalisen k&auml;ytt&ouml;liittym&auml;n ("Dynamic Soundscape"), joka perustuu &auml;&auml;nen sijainnin muistamiselle ajassa. Eteen- ja takaisinkelauksen sijaan kuuntelija vaihtaa huomiotaan liikkuvien &auml;&auml;nil&auml;hteiden kesken (jotka toistavat saman &auml;&auml;nityksen eri kohtia samanaikaisesti), jolloin kuuntelija voi kytke&auml; tietyn ajankohdan &auml;&auml;nitiedostosta tiettyyn sijaintiin<sup id="ref-59_2" class="ref"><a href="#note-59" title="(Kobayashi ja Schmandt 1997, 194)">[59]</a></sup>. K&auml;ytt&auml;j&auml; voi siten selata &auml;&auml;nitapahtumia samoin kuin selaisi visuaalisia objekteja. Vaikka k&auml;ytt&auml;j&auml; keskittyy yhteen &auml;&auml;nitapahtumaan kerrallaan, h&auml;n kuulee muutkin &auml;&auml;nitapahtumat taustalla. Sen sijaan, ett&auml; k&auml;ytt&auml;j&auml;t ajattelisivat "aihe jonka kuulin 20 sekuntia sitten", he voivat ajatella "aihe jonka kuulin takavasemmalta". T&auml;ll&auml; tavalla spatiaalisen muistin avulla korvataan ajallisen muistin heikkouksia.<sup id="ref-59_3" class="ref"><a href="#note-59" title="(Kobayashi ja Schmandt 1997, 196)">[59]</a></sup>.</p>
<p>Toteutuksessa oli kuitenkin muutamia ongelmia: kuuntelijoilla oli vaikeuksia muistaa &auml;&auml;nityksen tietyn kohdan sijainti<sup id="ref-59_4" class="ref"><a href="#note-59" title="(Kobayashi &amp; Schmandt 1997, 196--198)">[59]</a></sup>. Muistamista vaikeutti ainakin se, ett&auml; &auml;&auml;nitapahtumat olivat liikkuvia. Mit&auml; hitaammin &auml;&auml;nitapahtumat liikkuivat, sit&auml; paremmin kuuntelijat kytkiv&auml;t kohdan sijaintiin. Toinen ongelma oli, ett&auml; spatiaalisen muistin resoluutio on huono: voimme sanoa, ett&auml; "kohde vasemmalla ylh&auml;&auml;ll&auml;", mutta emme ett&auml; "kohde 38 astetta keskikohdasta vasemmalle". Spatiaalinen sijainti voidaan muistaa vain ympyr&auml;n kahdestoistaosan tarkkuudella.<sup id="ref-59_5" class="ref"><a href="#note-59" title="(Kobayashi &amp; Schmandt 1997, 196--198)">[59]</a></sup>.</p>
<p>Tekij&ouml;iden idea on kuitenkin kehityskelpoinen: vastakkainasettelu (per&auml;kk&auml;isen) eteen- ja takaisinkelauksen ja selektiivisen (samanaikaisen) kuuntelun v&auml;lill&auml; tuntuu toimivan. Spatiaalinen esitys tarjoaa mahdollisuuden j&auml;rjestell&auml; informaatiota ja hy&ouml;dynt&auml;&auml; k&auml;ytt&auml;j&auml;n muistia paremmin. Goose ja M&ouml;ller<sup id="ref-50_5" class="ref"><a href="#note-50" title="(Goose ja M&ouml;ller 1999, 363)">[50]</a></sup> taas ovat esitt&auml;neet k&auml;sitteellisen mallin <abbr title="HyperText Markup Language">html</abbr>-dokumentin rakenteen kytkemiselle spatiaaliseen &auml;&auml;niavaruuteen. Mallissa on uutta se, ett&auml; siin&auml; pyrit&auml;&auml;n ensi kertaa kytkem&auml;&auml;n dokumentin rakenne spatiaaliseen &auml;&auml;neen, tavanomaisen dokumentin sis&auml;ll&ouml;n sijaan. Walker ja Brewster<sup id="ref-76_1" class="ref"><a href="#note-76" title="(Walker ja Brewster 2000)">[76]</a></sup> ovat tutkineet spatiaalisen &auml;&auml;nen k&auml;ytt&ouml;&auml; mobiileissa laitteissa ja kokeilleet spatialisoitua &auml;&auml;nt&auml; ja sijainnin muuttumista kuvaamaan tiedoston latautumista. He p&auml;&auml;tteliv&auml;t, ett&auml; spatiaalinen &auml;&auml;ni lis&auml;si tarkkuutta taustaprosessin monitoroinnissa ja tehosti keskittymist&auml; samanaikaisesti suoritettuun p&auml;&auml;teht&auml;v&auml;&auml;n<sup id="ref-76_2" class="ref"><a href="#note-76" title="(Walker ja Brewster 2000, 12)">[76]</a></sup>.</p>
<p>Edell&auml; esitetyn perusteella voidaan p&auml;&auml;tell&auml;, ett&auml; spatiaalinen &auml;&auml;ni muodostaa mielenkiintoisen uuden ulottuvuuden k&auml;ytt&ouml;liittym&auml;&auml;n, varsinkin yhdistett&auml;ess&auml; visuaaliseen informaatioon. Luvussa on esitetty paikantamiseen vaikuttavat tekij&auml;t, korvan "h&auml;m&auml;&auml;miseen" perustuva synteettisen spatialisoinnin periaate sek&auml; keskeisimm&auml;t ongelmat sen toteutuksessa. Sovelluksista voidaan kuitenkin p&auml;&auml;tell&auml;, ett&auml; vaikeudet ovat voitettavissa: 1990-luvun loppuun menness&auml; jo useat sovellukset ovat menestyksellisesti hy&ouml;dynt&auml;neet spatiaalista &auml;&auml;nt&auml;. Mik&auml; parasta, n&auml;m&auml; sovellukset ovat osoittaneet k&auml;yt&auml;nn&ouml;n toteutuksen ja koehenkil&ouml;iden kokemuksien kautta ne kohdat, joissa on parantamisen varaa. Kehitett&auml;v&auml;&auml; todellakin on, mutta tekniikan edistyess&auml; ongelmaksi j&auml;&auml; edelleen se, miten spatiaalista &auml;&auml;nt&auml; tulisi k&auml;ytt&auml;&auml;.</p>
<p>Spatiaalinen &auml;&auml;ni muodostaa tavallaan kannettavan "kuplan" k&auml;ytt&auml;j&auml;n p&auml;&auml;n ymp&auml;rille, jolloin informaatiota voidaan j&auml;rjestell&auml; laajemmalle alueelle kuin visuaalista informaatiota. T&auml;m&auml; spatiaalinen kupla voidaan jakaa pienemmiksi tiloiksi, jotka sis&auml;lt&auml;v&auml;t paikallisia ja globaaleja merkityksellisi&auml; &auml;&auml;ni&auml;.  Enkoodaamalla &auml;&auml;nen parametri (t&auml;ss&auml; tapauksessa spatiaalinen &auml;&auml;ni) kuhunkin ajassa olevaan pisteeseen, saadaan aikaan "laulu", jota kuuntelemalla voidaan m&auml;&auml;ritell&auml; merkityksellisi&auml; kohtia ja muutoksia<sup id="ref-18_2" class="ref"><a href="#note-18" title="(Bly 1982, 374)">[18]</a></sup>. T&auml;m&auml; on seuraavan luvun aihe.</p>
</div>
<div id="ch-4">
<h3>4. &Auml;&auml;nimaisema-analyysi k&auml;ytt&ouml;liittym&auml;ss&auml; <a title="takaisin sis&auml;llysluetteloon" href="#toc-4">^</a></h3>
<p>T&auml;ss&auml; luvussa pyrit&auml;&auml;n yhdist&auml;m&auml;&auml;n &auml;&auml;nen suunnan tuottama merkityssis&auml;lt&ouml; k&auml;ytt&ouml;liittym&auml;n toimintoihin. Luvussa tarkastellaan &auml;&auml;nen mahdollisia funktioita k&auml;ytt&ouml;liittym&auml;ss&auml;, jonka j&auml;lkeen analysoidaan &auml;&auml;ni&auml; semioottisessa viitekehyksess&auml;. Lopuksi tarkastellaan erilaisia &auml;&auml;nten luokitteluj&auml;rjestelmi&auml;. Ensin on kuitenkin pohdittava hiljaisuuden merkityst&auml;.</p>
</div>
<div id="ch-4_1">
<h4>4.1 Hiljaisuus <a title="takaisin sis&auml;llysluetteloon" href="#toc-4_1">^</a></h4>
<p>Kun n&auml;in kauan olemme puhuneet &auml;&auml;nest&auml;, on tarpeen k&auml;sitell&auml; ei-&auml;&auml;nt&auml;: hiljaisuutta. Chion<sup id="ref-33_20" class="ref"><a href="#note-33" title="(Chion 1990, 57)">[33]</a></sup> korostaa, ett&auml; hiljaisuus ei ole koskaan neutraalia tyhjyytt&auml;; se on aiemmin kuullun tai odotetun, kuvitellun &auml;&auml;nen negatiivi. Kun hiljaisuus ennakoi &auml;&auml;nt&auml;, hermostunut odotus tekee sen el&auml;v&auml;ksi; kun taas hiljaisuus keskeytt&auml;&auml; &auml;&auml;nen tai seuraa sit&auml;, hiljaisuus on t&auml;ynn&auml; sit&auml; edelt&auml;neen &auml;&auml;nen j&auml;lkivaikutusta niin kauan, kuin muisti jaksaa sit&auml; sellaisena pit&auml;&auml;<sup id="ref-71_8" class="ref"><a href="#note-71" title="(Schafer 1977, 257)">[71]</a></sup>. N&auml;in &auml;&auml;ni siis luo kontrasteja. L&auml;nsimaisessa kirjallisuudessa hiljaisuus on kuitenkin usein kuvattu ahdistavaksi, yksin&auml;iseksi tai raskaaksi, vain harvoin t&auml;yttymyksen tai tyytyv&auml;isyyden tilaksi tai muuten positiiviseksi ilmi&ouml;ksi<sup id="ref-71_9" class="ref"><a href="#note-71" title="(Schafer 1977, 146)">[71]</a></sup>. Schaferin<sup id="ref-71_10" class="ref"><a href="#note-71" title="(Schafer 1977, 256)">[71]</a></sup> mielest&auml; l&auml;nsimaiselle ihmiselle hiljaisuus on negatiivista; se pit&auml;&auml; rikkoa vaikka v&auml;kisin. Toisaalta absoluuttista hiljaisuutta ei ole olemassakaan, koska aina on jotain, joka aiheuttaa &auml;&auml;nt&auml;.</p>
<p>Gaverin "SonicFinder" oli menestys: totuttuaan siihen k&auml;ytt&auml;j&auml;t valittivat &auml;&auml;nten puuttumista k&auml;ytt&auml;ess&auml;&auml;n &auml;&auml;net&ouml;nt&auml; versiota<sup id="ref-43_5" class="ref"><a href="#note-43" title="(Gaver 1989, 82)">[43]</a></sup>. &Auml;&auml;nik&auml;ytt&ouml;liittym&auml;&auml;n voi siis tottua. Onko meid&auml;t kuitenkin pakotettu tottumaan &auml;&auml;nett&ouml;m&auml;&auml;n k&auml;ytt&ouml;liittym&auml;&auml;n ja sen piinaavaan, yksin&auml;iseen hiljaisuuteen; hiljaisuuteen joka on vain tyhj&auml; negatiivi ilman informaatioarvoa? Kun k&auml;ytt&ouml;liittym&auml; jaetaan &auml;&auml;nett&ouml;myyteen ja kuuluvuuteen, my&ouml;s hiljaisuus saa uuden merkityksen. J&auml;lleen p&auml;&auml;st&auml;&auml;n kontekstiin: hiljaisuus merkitsee eri asioita eri konteksteissa. Oleellista on se, ett&auml; tehd&auml;&auml;n selv&auml; ero hiljaisuuden ja &auml;&auml;nen v&auml;lill&auml;. On aika olla hiljaa ja aika olla &auml;&auml;nek&auml;s.</p>
<p>Buxtonin<sup id="ref-30" class="ref"><a href="#note-30" title="(Buxton 1989)">[30]</a></sup> mukaan ihmiset saattavat vastustaa &auml;&auml;nen k&auml;ytt&ouml;&auml; k&auml;ytt&ouml;liittym&auml;ss&auml; perustellen sit&auml; seuraavasti: "Ty&ouml;skentelen h&auml;lyis&auml;ss&auml; toimistossa, enk&auml; halua en&auml;&auml; enemp&auml;&auml; melua h&auml;iritsem&auml;&auml;n ty&ouml;t&auml;ni"<sup id="ref-35_2" class="ref"><a href="#note-35" title="(Cohen 1994, 513)">[35]</a></sup>. Buxton vastaa sanomalla, ett&auml; &auml;&auml;ni on jo muutenkin l&auml;sn&auml; kaikkialla ja ett&auml; jos kontrolloisimme paremmin &auml;&auml;niymp&auml;rist&ouml;&auml;mme, saisimme kokonais&auml;&auml;nimaiseman v&auml;hemm&auml;n vastenmieliseksi. Ihmiset suhtautuvat siis &auml;&auml;neen kaksijakoisesti: joko vastustavat sit&auml; voimakkaasti tai suhtautuvat todella innokkaasti. Sit&auml; paitsi meluisassa toimistossakin voi k&auml;ytt&auml;&auml; kuulokkeita, jotka eiv&auml;t sulje pois toimiston muita t&auml;rkeit&auml; &auml;&auml;ni&auml;. Brewster<sup id="ref-21_1" class="ref"><a href="#note-21" title="(Brewster 1994, 6)">[21]</a></sup> korostaa, ett&auml; jos &auml;&auml;net ovat informatiivisia, k&auml;ytt&auml;j&auml;t eiv&auml;t halua laittaa niit&auml; pois p&auml;&auml;lt&auml;. Onkin mielenkiintoista, ett&auml; &auml;&auml;nen osuutta k&auml;ytt&ouml;liittym&auml;ss&auml; kuvataan usein adjektiivilla "h&auml;iritsev&auml;". Jos k&auml;ytt&ouml;liittym&auml;n &auml;&auml;net ovat huonosti suunniteltuja, niit&auml; saatetaan pit&auml;&auml; my&ouml;s "huvittavina". T&auml;llaiset m&auml;&auml;ritelm&auml;t osoittavat, ett&auml; paljon on viel&auml; tekem&auml;tt&auml; sek&auml; asenteiden ett&auml; tekniikan osalta. Harvemmin graafisia elementtej&auml; pidet&auml;&auml;n h&auml;iritsevin&auml;. Selv&auml;&auml; kuitenkin on, ett&auml; visuaalisesti liian t&auml;ynn&auml; oleva n&auml;ytt&ouml; ei ole lainkaan miellytt&auml;v&auml; k&auml;ytt&auml;&auml;. Eik&ouml; t&auml;m&auml;kin ole h&auml;iritsev&auml;&auml;?</p>
<p>Vaikka &auml;&auml;nt&auml; k&auml;ytt&ouml;liittym&auml;ss&auml; saatetaan vastustaa (ja vaikka &auml;&auml;ni on k&auml;yt&auml;nn&ouml;ss&auml; suunniteltu k&auml;ytt&ouml;liittymist&auml; pois!), ihmiset joka tapauksessa kuuntelevat tietokonettaan saadakseen tietoa prosesseista, joita he eiv&auml;t voi n&auml;hd&auml;. Esimerkkin&auml; t&auml;st&auml; on levyaseman hurina tai tulostimen &auml;&auml;ni.<sup id="ref-43_6" class="ref"><a href="#note-43" title="(Gaver 1989, 70)">[43]</a></sup><sup id="ref-76_3" class="ref"><a href="#note-76" title="(Walker &amp; Brewster 2000, 2)">[76]</a></sup>. Toisaalta suhtautuminen &auml;&auml;neen on ymm&auml;rrett&auml;v&auml;&auml;: emme voi sulkea korviamme (toisin kuin silmi&auml;mme), joten kuuloaistin ainoa suojautumiskeino on ep&auml;mieluisten &auml;&auml;nten suodattaminen ja keskittyminen miellytt&auml;vimpiin &auml;&auml;niin<sup id="ref-71_11" class="ref"><a href="#note-71" title="(Schafer 1977, 11)">[71]</a></sup>. On kuitenkin otettava huomioon, ett&auml; my&ouml;s ep&auml;miellytt&auml;v&auml;t &auml;&auml;net ovat merkitsevi&auml;. Seuraavaksi tarkastellaan &auml;&auml;nen funktioita k&auml;ytt&ouml;liittym&auml;ss&auml;.</p>
</div>
<div id="ch-4_2">
<h4>4.2 &Auml;&auml;nen k&auml;ytt&ouml;tarkoitus <a title="takaisin sis&auml;llysluetteloon" href="#toc-4_2">^</a></h4>
<p>&Auml;&auml;nt&auml; on yleens&auml; k&auml;ytetty elokuvassa ainakin kuvien yhdist&auml;miseen (ylimeno) tai ilmapiirin luomiseen<sup id="ref-33_21" class="ref"><a href="#note-33" title="(Chion 1990, 47)">[33]</a></sup>. Perinteisess&auml; elokuvatutkimuksessa elokuva ilman &auml;&auml;nt&auml; pysyy elokuvana, mutta elokuva ilman kuvaa ei ole en&auml;&auml; elokuva<sup id="ref-33_22" class="ref"><a href="#note-33" title="(Chion 1990, 143)">[33]</a></sup>. T&auml;m&auml; ajattelumalli kuvaa hyvin visuaalisen informaation ylivaltaa, vaikka kokeellisissa elokuvissa n&auml;it&auml; kirjoittamattomia s&auml;&auml;nt&ouml;j&auml; onkin pyritty tietoisesti rikkomaan. Chionin<sup id="ref-33_23" class="ref"><a href="#note-33" title="(Chion 1990, 145--148)">[33]</a></sup> mukaan &auml;&auml;nielokuvan alkuaikoina ei ollut teknisesti mahdollista k&auml;ytt&auml;&auml; monia &auml;&auml;ni&auml; p&auml;&auml;llekk&auml;in, koska silloin ne eiv&auml;t olisi erottuneet toisistaan. Jos k&auml;ytettiin useita &auml;&auml;ni&auml;, yhden piti olla ylitse muiden. T&auml;h&auml;n saattoi Chionin mielest&auml; olla my&ouml;s kulttuurisia syit&auml;: melu ei useimpien ihmisten mielest&auml; ole esteettisesti kiehtovaa.<sup id="ref-33_24" class="ref"><a href="#note-33" title="(Chion 1990, 145--148)">[33]</a></sup>. Melu on m&auml;&auml;ritelty ep&auml;mieluisaksi, ep&auml;musikaaliseksi tai kovaksi &auml;&auml;neksi (vaikka "ep&auml;mieluisa &auml;&auml;ni" on subjektiivinen kokemus, se nojaa my&ouml;s yhteis&ouml;n tuottamiin sopimuksiin)<sup id="ref-71_12" class="ref"><a href="#note-71" title="(Schafer 1977, 182--183)">[71]</a></sup>.</p>
<p>Schafer<sup id="ref-71_13" class="ref"><a href="#note-71" title="(Schafer (1977, 205)">[71]</a></sup> pit&auml;&auml; maailman &auml;&auml;nimaisemaa yhten&auml; suurena s&auml;vellyksen&auml;, johon kaikki ihmiset osallistuvat s&auml;velt&auml;jin&auml;, esiintyjin&auml; ja kuulijoina. Prosessiin kuuluu eri &auml;&auml;nten analysointi ja p&auml;&auml;tt&auml;minen siit&auml;, mit&auml; &auml;&auml;ni&auml; haluamme s&auml;ilytt&auml;&auml; ja mit&auml; poistaa. T&auml;ll&auml; tavalla voidaan p&auml;&auml;st&auml; melusta eroon. Vaikka t&auml;llainen n&auml;kemys on melko naivi, se saattaa olla mahdollista toteuttaa pienemm&auml;ss&auml; mittakaavassa: k&auml;ytt&ouml;liittym&auml;ss&auml; suunnittelija voi toimia s&auml;velt&auml;j&auml;n&auml;, esiintyj&auml;n&auml; ja kuuntelijana.</p>
<p>Chion<sup id="ref-33_25" class="ref"><a href="#note-33" title="(Chion 1990, 73)">[33]</a></sup> esittelee mielenkiintoisen viitekehyksen &auml;&auml;nen kolmijakoisesta roolista elokuvassa: &auml;&auml;nitapahtuma voi olla joko (a) n&auml;yt&ouml;ll&auml; (onscreen), (b) n&auml;yt&ouml;n ulkopuolella n&auml;kym&auml;tt&ouml;miss&auml; (offscreen) tai (c) n&auml;kym&auml;tt&ouml;miss&auml;, mutta ei my&ouml;sk&auml;&auml;n miss&auml;&auml;n suhteessa n&auml;yt&ouml;ll&auml; oleviin tapahtumiin (nondiegetic, esimerkiksi musiikki). Chion kritisoi itsekin t&auml;t&auml; jakoa puutteelliseksi ja lis&auml;&auml;<sup id="ref-33_26" class="ref"><a href="#note-33" title="(Chion 1990, 82--83)">[33]</a></sup>, ett&auml; jos suljemme silm&auml;mme tai katsomme muualle, n&auml;yt&ouml;n ulkopuoliset &auml;&auml;net muuttuvat n&auml;yt&ouml;ll&auml; oleviksi &auml;&auml;niksi. &Auml;&auml;nen rooli syntyy siis visuaalisen ja &auml;&auml;nellisen yhteisty&ouml;n&auml;. Chion<sup id="ref-33_27" class="ref"><a href="#note-33" title="(Chion 1990, 75)">[33]</a></sup> lis&auml;&auml; t&auml;h&auml;n kolmijakoon viel&auml; &auml;&auml;nitapahtumat, jotka ymp&auml;r&ouml;iv&auml;t tilaa ilman, ett&auml; kiinnitet&auml;&auml;n huomiota niiden tunnistamiseen tai tarpeeseen n&auml;hd&auml; niiden l&auml;hde. Niiden avulla voitaisiin kuitenkin tunnistaa jokin tila. Chionin n&auml;k&ouml;kulma l&auml;henee t&auml;ss&auml; kohdin Schaferin<sup id="ref-71_14" class="ref"><a href="#note-71" title="(Schafer 1977)">[71]</a></sup> ja Sauen<sup id="ref-67_0" class="ref"><a href="#note-67" title="(Saue 2000)">[67]</a></sup> n&auml;kemyksi&auml; &auml;&auml;nimaisemasta. Chionin elokuvateoriat ovat erityisen hy&ouml;dyllisi&auml; my&ouml;s k&auml;ytt&ouml;liittym&auml;kontekstissa, koska jako n&auml;yt&ouml;ll&auml; ja sen ulkopuolella oleviin &auml;&auml;nitapahtumiin viittaa piiloinformaation olemassaoloon.</p>
<p>&Auml;&auml;nen funktiona ei ole (pelk&auml;st&auml;&auml;n) viihdytt&auml;minen, vaan piiloinformaation tunnistaminen ja esitt&auml;minen k&auml;ytt&auml;j&auml;lle<sup id="ref-45_0" class="ref"><a href="#note-45" title="(Gaver 1993b, 228)">[45]</a></sup><sup id="ref-16_10" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 467)">[16]</a></sup>. T&auml;m&auml; n&auml;kemys kiteytt&auml;&auml; oleellisen ja pit&auml;&auml; sis&auml;ll&auml;&auml;n laajan kirjon mahdollisia k&auml;ytt&ouml;tarkoituksia. Herefordin ja Winnin mukaan<sup id="ref-51_4" class="ref"><a href="#note-51" title="(Hereford ja Winn 1994, 212--213)">[51]</a></sup> &auml;&auml;nell&auml; on k&auml;ytt&ouml;liittym&auml;ss&auml; kaksi funktiota: (a) &auml;&auml;ni kertoo k&auml;ytt&auml;j&auml;lle j&auml;rjestelm&auml;n tilasta kullakin hetkell&auml; h&auml;lytys&auml;&auml;nill&auml; tai "tarkkailemalla" taustalla kunnes k&auml;ytt&auml;j&auml; vaatii tietoa j&auml;rjestelm&auml;n tilasta ja (b) v&auml;litt&auml;&auml; ohjelmien tuottamaa tietoa. Buxton<sup id="ref-31_0" class="ref"><a href="#note-31" title="(Buxton 1990, 124--127)">[31]</a></sup> taas jakaa &auml;&auml;net k&auml;ytt&ouml;liittym&auml;ss&auml; kolmeen luokkaan sen mukaan, mink&auml;laista informaatiota ne v&auml;litt&auml;v&auml;t:</p>
<ul>
<li>h&auml;lytys- ja varoitus&auml;&auml;net</li>
<li>j&auml;rjestelm&auml;n tilasta kertovat &auml;&auml;net</li>
<li>koodatut viestit.</li>
</ul>
<p>Varoitus&auml;&auml;nten (yleens&auml; kovia ja korkeita &auml;&auml;ni&auml;) tarkoituksena on keskeytt&auml;&auml; meneill&auml;&auml;n oleva teht&auml;v&auml;. J&auml;rjestelm&auml;n tilasta kertovien &auml;&auml;nten tarkoituksena on v&auml;litt&auml;&auml; informaatiota meneill&auml;&auml;n olevasta teht&auml;v&auml;st&auml; tai prosessista. T&auml;llaiset &auml;&auml;net ovat yleens&auml; pitki&auml; &auml;&auml;ni&auml; tai toistuvia kuvioita, jotka h&auml;ipyv&auml;t taka-alalle prosessin p&auml;&auml;ttymisen j&auml;lkeen. N&auml;in k&auml;ytt&auml;j&auml; voi keskitty&auml; p&auml;&auml;teht&auml;v&auml;&auml;n (kunnes &auml;&auml;ni taas ilmaantuu etualalle ilmoittaen prosessissa tapahtuvasta muutoksesta). Ihminen ei pysy kauaa tietoisena staattisista &auml;&auml;nist&auml;, mutta aktivoituu heti, kun &auml;&auml;ness&auml; tapahtuu jokin muutos (esimerkiksi jos autolla ajaessa moottorin &auml;&auml;ni yht&auml;kki&auml; muuttuu). Ihminen pystyy tarkkailemaan useita samanaikaisia &auml;&auml;ni&auml; taka-alalla (mik&auml;li &auml;&auml;net ovat riitt&auml;v&auml;n erilaisia), mutta reagoimaan vain yhteen tai kahteen samanaikaisesti. Koodattujen viestien tarkoituksena taas on v&auml;litt&auml;&auml; kvantitatiivista informaatiota. T&auml;llaiset &auml;&auml;net ovat vaihtelevan monimuotoisia, toisin kuin h&auml;lytys&auml;&auml;net ja j&auml;rjestelm&auml;n tilasta kertovat &auml;&auml;net.<sup id="ref-31_1" class="ref"><a href="#note-30" title="(Buxton 1990, 124--127)">[30]</a></sup>.</p>
<p>Beaudouin--Lafon ja Gaver<sup id="ref-11_1" class="ref"><a href="#note-11" title="(Beaudouin--Lafon ja Gaver 1994, 49--50)">[11]</a></sup> vuorostaan jakavat &auml;&auml;nen funktiot seuraavasti: &auml;&auml;ni (a) antaa palautetta k&auml;ytt&auml;j&auml;n toiminnoista, (b) ilmoittaa j&auml;rjestelm&auml;n toiminnasta ja (c) lis&auml;&auml; tietoisuutta muiden k&auml;ytt&auml;jien toiminnoista. Esimerkkin&auml; kohdasta (a) voidaan mainita Gaverin "SonicFinder"<sup id="ref-43_7" class="ref"><a href="#note-43" title="(Gaver 1989)">[43]</a></sup> ja kohdasta (b) Gaverin, Smithin ja O'Shean "ARKOLA simulation"<sup id="ref-47_0" class="ref"><a href="#note-47" title="(Gaver, Smith ja O'Shea 1991)">[47]</a></sup>. Kohtaa (c) ei t&auml;ss&auml; k&auml;sitell&auml;, koska kiinnostuksen kohteena on yksitt&auml;inen k&auml;ytt&auml;j&auml;. Edelliseen kolmijakoon voitaisiin lis&auml;t&auml; viel&auml; tieto eri &auml;&auml;nitapahtumien sijainnista ja merkityksist&auml; tilassa, mist&auml; p&auml;&auml;st&auml;&auml;n t&auml;m&auml;n tutkimuksen aiheeseen. Toisaalta spatiaalinen &auml;&auml;ni ei ole oma kohtansa; pikemminkin se on uutena ulottuvuutena l&auml;sn&auml; kaikissa niiss&auml; funktioissa, joissa &auml;&auml;ni voi k&auml;ytt&ouml;liittym&auml;ss&auml; toimia.</p>
<p>K&auml;yt&auml;nn&ouml;n esimerkkin&auml; &auml;&auml;nen k&auml;yt&ouml;st&auml; mainittakoon Albersin ja Bergmanin<sup id="ref-2" class="ref"><a href="#note-2" title="(Albers ja Bergman 1995, 318)">[2]</a></sup> laajennus Mosaic-selaimeen nimelt&auml; "Audible Web" (prototyyppi), jonka tarkoituksena on &auml;&auml;nen avulla (a) antaa informaatiota tiedonsiirron etenemisest&auml;, (b) antaa palautetta k&auml;ytt&auml;j&auml;n toimista sek&auml; (c) antaa sis&auml;ll&ouml;llist&auml; palautetta linkkien koostumuksesta navigoinnin helpottamiseksi (esimerkiksi tiedoston tyyppi, koko ja latausaika). Prototyypiss&auml; on tekij&ouml;iden mukaan pyritty liitt&auml;m&auml;&auml;n &auml;&auml;ni huomaamattomasti kokonaisuuteen luonnolliseksi osaksi vuorovaikutusta. Juuri t&auml;m&auml; tulisi olla &auml;&auml;nen osuus: ei visuaalisuuteen j&auml;lkeenp&auml;in liitetty osa, vaan alusta asti mukaan suunniteltu.</p>
<p>Brown ym.<sup id="ref-27_2" class="ref"><a href="#note-27" title="(Brown ym. 1989, 346)">[27]</a></sup> p&auml;&auml;tyiv&auml;t tutkimuksessaan siihen, ett&auml; k&auml;ytt&auml;j&auml;t voivat erottaa &auml;&auml;nest&auml; useita samanaikaisia informaatioyksikk&ouml;j&auml; ja reagoida niihin tarjotun informaation mukaisesti. Tutkimuksesta k&auml;vi my&ouml;s ilmi, ett&auml; esitt&auml;m&auml;ll&auml; informaatiota sek&auml; &auml;&auml;nen ett&auml; grafiikan avulla voidaan n&auml;ytt&ouml;&auml; k&auml;ytt&auml;&auml; useisiin samanaikaisiin teht&auml;viin. Informaatio voi kuitenkin j&auml;&auml;d&auml; k&auml;ytt&ouml;liittym&auml;ss&auml; piiloon ainakin seuraavista syist&auml;<sup id="ref-24" class="ref"><a href="#note-24" title="(Brewster, Wright &amp; Edwards 1995, 3)">[24]</a></sup>:</p>
<ul>
<li>Informaatio ei ole saatavilla esimerkiksi n&auml;yt&ouml;n pienuuden takia.</li>
<li> Informaatio on saatavilla, mutta vaikea saada (esimerkiksi tiedoston koko).</li>
<li>Informaatiota on liikaa (visuaalinen yliannostus).</li>
<li>K&auml;ytt&auml;j&auml;n katse on suuntautunut v&auml;&auml;r&auml;&auml;n paikkaan.</li>
</ul>
<p>Viimeksi mainittu kohta on t&auml;rke&auml;. Kuten kohdassa 2.2 todettiin, tapahtumalla on kaksi kohtaa ajassa: itse tapahtuma ja sen havaitseminen. N&auml;iden v&auml;linen ero voi olla suuri, ellei k&auml;ytt&auml;j&auml; huomaa katsoa oikeaan paikkaan. Jos kaikki t&auml;m&auml; piiloon j&auml;&auml;v&auml; informaatio saadaan &auml;&auml;nen avulla esille, lis&auml;&auml;ntyy k&auml;ytt&ouml;liittym&auml;n tehokkuus ratkaisevasti. Ongelma on n&auml;in ollen selv&auml;: mink&auml;laisia &auml;&auml;ni&auml; pit&auml;isi k&auml;ytt&auml;&auml;? Brewster<sup id="ref-21_2" class="ref"><a href="#note-21" title="(Brewster 1994)">[21]</a></sup> pyrkii v&auml;it&ouml;skirjassaan tutkimaan, mink&auml;laisia &auml;&auml;ni&auml; pit&auml;isi k&auml;ytt&auml;&auml; k&auml;ytt&ouml;liittym&auml;ss&auml;, mutta ottaa silti symboliset &auml;&auml;net annettuina ja sivuuttaa ikoniset &auml;&auml;net ilman perusteluja. T&auml;llainen n&auml;k&ouml;kulma on ollut vallitseva 1990-luvun loppupuolella, jolloin symbolisia musiikillisia &auml;&auml;ni&auml; on pyritty liitt&auml;m&auml;&auml;n k&auml;ytt&ouml;liittym&auml;n toimintoihin. 1980-luvun ja 1990-luvun alun ikoniset kokeilut ja akustinen ekologia on jostain syyst&auml; j&auml;tetty v&auml;hemm&auml;lle huomiolle. Seuraavassa esitell&auml;&auml;n n&auml;it&auml; tutkimuksia ja pohditaan sit&auml;, miten spatiaalisen &auml;&auml;nen avulla voitaisiin tunnistaa ja esitt&auml;&auml; piilossa olevaa informaatiota.</p>
</div>
<div id="ch-4_3">
<h4>4.3 Ikoniset &auml;&auml;net <a title="takaisin sis&auml;llysluetteloon" href="#toc-4_3">^</a></h4>
<p>Gaver<sup id="ref-42_1" class="ref"><a href="#note-42" title="(Gaver 1986, 168)">[42]</a></sup> m&auml;&auml;rittelee <em>ikoniset &auml;&auml;net</em> (auditory icons) &auml;&auml;niksi, jotka v&auml;litt&auml;v&auml;t informaatiota tietyst&auml; tapahtumasta. Oleellista ikonisissa &auml;&auml;niss&auml; on se, ett&auml; ne muistuttavat objektiaan<sup id="ref-74_0" class="ref"><a href="#note-74" title="(Tarasti 1990, 29)">[74]</a></sup><sup id="ref-40_2" class="ref"><a href="#note-40" title="(Fiske 2000, 70)">[40]</a></sup>: &auml;&auml;nell&auml; on siis suora yhteys vastaavaan &auml;&auml;nil&auml;hteeseen, jolloin ne ovat ikonisessa suhteessa toisiinsa. Gaverin ajattelussa keskeist&auml; on, ett&auml; &auml;&auml;ni v&auml;litt&auml;&auml; informaatiota &auml;&auml;nil&auml;hteen ja sen ymp&auml;rist&ouml;n ominaisuuksista, ei &auml;&auml;nest&auml; itsess&auml;&auml;n. H&auml;nen mukaansa saamme informaatiota ymp&auml;r&ouml;iv&auml;st&auml; maailmasta &auml;&auml;nen avulla (ks. jokap&auml;iv&auml;inen kuunteleminen, <a title="kohta 2.5" href="#ch-2_5">kohta 2.5</a>). Gaverin<sup id="ref-45_1" class="ref"><a href="#note-45" title="(Gaver 1993b, 228)">[45]</a></sup> mukaan liitt&auml;m&auml;ll&auml; ikonisiin &auml;&auml;niin parametreja (esimerkiksi koko tai nopeus) voidaan viitata tapahtumien ja objektien kategorioiden lis&auml;ksi (visuaalisten ikonien tapaan) my&ouml;s niiden ulottuvuuksiin. Esimerkiksi tiedoston ollessa iso se my&ouml;s kuulostaa isolta. Parametrisoitujen ikonisten &auml;&auml;nten hyv&auml;n&auml; puolena voidaan pit&auml;&auml; sit&auml;, ett&auml; informaatiota saadaan enemm&auml;n suoraan havainnoimalla kuin symbolisesti opettelemisen kautta.<sup id="ref-45_2" class="ref"><a href="#note-45" title="(Gaver 1993b, 228)">[45]</a></sup>.</p>
<p>Brownin ym.<sup id="ref-27_3" class="ref"><a href="#note-27" title="(Brown ym. 1989, 340)">[27]</a></sup> mielest&auml; saattaa olla vaikea l&ouml;yt&auml;&auml; luonnollista &auml;&auml;nellist&auml; vastinetta objektin spatiaaliselle visuaaliselle sijainnille. N&auml;kemys on melko yksioikoinen: edell&auml; on jo osoitettu, ett&auml; objekti voidaan sijoittaa sellaiseen sijaintiin &auml;&auml;nimaisemassa, joka vastaa objektin visuaalista sijaintia. Toisekseen, objektin &auml;&auml;nellisen ja kuvallisen esityksen ei v&auml;ltt&auml;m&auml;tt&auml; edes tarvitse olla yhtenev&auml;inen. Oleellista on se, mit&auml; spatiaalinen &auml;&auml;ni merkitsee.</p>
<p>Mansurin ym.<sup id="ref-62_2" class="ref"><a href="#note-62" title="(Mansur ym. 1985, 117)">[62]</a></sup> mukaan ikonisten &auml;&auml;nten avulla voidaan informaatiota v&auml;litt&auml;&auml; nopeammin kuin tekstin tai syntetisoidun puhe&auml;&auml;nen avulla. &Auml;&auml;ni-ikoneita k&auml;ytt&auml;m&auml;ll&auml; voidaan heid&auml;n mukaansa saavuttaa seuraavia hy&ouml;tyj&auml;:</p>
<ul>
<li>K&auml;ytt&auml;j&auml; voi rauhassa keskitty&auml; p&auml;&auml;teht&auml;v&auml;&auml;n luottaen siihen, ett&auml; &auml;&auml;ni-ikoni ilmoittaa t&auml;rke&auml;st&auml; v&auml;liin tulevasta tapahtumasta.</li>
<li>K&auml;ytt&auml;j&auml;n ei tarvitse katsoa n&auml;yt&ouml;lle saadakseen &auml;&auml;ni-ikonin v&auml;litt&auml;m&auml;n tiedon.</li>
<li>Hyvin suunnitellut &auml;&auml;ni-ikonit voivat olla helpommin opittavissa kuin visuaaliset ikonit.</li>
<li>&Auml;&auml;ni-ikonien avulla voidaan korvata tekstimuodossa olevat ilmoitukset ja siten kevent&auml;&auml; visuaalista kuormaa.</li>
<li>&Auml;&auml;nt&auml; voidaan k&auml;ytt&auml;&auml; silloin kun n&auml;k&ouml;aistia ei voida k&auml;ytt&auml;&auml; (esim. jos k&auml;ytt&auml;j&auml; on n&auml;k&ouml;vammainen, k&auml;ytt&auml;j&auml; ei ole koneen &auml;&auml;ress&auml; tai jos k&auml;ytt&auml;j&auml; on yhteydess&auml; j&auml;rjestelm&auml;&auml;n puhelimen v&auml;lityksell&auml;).<sup id="ref-62_3" class="ref"><a href="#note-62" title="(Mansur ym. 1985, 117)">[62]</a></sup>.</li>
</ul>
<p>Gaverin ym.<sup id="ref-47_1" class="ref"><a href="#note-47" title="(Gaver ym. 1991, 85)">[47]</a></sup> mukaan &auml;&auml;nen attribuutit ja haluttu informaatio ovat usein keinotekoisessa suhteessa toisiinsa. Ne voidaan saattaa l&auml;hemp&auml;&auml;n viittaussuhteeseen, jos &auml;&auml;nitapahtumien attribuutit esitt&auml;v&auml;t k&auml;ytt&ouml;liittym&auml;n tapahtumien attribuutteja. Gaver v&auml;itt&auml;&auml; my&ouml;s, ett&auml; ikoniset &auml;&auml;net eiv&auml;t ole niin &auml;rsytt&auml;vi&auml; kuin musiikilliset &auml;&auml;net, koska ikonien avulla voidaan t&auml;ydent&auml;&auml; ja laajentaa jo olemassaolevaa &auml;&auml;niymp&auml;rist&ouml;&auml;. Suunniteltaessa &auml;&auml;ni&auml; k&auml;ytt&ouml;liittym&auml;&auml;n on t&auml;rke&auml;&auml;, ett&auml; k&auml;ytet&auml;&auml;n &auml;&auml;ni&auml; tietyss&auml; funktiossa, ikoni viittaa mahdollisimman tarkasti objektiin (&auml;&auml;nil&auml;hteeseen) ja ett&auml; &auml;&auml;net ovat selke&auml;sti eroteltavissa toisistaan. K&auml;ytt&ouml;liittym&auml;n akustinen ekologia tulisi olla kuultavissa sek&auml; kokonais&auml;&auml;niymp&auml;rist&ouml;n&auml; ett&auml; erillisin&auml; &auml;&auml;nivirtoina, jotka v&auml;litt&auml;v&auml;t informaatiota yksitt&auml;isist&auml; objekteista.<sup id="ref-47_2" class="ref"><a href="#note-47" title="(Gaver ym. 1991, 85)">[47]</a></sup>.</p>
<p>Gaver<sup id="ref-42_2" class="ref"><a href="#note-42" title="(Gaver 1986, 168--169)">[42]</a></sup> antaa esimerkin ikonisesta &auml;&auml;nest&auml; viestin saapuessa s&auml;hk&ouml;postij&auml;rjestelm&auml;&auml;n: kirje putoaa kirjelaatikkoon, mist&auml; kuuluu tunnistettava &auml;&auml;ni. Jos kirje on iso, kuuluu "painava" &auml;&auml;ni. Paperimainen &auml;&auml;ni ilmaisee, ett&auml; kyseess&auml; on tekstitiedosto. &Auml;&auml;ni tulee vaimeana vasemmalta: kirjelaatikko on siis oltava n&auml;yt&ouml;n vasemmalla puolella ja toisen ikkunan takana. Kaiku (suuri tyhj&auml; huone) ilmaisee, ett&auml; j&auml;rjestelm&auml; ei ole liian kuormitettu. &Auml;&auml;net siis v&auml;litt&auml;v&auml;t informaatiota materiaaleista, jotka ovat toistensa kanssa vuorovaikutuksessa tietyss&auml; sijainnissa tietyss&auml; ymp&auml;rist&ouml;ss&auml;.<sup id="ref-42_3" class="ref"><a href="#note-42" title="(Gaver 1986, 168--169)">[42]</a></sup>. Gaver<sup id="ref-42_4" class="ref"><a href="#note-42" title="(Gaver 1986, 173)">[42]</a></sup> painottaa kuitenkin, ettei &auml;&auml;ni-ikonien tarvitse olla t&auml;ysin realistisia, riitt&auml;&auml; ett&auml; ne esitt&auml;v&auml;t oleellisimmat piirteet &auml;&auml;nitapahtumasta.</p>
<p>Erilaiset vuorovaikutukset &auml;&auml;niobjektien v&auml;lill&auml; v&auml;litt&auml;v&auml;t erilaista tietoa materiaaleista: esimerkiksi isku antaa informaatiota objektin koosta, kun taas raapaisu vihjaa enemm&auml;n objektin koostumukseen<sup id="ref-42_5" class="ref"><a href="#note-42" title="(Gaver 1986, 173)">[42]</a></sup>. Vanderveer<sup id="ref-75" class="ref"><a href="#note-75" title="(Vanderveer 1979)">[75]</a></sup> toisti 30 erilaista &auml;&auml;nt&auml; nauhalta (esimerkiksi k&auml;sien taputus tai paperin repiminen) ja pyysi koehenkil&ouml;it&auml; tunnistamaan &auml;&auml;net. Vanderveerin tutkimus osoitti, ett&auml; koehenkil&ouml;t tunnistivat &auml;&auml;nil&auml;hteet sek&auml; tapahtumat jotka aiheuttivat ne, ja turvautuivat kuvaamaan &auml;&auml;nen fyysisi&auml; attribuutteja vain mik&auml;li eiv&auml;t tunnistaneet &auml;&auml;nil&auml;hdett&auml;.<sup id="ref-43_8" class="ref"><a href="#note-43" title="(Gaver 1989, 72)">[43]</a></sup>. Vanderveerin tutkimus tukee n&auml;kemyst&auml;, ett&auml; ihmiset kuuntelevat saadakseen tietoa &auml;&auml;nil&auml;hteist&auml;, harvemmin &auml;&auml;nt&auml; itsess&auml;&auml;n.</p>
<p>Gaver<sup id="ref-43_9" class="ref"><a href="#note-43" title="(Gaver 1989, 77)">[43]</a></sup> m&auml;&auml;rittelee k&auml;ytt&ouml;liittym&auml;n tapahtumat toiminnoiksi, jotka kohdistuvat kappaleisiin. Kappaleet vuorostaan koostuvat objekteista, joihin kuuluu esimerkiksi tiedostoja, kansioita ja ikkunoita. Valinta, raahaaminen ja avaaminen ovat esimerkkej&auml; toiminnoista.<sup id="ref-43_10" class="ref"><a href="#note-43" title="(Gaver 1989, 77)">[43]</a></sup>. Jokainen kappale-toiminto--yhdistelm&auml; muodostaa tapahtuman, jota on mahdollista kuvata vastaavilla &auml;&auml;nitapahtumilla<sup id="ref-43_11" class="ref"><a href="#note-43" title="(Gaver 1989, 78)">[43]</a></sup>. Vuorovaikutuksen lis&auml;ksi voidaan saadaan tietoa objektin ominaisuuksista. Ongelmana t&auml;ss&auml; on se, miten saada objektiivista tietoa objektin ominaisuuksista. Kuulija vertaa kuulemaansa muihin &auml;&auml;niin: esimerkiksi &auml;&auml;nenkorkeudella ei ole absoluuttista arvoa, vaan se on aina k&auml;sitett&auml;v&auml; suhteessa muiden &auml;&auml;nten korkeuksiin. Er&auml;s ratkaisu t&auml;h&auml;n voisi olla kaikkien k&auml;ytt&ouml;liittym&auml;n objektien muodostama kokonais&auml;&auml;nimaisema, jonka sis&auml;ll&auml; voidaan vertailla eri &auml;&auml;ni&auml; toisiinsa eri konteksteissa. Keskeist&auml; on se, voidaanko jokap&auml;iv&auml;isi&auml; &auml;&auml;ni&auml; liitt&auml;&auml; luonnollisesti ja merkityksellisesti k&auml;ytt&ouml;liittym&auml;n tapahtumiin<sup id="ref-43_12" class="ref"><a href="#note-43" title="(Gaver 1989, 77)">[43]</a></sup>. SonicFinder esitt&auml;&auml; p&auml;&auml;asiassa toisteista informaatiota<sup id="ref-43_13" class="ref"><a href="#note-43" title="(Gaver 1989, 82)">[43]</a></sup>. Joissakin tapauksissa visuaalinen informaatio voidaan kuitenkin korvata kokonaan: napin painalluksesta voidaan antaa palautetta k&auml;ytt&auml;j&auml;lle pelk&auml;st&auml;&auml;n &auml;&auml;nen avulla. Samalla tavalla palautetta voidaan antaa tehokkaasti &auml;&auml;nen avulla muistakin toiminnoista (visuaalisen palautteen sijaan), jolloin k&auml;ytt&auml;j&auml; voi keskitty&auml; p&auml;&auml;teht&auml;v&auml;&auml;n n&auml;k&ouml;ns&auml; avulla<sup id="ref-23" class="ref"><a href="#note-23" title="(Brewster, Wright, Dix &amp; Edwards 1995, 48)">[23]</a></sup>.</p>
<p>Gaver<sup id="ref-43_14" class="ref"><a href="#note-43" title="(Gaver 1989, 89--90)">[43]</a></sup> ottaa ikonisten &auml;&auml;nten kohdalla esiin kaksi ongelmaa: (a) mink&auml;laisia &auml;&auml;ni&auml; pit&auml;isi k&auml;ytt&auml;&auml; silloin kun kyseess&auml; on vain tietokonemaailmassa esiintyv&auml; tapahtuma, esimerkiksi virhe kirjoitettaessa levylle tai ikkunan avautuminen (ei avaudu kuten reaalimaailmassa, vaan zoomautuu isommaksi) ja (b) mink&auml;laisia &auml;&auml;ni&auml; pit&auml;isi k&auml;ytt&auml;&auml; sellaisissa k&auml;ytt&ouml;liittym&auml;n tapahtumissa, joiden reaalimaailman vastineet eiv&auml;t aiheuta &auml;&auml;nt&auml; tai aiheuttavat merkitykset&ouml;nt&auml; &auml;&auml;nt&auml;. Gaver esitt&auml;&auml; ratkaisuna ensin mainittuun ongelmaan elokuvallisten &auml;&auml;niefektien k&auml;ytt&ouml;&auml;. Elokuvien &auml;&auml;niefektit eiv&auml;t liity tapahtumiin sattumanvaraisesti, vaan perustuvat kuuntelijoiden kykyyn yleist&auml;&auml; tiet&auml;myst&auml;&auml;n jokap&auml;iv&auml;isist&auml; &auml;&auml;nitapahtumista. N&auml;in ollen, vaikka ikkunat eiv&auml;t SonicFinderissa avaudu, t&auml;m&auml; tapahtuma muistuttaa muita jokap&auml;iv&auml;isi&auml; &auml;&auml;ni&auml;, esim. objektin &auml;killist&auml; laajentumista. My&ouml;s Cohen<sup id="ref-34" class="ref"><a href="#note-34" title="(Cohen 1993, 63--64)">[34]</a></sup> on ehdottanut lajityyppien k&auml;ytt&ouml;&auml; ("genre sounds"), jolloin k&auml;ytt&ouml;liittym&auml;ss&auml; voitaisiin k&auml;ytt&auml;&auml; &auml;&auml;ni&auml; tutuista elokuvista tai televisio- ja radio-ohjelmista.</p>
<p>J&auml;lkimm&auml;iseen ongelmaan Gaver ehdottaa l&auml;hdemetaforien k&auml;ytt&ouml;&auml;. Esimerkiksi asiakirjaa kopioitaessa reaalimaailman kopiokone ei v&auml;lit&auml; informaatiota siit&auml;, kuinka paljon kopioitavaa on viel&auml; j&auml;ljell&auml;. T&auml;llainen &auml;&auml;ni olisi kuitenkin tietokoneen k&auml;ytt&auml;j&auml;lle relevanttia tietoa. T&auml;ll&ouml;in on keksitt&auml;v&auml; jokin toinen &auml;&auml;nitapahtuma kuvaamaan paremmin prosessin etenemist&auml;, esimerkiksi veden kaatamisen &auml;&auml;ni. T&auml;ll&ouml;in &auml;&auml;nitapahtuma on ikonisessa suhteessa l&auml;hteeseens&auml;, kun taas &auml;&auml;ni-ikoni on metaforisessa suhteessa tapahtumaan.<sup id="ref-43_15" class="ref"><a href="#note-43" title="(Gaver 1989, 89--90)">[43]</a></sup>. Gaverin<sup id="ref-43_16" class="ref"><a href="#note-43" title="(Gaver 1989, 91)">[43]</a></sup> mielest&auml; n&auml;ill&auml; edell&auml;mainitulla kahdella tavalla voidaan ikonisten &auml;&auml;nten k&auml;ytt&ouml;rajoituksia h&auml;lvent&auml;&auml;. &Auml;&auml;niefektej&auml; voidaan k&auml;ytt&auml;&auml; sellaisiin tapahtumiin, joita ei ole reaalimaailmassa, ja hyvinsuunnitellut efektit ovat silti kausaalisessa suhteessa tapahtumaan. K&auml;ytt&auml;m&auml;ll&auml; metaforisia ikonisia &auml;&auml;ni&auml; voidaan muodostaa analogioita &auml;&auml;nitapahtumien v&auml;lill&auml; turvautumatta analogioihin tapahtumien ja &auml;&auml;nen fysikaalisten attribuuttien v&auml;lill&auml;.<sup id="ref-43_17" class="ref"><a href="#note-43" title="(Gaver 1989, 91)">[43]</a></sup>.</p>
<p>Spatiaalisesta &auml;&auml;nest&auml; Gaver<sup id="ref-43_18" class="ref"><a href="#note-43" title="(Gaver 1989, 92)">[43]</a></sup> toteaa, ett&auml; ongelmana ei ole niink&auml;&auml;n sijainti tilassa, vaan haluttujen objektien ja sijaintien l&ouml;yt&auml;minen tilasta. T&auml;ll&ouml;in spatiaaliset &auml;&auml;ni-ikonit voivat tarjota vihjeit&auml; navigoinnille, tarjoamalla tietoa esimerkiksi &auml;&auml;nellisen tilan koosta tai sen rajojen l&auml;heisyydest&auml;. Kursori toimii t&auml;ll&ouml;in tavallaan tutkana, joka tarkastelee ymp&auml;rist&ouml;&auml;. T&auml;llainen l&auml;hestymistapa tuottaa sellaisia spatiaalisia vihjeit&auml; mallimaailmasta, jotka eiv&auml;t ole pelk&auml;st&auml;&auml;n visuaalisia.<sup id="ref-43_19" class="ref"><a href="#note-43" title="(Gaver 1989, 92)">[43]</a></sup>. Ikonisia &auml;&auml;ni&auml; kritisoidaan usein (ks. esimerkiksi Brewster<sup id="ref-21_3" class="ref"><a href="#note-21" title="(Brewster 1994)">[21]</a></sup>) niiden aiheuttamien rajoitusten vuoksi: tietyill&auml; objekteilla tai tapahtumilla ei ole ikonista vastinetta. Miksei samalla tavalla kritisoida visuaalisia ikoneita, koska eiv&auml;th&auml;n nek&auml;&auml;n aina esit&auml; sit&auml; mit&auml; niiden pit&auml;isi? &Auml;rsykkeeseen perustuva suora reaktio on nopeampi kuin symboliin koodatun informaation havaitsemiseen k&auml;ytetty aika<sup id="ref-48_15" class="ref"><a href="#note-48" title="(Gibson 1966, 91)">[48]</a></sup>. T&auml;m&auml; n&auml;kemys vahvistaa oletusta, ett&auml; k&auml;ytt&ouml;liittym&auml;ss&auml; tulisi k&auml;ytt&auml;&auml; mieluummin ikonisia kuin symbolisia &auml;&auml;ni&auml;, joita k&auml;sitell&auml;&auml;n seuraavaksi.</p>
</div>
<div id="ch-4_4">
<h4>4.4 Symboliset &auml;&auml;net <a title="takaisin sis&auml;llysluetteloon" href="#toc-4_4">^</a></h4>
<p><em>Symboliset &auml;&auml;net</em> (earcons) ovat abstrakteja, synteettisi&auml; &auml;&auml;ni&auml;, joita voidaan k&auml;ytt&auml;&auml; strukturoidusti &auml;&auml;nellisten viestien esitt&auml;miseen k&auml;ytt&ouml;liittym&auml;ss&auml; (koskien objekteja tai niiden vuorovaikutusta)<sup id="ref-17_0" class="ref"><a href="#note-17" title="(Blattner ym. 1989, 13)">[17]</a></sup><sup id="ref-22_1" class="ref"><a href="#note-22" title="(Brewster ym. 1993, 222)">[22]</a></sup>. Tutkijat k&auml;ytt&auml;v&auml;t k&auml;sitett&auml; vapaasti, viitaten sill&auml; joskus sek&auml; ikonisiin ett&auml; symbolisiin &auml;&auml;niin. Koska "earconit" ovat useimmiten olleet musiikillisia ja synteettisi&auml; &auml;&auml;ni&auml;, luokitellaan ne t&auml;ss&auml; symbolisiksi. Symboli ei muistuta objektiaan (kuten ikoni), vaan merkitys syntyy siit&auml;, mit&auml; ihmiset ovat kesken&auml;&auml;n sopineet<sup id="ref-74_1" class="ref"><a href="#note-74" title="(Tarasti 1990, 30)">[74]</a></sup><sup id="ref-40_3" class="ref"><a href="#note-40" title="(Fiske 2000, 70)">[40]</a></sup>. T&auml;ll&ouml;in &auml;&auml;nen ja objektin v&auml;linen suhde on keinotekoinen. Gaverin<sup id="ref-43_20" class="ref"><a href="#note-43" title="(Gaver 1989, 72)">[43]</a></sup> ja Herefordin ja Winnin<sup id="ref-51_5" class="ref"><a href="#note-51" title="(Hereford ja Winn 1994, 219)">[51]</a></sup> mukaan symboliset &auml;&auml;net eiv&auml;t ole kovinkaan intuitiivisia, koska ne t&auml;ytyy opetella ennen k&auml;ytt&ouml;&auml;; musiikillisten &auml;&auml;nten liitt&auml;minen tietokoneen tapahtumiin on my&ouml;s useimmiten satunnaista.</p>
<p>Symboliset &auml;&auml;net perustuvat motiiveihin, joita voidaan yhdistell&auml; ja muunnella; niit&auml; voidaan my&ouml;s periytt&auml;&auml; hierarkiassa alempana oleville &auml;&auml;nitapahtumille<sup id="ref-17_1" class="ref"><a href="#note-17" title="(Blattner ym. 1989, 14, 19)">[17]</a></sup><sup id="ref-11_2" class="ref"><a href="#note-11" title="(Beaudouin--Lafon &amp; Gaver 1994, 50)">[11]</a></sup>. Symbolisissa &auml;&auml;niss&auml; on Blattnerin ym.<sup id="ref-16_11" class="ref"><a href="#note-16" title="(Blattner ym. 1994, 453)">[16]</a></sup> mukaan se hy&ouml;ty, ett&auml; &auml;&auml;nten ei tarvitse vastata kohdettaan. T&auml;m&auml; johtaa v&auml;ist&auml;m&auml;tt&auml; siihen, ett&auml; symboliset &auml;&auml;net t&auml;ytyy opetella ennen k&auml;ytt&ouml;&auml;. H&auml;lytys&auml;&auml;net ja signaalit ovat esimerkkej&auml; symbolisista &auml;&auml;nist&auml;<sup id="ref-17_2" class="ref"><a href="#note-17" title="(Blattner ym. 1989, 14)">[17]</a></sup>. Symbolien yhdistelm&auml;t -- esimerkiksi objektin ja vuorovaikutuksen yhdistelm&auml;t &#8212; , saattavat olla helpommin toteutettavissa &auml;&auml;nell&auml; kuin visuaalisesti, koska &auml;&auml;ni on seurausta v&auml;hint&auml;&auml;n kahden objektin vuorovaikutuksesta.</p>
<p>Schafer<sup id="ref-71_15" class="ref"><a href="#note-71" title="(Schafer 1977, 170--178)">[71]</a></sup> luettelee esimerkkej&auml; luonnossa ja elinymp&auml;rist&ouml;ss&auml;mme esiintyvist&auml; symbolista &auml;&auml;nist&auml; ja niihin mahdollisesti liitetyist&auml; merkityksist&auml;:</p>
<dl>
<dt><em>vesi:</em></dt>
<dd>puhdistava, uudistava, liikkeess&auml; oleva, uudestisyntyv&auml;, ikuinen, rytminen (esimerkiksi laineet)</dd>
<dt><em>tuuli:</em></dt>
<dd>ailahteleva, suuntaa vaihtava</dd>
<dt><em>soittokellot:</em></dt>
<dd>joko yhteenker&auml;&auml;minen (esimerkiksi kirkonkello) tai poisajaminen (pahojen henkien karkottaminen)</dd>
<dt><em>torvet:</em></dt>
<dd>voimakas, aggressiivinen, heijastavat viranomaisten arvovaltaa ja viittaavat voittoon</dd>
<dt><em>sireenit:</em></dt>
<dd>ahdistus ja h&auml;t&auml;.</dd>
</dl>
<p>T&auml;llaisten &auml;&auml;nten hy&ouml;dynt&auml;minen k&auml;ytt&ouml;liittym&auml;ss&auml; ei ole lainkaan keinotekoista, koska niiden merkitys on opittu jokap&auml;iv&auml;isest&auml; el&auml;m&auml;st&auml;. Seuraavaksi k&auml;sitell&auml;&auml;n metaforia: perustuuhan suuri osa graafisesta k&auml;ytt&ouml;liittym&auml;st&auml; juuri niiden k&auml;yt&ouml;lle. Miten &auml;&auml;ni voidaan liitt&auml;&auml; luonnolliseksi osaksi k&auml;ytt&ouml;liittym&auml;n metaforista ty&ouml;p&ouml;yt&auml;&auml;?</p>
</div>
<div id="ch-4_5">
<h4>4.5 Metaforiset &auml;&auml;net <a title="takaisin sis&auml;llysluetteloon" href="#toc-4_5">^</a></h4>
<p>Useimmat k&auml;ytt&auml;j&auml;t eiv&auml;t teht&auml;v&auml;&auml; suorittaessaan ajattele tietokonetta koneena, vaan avaavat ikkunoita ja manipuloivat asiakirjoja<sup id="ref-43_21" class="ref"><a href="#note-43" title="(Gaver 1989, 85)">[43]</a></sup>. T&auml;ll&ouml;in on kyse <em>metaforista</em>. Metaforassa k&auml;ytet&auml;&auml;n hyv&auml;ksi yht&auml;l&auml;isyytt&auml; ja eroavuutta siirt&auml;m&auml;ll&auml; (assosioimalla) ominaisuuksia todellisuuden yhdelt&auml; tasolta toiselle<sup id="ref-40_4" class="ref"><a href="#note-40" title="(Fiske 2000, 122, 127)">[40]</a></sup>. T&auml;ll&ouml;in pyrit&auml;&auml;n etsim&auml;&auml;n yht&auml;l&auml;isyyksi&auml; eri tasojen v&auml;lill&auml;, mik&auml; vaatii mielikuvitusta ja saattaa joskus synnytt&auml;&auml; jopa surrealistisen vaikutelman<sup id="ref-40_5" class="ref"><a href="#note-40" title="(Fiske 2000, 130--131)">[40]</a></sup>.</p>
<p>Laurelin<sup id="ref-61_0" class="ref"><a href="#note-61" title="(Laurel 1991, 128)">[61]</a></sup> mukaan metaforien k&auml;ytt&ouml; perustuu teoriaan, ett&auml; kun k&auml;ytt&ouml;liittym&auml;ss&auml; imitoidaan reaalimaailman objekteja, k&auml;ytt&auml;j&auml;t tiet&auml;v&auml;t luonnostaan, miten toimia. Metaforien k&auml;ytt&ouml; aiheuttaa Laurelin mielest&auml; kuitenkin seuraavan ongelman: k&auml;ytt&ouml;liittym&auml;n objekteilla ei ole joitakin reaalimaailman objektien fyysisi&auml; ominaisuuksia (esimerkiksi painoa). T&auml;m&auml; johtaa siihen, ett&auml; k&auml;ytt&ouml;liittym&auml;objektit ovat reaalimaailman kaltaisia, mutta toisaalta puutteellisia, ja toisaalta t&auml;ydennettyj&auml; sellaisilla ominaisuuksilla, joita ei reaaliobjekteilla ole. Laurelin mielest&auml; k&auml;ytt&ouml;liittym&auml;metaforat ovatkin <em>vertauksia</em>: vertaus kertoo k&auml;ytt&ouml;liittym&auml;objektin olevan reaaliobjektin kaltainen, muttei aina sit&auml;, mill&auml; tavalla n&auml;m&auml; eroavat toisistaan. Metaforat siis toisaalta helpottavat k&auml;yt&ouml;n oppimista, mutta toisaalta sis&auml;lt&auml;v&auml;t kognitiivisia ep&auml;loogisuuksia.<sup id="ref-61_1" class="ref"><a href="#note-61" title="(Laurel 1991, 128--130)">[61]</a></sup>.</p>
<p>T&auml;rke&auml;&auml; &auml;&auml;nen k&auml;yt&ouml;ss&auml; ovat yhdenmukaiset kausaalisuhteet &auml;&auml;nen ja muiden modaliteettien v&auml;lill&auml;: &auml;&auml;nen on vastattava suoritettua toimintoa<sup id="ref-61_2" class="ref"><a href="#note-61" title="(Laurel 1991, 160--161)">[61]</a></sup>. T&auml;m&auml; viittaa siis j&auml;lleen audiovisuaaliseen sopimukseen ja v&auml;liaikaiseen jaksolliseen rakenteeseen.</p>
<p>Walker<sup id="ref-77_0" class="ref"><a href="#note-77" title="(Walker 1987)">[77]</a></sup> tutki kulttuurisen taustan, elinymp&auml;rist&ouml;n, i&auml;n ja musiikillisen taustan vaikutusta koehenkil&ouml;iden kykyyn valita sopiva visuaalinen metafora &auml;&auml;nten akustisille parametreille. Tarkoituksena oli siis kuvata kuultua visuaalisen metaforan kautta kvalitatiivisesti. Koehenkil&ouml;t valitsivat seuraavat visuaaliset metaforat: taajuus--vertikaalinen sijainti; amplitudi--koko; aaltomuoto--kuvio; kesto--horisontaalinen pituus<sup id="ref-77_1" class="ref"><a href="#note-77" title="(Walker 1987, 496)">[77]</a></sup>. Tulokset osoittivat, ett&auml; musiikillinen koulutus vaikutti metaforien valitsemiseen enemm&auml;n kuin kulttuuri, ik&auml;  tai ymp&auml;rist&ouml;<sup id="ref-77_2" class="ref"><a href="#note-77" title="(Walker 1987, 497--498)">[77]</a></sup>. T&auml;m&auml; tutkimustulos vahvistaa n&auml;kemyst&auml;, ett&auml; mik&auml;li halutaan saavuttaa &auml;&auml;nen k&auml;yt&ouml;ll&auml; suurin mahdollinen k&auml;ytt&auml;j&auml;ryhm&auml;, musiikillisten (symbolisten) &auml;&auml;nten k&auml;ytt&ouml; t&auml;ytyy harkita tarkkaan. &Auml;&auml;nten t&auml;ytyy ainakin olla riitt&auml;v&auml;n erilaisia.</p>
<p>Spatiaaliset metaforat ovat hy&ouml;dyllisi&auml; k&auml;ytt&ouml;liittym&auml;ss&auml;, esimerkiksi jos informaatio j&auml;rjestell&auml;&auml;n metaforisen rakennuksen huoneisiin<sup id="ref-80_1" class="ref"><a href="#note-80" title="(Wenzel 1994, 40)">[80]</a></sup>. Useimmissa liikkuvan tietojenk&auml;sittelyn sovelluksissa k&auml;ytet&auml;&auml;n edelleen p&ouml;yt&auml;tietokoneeseen liittyvi&auml; k&auml;sitteit&auml;, kuten n&auml;pp&auml;imist&ouml;&auml;, osoitinlaitteita ja graafisia elementtej&auml;<sup id="ref-68_4" class="ref"><a href="#note-68" title="(Sawhney &amp; Schmandt 1997, 109)">[68]</a></sup>. Graafisissa k&auml;ytt&ouml;liittymiss&auml; k&auml;ytetty&auml; ty&ouml;p&ouml;yt&auml;-metaforaa ei Brewsterin ym.<sup id="ref-25_1" class="ref"><a href="#note-25" title="(Brewster ym. 1998, 26)">[25]</a></sup> mielest&auml; voida k&auml;ytt&auml;&auml; pienikokoisissa kannettavissa laitteissa n&auml;yt&ouml;n pienuuden takia. My&ouml;s ty&ouml;p&ouml;yt&auml;-metafora sis&auml;lt&auml;&auml; ep&auml;loogisuuksia, jotka on erikseen opeteltava: esimerkiksi reaalimaailman ty&ouml;p&ouml;yt&auml; ei sis&auml;ll&auml; ikkunoita<sup id="ref-51_6" class="ref"><a href="#note-51" title="(Hereford &amp; Winn 1994, 214)">[51]</a></sup>. Samoin, jos &auml;&auml;ni muuttuu kovasta hiljaiseen tiedostoa tuhottaessa, se poikkeaa ty&ouml;p&ouml;yt&auml;metaforasta: asiat ty&ouml;p&ouml;yd&auml;ll&auml; eiv&auml;t tuosta vaan h&auml;ivy hiljakseen n&auml;kyvist&auml;<sup id="ref-43_22" class="ref"><a href="#note-43" title="(Gaver 1989, 87--88)">[43]</a></sup>. Kartta saattaa olla hyv&auml; spatiaalinen metafora, koska karttoja k&auml;ytet&auml;&auml;n suuntautumiseen ja navigointiin<sup id="ref-16_12" class="ref"><a href="#note-12" title="(Blattner ym. 1994, 458)">[16]</a></sup>. Koska kartta on ahdettu t&auml;yteen visuaalista informaatiota, informaatiota saattaa j&auml;&auml;d&auml; piiloon. Jos taas sama informaatio sijoitellaan spatiaaliseen &auml;&auml;nimaisemaan, informaation hukkuminen on ep&auml;todenn&auml;k&ouml;isemp&auml;&auml;.</p>
<p>Navigoitaessa keskeist&auml; on l&ouml;yt&auml;&auml; haluttu objekti tilasta, jolloin graafisissa k&auml;ytt&ouml;liittymiss&auml; usein k&auml;ytetty puumainen hierarkia ei v&auml;ltt&auml;m&auml;tt&auml; ole kaikista k&auml;ytt&ouml;kelpoisin. Spatiaalisen &auml;&auml;nen avulla on mahdollista saada aikaan abstrakti, mentaalinen tila -- paikka -- &auml;&auml;nell&auml; navigoinnille (yksityinen &auml;&auml;ni-informaatioavaruus, kupla!). T&auml;ll&ouml;in voidaan vapautua n&auml;yt&ouml;n asettamista rajoituksista ja ahtaista raameista. Saue<sup id="ref-67_1" class="ref"><a href="#note-67" title="(Saue 2000, 1--4)">[67]</a></sup> esitt&auml;&auml; mielenkiintoisen metaforan: k&auml;ytt&auml;j&auml; k&auml;velee polkuja pitkin ja kuuntelee samalla lokaalisti ja globaalisti m&auml;&auml;riteltyj&auml; &auml;&auml;nitapahtumia. Informaatio on sijoiteltu tiettyihin sijainteihin &auml;&auml;nimaisemaan, jossa k&auml;ytt&auml;j&auml; voi kuunnella oman liikkumisensa aiheuttamia &auml;&auml;ni&auml; ("k&auml;vely"), l&auml;hiymp&auml;rist&ouml;n &auml;&auml;nitapahtumia (paikalliset muuttujat), ymp&auml;rist&ouml;n tunnistamiseen tarvittavia &auml;&auml;ni&auml; (globaalit muuttujat) ja &auml;&auml;nitapahtumien manipuloinnista aiheutuvia &auml;&auml;ni&auml; (esimerkiksi objektin valinta tai raahaaminen). &Auml;&auml;net ovat suhteessa kuuntelijan sijaintiin kullakin hetkell&auml;, eli &auml;&auml;nimaisema muuttuu jatkuvasti. T&auml;m&auml; seikka aiheuttaa kuitenkin ongelmia objektien sijainnin muistamisessa (ks. my&ouml;s Kobayashi &amp; Schmandt<sup id="ref-59_6" class="ref"><a href="#note-59" title="(Kobayashi &amp; Schmandt 1997)">[59]</a></sup>). Saue esitt&auml;&auml; t&auml;h&auml;n kaksi ratkaisua: (a) kohdan merkitseminen visuaalisella merkill&auml; ja (b) polun tekeminen kiinnostavan sijainnin l&auml;pi. J&auml;lkimm&auml;inen ratkaisu luo ajallisen jakson pisteit&auml;, joka voi muodostaa mielekk&auml;&auml;n kokonaisuuden. T&auml;ll&ouml;in p&auml;&auml;st&auml;&auml;n j&auml;lleen kuuntelemaan Blyn<sup id="ref-18_3" class="ref"><a href="#note-18" title="(Bly 1982, 374)">[18]</a></sup> mainitsemaa merkityksellist&auml; "laulua".</p>
<p>Sauen ajatukset saattavat pohjautua Howardin ja Ballaksen<sup id="ref-52_7" class="ref"><a href="#note-52" title="(Howard ja Ballas 1980)">[52]</a></sup> ja Warrenin ja Verbruggen<sup id="ref-78_2" class="ref"><a href="#note-78" title="(Warren ja Verbrugge 1984)">[78]</a></sup> artikkeleihin, joissa painotettiin v&auml;liaikaisen rakenteen ja syntaksin t&auml;rke&auml;&auml; osuutta merkityksen muodostamisessa. Sauen jako paikallisiin ja globaaleihin &auml;&auml;niin on my&ouml;s mielenkiintoinen: k&auml;ytt&auml;j&auml; voi kuunnella vain niit&auml; &auml;&auml;ni&auml;, jotka on paikallisesti m&auml;&auml;ritelty tietyll&auml; rajatulla alueella kokonais&auml;&auml;nimaisemassa. T&auml;llainen jaottelu vihjaa jakoon tuttuihin ja tuntemattomiin &auml;&auml;niin. Sauen malli pohjautuu jokap&auml;iv&auml;iseen kuuntelemiseen, huomion kiinnittymiseen paikallisiin tai globaaleihin &auml;&auml;niin, spatiaalisen &auml;&auml;nen mahdollistamaan suuntautumiseen &auml;&auml;nen suuntaan sek&auml; &auml;&auml;nitapahtuman ominaisuuksien havaitsemiseen<sup id="ref-67_2" class="ref"><a href="#note-67" title="(Saue 2000, 4)">[67]</a></sup>.</p>
<p>My&ouml;s Schafer<sup id="ref-71_16" class="ref"><a href="#note-71" title="(Schafer 1977, 212)">[71]</a></sup> puhuu "&auml;&auml;nik&auml;velyst&auml;" (soundwalk). &Auml;&auml;nik&auml;vely k&auml;ytt&ouml;liittym&auml;n kokonais&auml;&auml;nimaisemassa voi muodostaa metaforisen tilakokemuksen, jossa &auml;&auml;net merkitsev&auml;t ja kertovat k&auml;ytt&ouml;liittym&auml;n tilasta ja toiminnoista. Schafer<sup id="ref-71_17" class="ref"><a href="#note-71" title="(Schafer 1977, 211--212)">[71]</a></sup> puhuu "turistista" &auml;&auml;nimaisemassa: &auml;&auml;net havaitaan paremmin vieraassa &auml;&auml;niymp&auml;rist&ouml;ss&auml;. Schaferin ideana on, ett&auml; kuuntelija luokittelisi kuulemansa &auml;&auml;nimaiseman &auml;&auml;net tietoisesti. Turistina oleminen on pelkk&auml; v&auml;livaihe (ajattelutapa) havaita ymp&auml;rill&auml;mme olevat &auml;&auml;net tehokkaammin.</p>
<p>Edell&auml; k&auml;siteltyjen ikonien, symbolien ja metaforien rajat eiv&auml;t ole itsest&auml;&auml;nselvi&auml;. Oleellista ei ehk&auml; olekaan se, mihin kategoriaan &auml;&auml;ni kuuluu. &Auml;&auml;net on paras hahmottaa jatkumona, jonka toisessa p&auml;&auml;ss&auml; ovat esitt&auml;v&auml;t &auml;&auml;net ja toisessa p&auml;&auml;ss&auml; abstraktit &auml;&auml;net<sup id="ref-10" class="ref"><a href="#note-10" title="(Barger 1994, 59)">[10]</a></sup>. Fiske<sup id="ref-40_6" class="ref"><a href="#note-40" title="(Fiske 2000, 79)">[40]</a></sup> korostaa, ett&auml; my&ouml;s ikonien ymm&auml;rt&auml;minen edellytt&auml;&auml; jossain m&auml;&auml;rin niihin tottumista. Samaa mielt&auml; on Tarasti<sup id="ref-74_2" class="ref"><a href="#note-74" title="(Tarasti 1990, 30)">[74]</a></sup> pohtiessaan, ett&auml; my&ouml;s ikonisuus on pohjimmiltaan k&auml;sitteellist&auml;. T&auml;ysin puhdas ikoni lienee siten mahdottomuus. T&auml;st&auml; seuraa, ett&auml; my&ouml;s k&auml;ytt&ouml;liittym&auml;n &auml;&auml;net t&auml;ytyy opetella; t&auml;ysin intuitiivinen k&auml;ytt&ouml;liittym&auml; saattaa olla k&auml;yt&auml;nn&ouml;ss&auml; mahdoton toteuttaa. Seuraavaksi tarkastellaan &auml;&auml;nitapahtumien erilaisia luokittelumahdollisuuksia.</p>
</div>
<div id="ch-4_6">
<h4>4.6 &Auml;&auml;nitapahtumien luokitteluj&auml;rjestelm&auml;t <a title="takaisin sis&auml;llysluetteloon" href="#toc-4_6">^</a></h4>
<p>Jotta &auml;&auml;nitapahtumia voitaisiin intuitiivisesti yhdist&auml;&auml; k&auml;ytt&ouml;liittym&auml;n toimintoihin, t&auml;ytyy &auml;&auml;net ensin luokitella. Gaver<sup id="ref-46_10" class="ref"><a href="#note-46" title="(Gaver 1993c, 9)">[46]</a></sup> analysoi &auml;&auml;nitapahtumia kvalitatiivisesti ja jakaa ne kolmeen kategoriaan: (a) v&auml;r&auml;hteleviin kappaleisiin (esimerkiksi askeleet), (b) nestem&auml;isiin &auml;&auml;niin (esimerkiksi veden lorina tai kappaleen putoaminen veteen) ja (c) aerodynaamisiin tapahtumiin (esimerkiksi tuulen &auml;&auml;ni). Gaverin<sup id="ref-46_11" class="ref"><a href="#note-46" title="(Gaver 1993c, 20--21)">[46]</a></sup> tavoitteena on j&auml;rjestell&auml; jokap&auml;iv&auml;isen kuuntelun &auml;&auml;nitapahtumat yleiseen ja yksinkertaiseen, kuultavissa olevaan  muotoon. Yksi tapa on j&auml;rjest&auml;&auml; ne kontekstin mukaan (esimerkiksi toimiston &auml;&auml;net). Gaver kuitenkin toteaa, ettei t&auml;m&auml; tapa ole riitt&auml;v&auml; ja esittelee sen sijaan hierarkkisen viitehyksen. Koska &auml;&auml;nitapahtuma syntyy materiaalien vuorovaikutuksen tuloksena<sup id="ref-46_12" class="ref"><a href="#note-46" title="(Gaver 1993c, 22)">[46]</a></sup>, er&auml;s mahdollisuus on sijoittaa materiaalit ylemm&auml;lle tasolle ja vuorovaikutuksen muodot alemmalle. Gaver<sup id="ref-46_13" class="ref"><a href="#note-46" title="(Gaver 1993c, 26)">[46]</a></sup> kuitenkin toteaa, ett&auml; esimerkiksi isku saattaa kertoa enemm&auml;n sen voimasta kuin materiaalista, tai enemm&auml;n materiaalista kuin vuorovaikutuksen muodosta.</p>
<p>Gaverin luokittelu on hy&ouml;dyllinen, joskaan siin&auml; ei tarkasti oteta kantaa siihen, mit&auml; n&auml;m&auml; materiaalit tai vuorovaikutukset merkitsev&auml;t k&auml;ytt&ouml;liittym&auml;kontekstissa (huomaa kuitenkin Gaverin "SonicFinder"<sup id="ref-43_23" class="ref"><a href="#note-43" title="(Gaver 1989)">[43]</a></sup>, jossa k&auml;ytettiin menestyksellisesti mm. roskap&ouml;nt&ouml;n &auml;&auml;nt&auml;). Luokittelussa hyl&auml;t&auml;&auml;n kontekstin osuus; el&auml;v&auml;ss&auml; el&auml;m&auml;ss&auml; t&auml;m&auml; onkin perusteltua, koska my&ouml;s toimistossa voi yll&auml;tt&auml;en kuulua mit&auml; tahansa &auml;&auml;ni&auml;. Sen sijaan k&auml;ytt&ouml;liittym&auml;ss&auml; kontekstin osuus &auml;&auml;nten luokittelussa korostuu, koska virtuaalisen &auml;&auml;nimaiseman ei t&auml;ysin tarvitse noudattaa reaalitodellisuutta. Riitt&auml;&auml;, ett&auml; t&auml;rkeimm&auml;t piirteet s&auml;ilytet&auml;&auml;n.</p>
<p>Gibson<sup id="ref-48_16" class="ref"><a href="#note-48" title="(Gibson 1966, 79--81)">[48]</a></sup> puolestaan jakaa &auml;&auml;nimaiseman seuraavasti: (a) jatkuvat &auml;&auml;net (esimerkiksi vesiputous), (b) ep&auml;s&auml;&auml;nn&ouml;lliset &auml;&auml;net (esimerkiksi tuuli) sek&auml; (c) &auml;killiset, odottamattomat &auml;&auml;net (esimerkiksi vieriminen ja hankaaminen). T&auml;m&auml;n lis&auml;ksi Gibson mainitsee el&auml;inten ja ihmisten tuottamat &auml;&auml;net (puhe, musiikki) sek&auml; teknologisen aikakauden tuottamat koneelliset &auml;&auml;net. Kaikki n&auml;m&auml; &auml;&auml;nitapahtumat etenev&auml;t ajassa, ja useimmilla niist&auml; on alku ja loppu.<sup id="ref-48_17" class="ref"><a href="#note-48" title="(Gibson 1966, 79--81)">[48]</a></sup>. Gibson siis jakaa &auml;&auml;net toisaalta niiden ilmenemistiheyden, toisaalta niiden aiheuttajien mukaan. T&auml;llainen l&auml;hestymistapa saattaa olla k&auml;ytt&ouml;kelpoisempi kuin Gaverin hierarkkinen luokittelu. Gibsonin luokittelu l&auml;henee pikemminkin Schaferin<sup id="ref-71_18" class="ref"><a href="#note-71" title="(Schafer 1977)">[71]</a></sup> vastaavaa jaottelua: t&auml;ll&ouml;in p&auml;&auml;st&auml;&auml;n vihdoin Schaferin edustamaan &auml;&auml;nimaisemateoriaan.</p>
<p>Schaferin<sup id="ref-71_19" class="ref"><a href="#note-71" title="(Schafer 1977, 137)">[71]</a></sup> mukaan hankaluutena &auml;&auml;nten luokittelussa on se, ettei &auml;&auml;nill&auml; ole objektiivisia merkityksi&auml;, vaan kullakin kuulijalla on kulttuuriset n&auml;kemyksens&auml; niist&auml;. Schafer<sup id="ref-71_20" class="ref"><a href="#note-71" title="(Schafer 1977, 138--145)">[71]</a></sup> jakaa &auml;&auml;net semanttisesti seuraaviin luokkiin (ja n&auml;m&auml; viel&auml; alaluokkiin): (a) luonnolliset &auml;&auml;net (ilma, maa), (b) ihmisen tuottamat &auml;&auml;net (puhe, vaatteiden kahina), (c) kaupunki- ja maaseutu&auml;&auml;nimaiseman &auml;&auml;net, (d) mekaaniset &auml;&auml;net (koneet, tuulettimet) ja (e) hiljaisuus. T&auml;llainen lista on merkitt&auml;v&auml; vain mik&auml;li sit&auml; voidaan soveltaa k&auml;ytt&ouml;liittym&auml;&auml;n. Sellaisenaan se on t&auml;h&auml;n tarkoitukseen liian laaja, koska siin&auml; luokitellaan &auml;&auml;net vain niiden aiheuttajien mukaan. Schaferin  mielest&auml;<sup id="ref-71_21" class="ref"><a href="#note-71" title="(Schafer 1977, 111)">[71]</a></sup> 1900-luvun musiikin huomiota her&auml;tt&auml;vin piirre on se, ett&auml; rajat musiikin ja ymp&auml;rist&ouml;n jokap&auml;iv&auml;isten &auml;&auml;nten v&auml;lill&auml; ovat h&auml;m&auml;rtyneet. Sovellettuna k&auml;ytt&ouml;liittym&auml;&auml;n t&auml;m&auml; merkitsee, ett&auml; nykyajan ihminen on tottunut kaikenlaisten &auml;&auml;nten yhdess&auml;oloon. T&auml;m&auml; seikka vaikeuttaa k&auml;ytett&auml;vien &auml;&auml;nten valintaa entisest&auml;&auml;n.</p>
<p>On siis tarpeen mietti&auml;, miten muuten &auml;&auml;net voitaisiin luokitella, jotta niit&auml; voitaisiin soveltaa k&auml;ytt&ouml;liittym&auml;&auml;n. Edell&auml; &auml;&auml;nitapahtumat on jaettu ainakin esitt&auml;vyyden, abstraktisuuden tai assosiaation periaatteiden mukaan (ikonit, symbolit ja metaforat); materiaalien tai vuorovaikutuksen muodon mukaan; musiikillisten tai ei-musiikillisten &auml;&auml;nten mukaan; luonnon tai mekaanisten &auml;&auml;nten mukaan. N&auml;m&auml; luokitteluj&auml;rjestelm&auml;t eiv&auml;t ole t&auml;ysin vertailukelpoisia kesken&auml;&auml;n, koska ne sijoittuvat eri tasoille ja osin limitt&auml;in. Esimerkiksi luonnon &auml;&auml;net (siis ei-musiikilliset &auml;&auml;net) ovat useimmiten ikonisia, kun taas metaforiset &auml;&auml;net voivat mielikuvituksellisesti yhdist&auml;&auml; piirteit&auml; kaikista luokittelutasoista.</p>
<p>On kuitenkin viel&auml; ainakin yksi tapa luokitella &auml;&auml;ni&auml;, jota ei k&auml;ytt&ouml;liittym&auml;kontekstissa ole aiemmin k&auml;sitelty. Schafer<sup id="ref-71_22" class="ref"><a href="#note-71" title="(Schafer 1977)">[71]</a></sup> kehitti useita k&auml;sitteit&auml;, joilla halusi luokitella &auml;&auml;nimaisemassa kuuluvia &auml;&auml;ni&auml;. Onkin yll&auml;tt&auml;v&auml;&auml;, ettei Schaferin k&auml;sitteit&auml; ole aiemmin yhdistetty k&auml;ytt&ouml;liittym&auml;kontekstiin. K&auml;sitteet eroavat Schaferin edell&auml; esitetyst&auml; jaottelusta: samalla kun ne kuuluvat jokap&auml;iv&auml;iseen &auml;&auml;nimaisemaamme, ne perustuvat &auml;&auml;nten aiheuttajien lis&auml;ksi niiden rooleille &auml;&auml;nimaisemassa ja ovat siten sovellettavissa spatiaaliseen k&auml;ytt&ouml;liittym&auml;&auml;n. Lis&auml;ksi ne viittaavat tietyn yhteis&ouml;n olemassaoloon ja tapahtuvat siten aina tietyss&auml; kontekstissa. &Auml;&auml;nimaisemaa voidaan Schaferin<sup id="ref-71_23" class="ref"><a href="#note-71" title="(Schafer 1977, 9--10, 43--44)">[71]</a></sup> mukaan kuvata seuraavilla k&auml;sitteill&auml;:</p>
<dl>
<dt><em>Perus&auml;&auml;ni</em></dt>
<dd>on &auml;&auml;ni, joka kuuluu yhteis&ouml;ss&auml; jatkuvasti tai tarpeeksi usein muodostaen taustan muille &auml;&auml;nille.</dd>
<dt><em>&Auml;&auml;nellinen maamerkki</em></dt>
<dd>on yhteis&ouml;ss&auml; ilmenev&auml; ainutlaatuinen ja merkitt&auml;v&auml; &auml;&auml;ni, jota on syyt&auml; suojella. M&auml;&auml;ritelm&auml; viittaa my&ouml;s tietyn tilan tunnistamiseen  &auml;&auml;nen avulla.</dd>
<dt><em>Signaali</em></dt>
<dd>tarkoittaa &auml;&auml;nt&auml;, johon kiinnitet&auml;&auml;n erityisesti huomiota. Esimerkkin&auml; t&auml;st&auml; ovat varoitussignaalit.</dd>
<dt><em>Hi-fi</em></dt>
<dd>viittaa ymp&auml;rist&ouml;&ouml;n, jossa &auml;&auml;net ovat kuultavissa sekoittumatta tai peittym&auml;tt&auml; toistensa alle.</dd>
<dt><em>Lo-fi</em></dt>
<dd>viittaa ymp&auml;rist&ouml;&ouml;n, jossa &auml;&auml;net sekoittuvat tai peittyv&auml;t toistensa alle. Lo-fi--ymp&auml;rist&ouml; sai alkunsa teollisen vallankumouksen seurauksena (1700-luvun lopulta l&auml;htien) ja vahvistui entisest&auml;&auml;n s&auml;hk&ouml;isen vallankumouksen aikana<sup id="ref-71_24" class="ref"><a href="#note-71" title="(Schafer 1977, 71)">[71]</a></sup>. Hiljainen hi-fi--maailma on siis muuttunut kova&auml;&auml;niseksi lo-fi--maailmaksi useiden vuosisatojen aikana.</dd>
</dl>
<p>K&auml;sitteet tarjoavat luontevan ymp&auml;rist&ouml;n spatiaalisen &auml;&auml;nen k&auml;yt&ouml;lle. Schafer puhuu yhteis&ouml;st&auml;; t&auml;ss&auml; yhteydess&auml; se voidaan rinnastaa k&auml;ytt&ouml;liittym&auml;n muodostamaan akustiseen tilaan. Schaferin<sup id="ref-71_25" class="ref"><a href="#note-71" title="(Schafer 1977, 214)">[71]</a></sup> mukaan <em>akustinen tila</em> tarkoittaa sit&auml; aluetta, jonka sis&auml;ll&auml; &auml;&auml;net kuuluvat: esimerkiksi ihmisen tuottama akustinen avaruus rajoittuu siihen alueeseen, jossa h&auml;nen huutonsa kuuluu. Koneiden avulla t&auml;t&auml; akustista aluetta voidaan suurentaa ja my&ouml;s t&auml;ytt&auml;&auml; ahtaammin.<sup id="ref-71_26" class="ref"><a href="#note-71" title="(Schafer 1977, 214)">[71]</a></sup>. Akustisen tilan &auml;&auml;net merkitsev&auml;t jotain vain niiss&auml; (virtuaalisissa) ymp&auml;rist&ouml;iss&auml; ja konteksteissa, jotka on sidottu k&auml;ytt&ouml;liittym&auml;n tapahtumiin. T&auml;ll&ouml;in siis voidaan yhdist&auml;&auml; &auml;&auml;nen funktio sen sijaintiin.</p>
<p>Luonnon &auml;&auml;nimaisemassa jokaiselle &auml;&auml;nitapahtumalle on aikansa; Schafer v&auml;itt&auml;&auml;, ett&auml; t&auml;llainen vuoropuhelu on katoamassa urbaanista maailmasta, jolloin p&auml;&auml;dyt&auml;&auml;n lo-fi--&auml;&auml;nimaisemaan ja &auml;&auml;nten kakofoniaan<sup id="ref-71_27" class="ref"><a href="#note-71" title="(Schafer 1977, 229, 237)">[71]</a></sup>. Schaferin mukaan aiemmissa yhteis&ouml;iss&auml; suurin osa &auml;&auml;nist&auml; oli yksitt&auml;isi&auml; ja niill&auml; oli selke&auml; alku ja loppu, kun taas nykyaikana suurin osa &auml;&auml;nist&auml; on jatkuvia<sup id="ref-71_28" class="ref"><a href="#note-71" title="(Schafer 1977, 78)">[71]</a></sup>. Schafer<sup id="ref-71_29" class="ref"><a href="#note-71" title="(Schafer 1977, 88--90)">[71]</a></sup> toteaa my&ouml;s, ett&auml; aiemmin kaikki &auml;&auml;net olivat alkuper&auml;isi&auml;, eli ne tapahtuivat tiettyn&auml; aikana tietyss&auml; paikassa vain kerran. S&auml;hk&ouml;isen&auml; aikakautena on mahdollista erottaa &auml;&auml;ni &auml;&auml;nil&auml;hteest&auml;&auml;n ja siten sen alkuper&auml;isest&auml; kontekstistaan. T&auml;ll&ouml;in on mahdollista simuloida mit&auml; tahansa &auml;&auml;niymp&auml;rist&ouml;&auml; ja tehd&auml; siit&auml; kannettava, mukana kulkeva kokonaisuus<sup id="ref-71_30" class="ref"><a href="#note-71" title="(Schafer 1977, 91)">[71]</a></sup>.</p>
<p>Schaferin ajatuksista saa dramaattisen vaikutelman, ett&auml; ihmiset pakenevat ulkomaailman modernia lo-fi--&auml;&auml;niymp&auml;rist&ouml;&auml; koteihinsa l&ouml;yt&auml;&auml;kseen sielt&auml; rauhallisemman hi-fi--&auml;&auml;nimaiseman; samalla tavalla k&auml;ytt&ouml;liittym&auml;ss&auml; voitaisiin j&auml;rjest&auml;&auml; ihanteellinen keinotodellisuus (yksityinen kupla), jossa kaikki &auml;&auml;net kuuluvat ja ovat merkityksilt&auml;&auml;n yksiselitteisi&auml;, koska ne on otettu p&auml;ivitt&auml;isest&auml; ymp&auml;rist&ouml;st&auml; ja vain j&auml;rjestetty paremmin. Koska reaalitodellisuudessa &auml;&auml;nimaisemaa saattaa olla mahdotonta muuttaa kovinkaan paljon paremmaksi, k&auml;ytt&ouml;liittym&auml;n virtuaalitodellisuus voi tarjota t&auml;h&auml;n toisen mahdollisuuden. Schafer<sup id="ref-71_31" class="ref"><a href="#note-71" title="(Schafer 1977, 217--219)">[71]</a></sup> pohtii my&ouml;s, ett&auml; &auml;&auml;net sis&auml;tilassa saattavat merkit&auml; yksityisyytt&auml;, kun taas kaikuisat &auml;&auml;net saattavat merkit&auml; jatkuvuutta tai auktoriteettia. Juuri t&auml;llaiset merkitykset ovat t&auml;rkeit&auml; -- ja toistaiseksi v&auml;hemm&auml;n k&auml;ytettyj&auml; -- k&auml;ytt&ouml;liittym&auml;ss&auml;. Ne my&ouml;s viittaavat suoraan spatiaaliseen &auml;&auml;neen. N&auml;iden l&ouml;yd&ouml;sten perusteella p&auml;&auml;dyt&auml;&auml;n seuraavassa luvussa kokoamaan yhteen tutkimuksen tulokset.</p>
</div>
<div id="ch-5">
<h3>5. Keskustelua <a title="takaisin sis&auml;llysluetteloon" href="#toc-5">^</a></h3>
<p>Luvussa esitell&auml;&auml;n keskeisimm&auml;t tulokset, joita sitten tarkastellaan alussa asetettujen tutkimusongelmien valossa ja aiempiin tutkimuksiin suhteuttaen.</p>
</div>
<div id="ch-5_1">
<h4>5.1 Tulokset <a title="takaisin sis&auml;llysluetteloon" href="#toc-5_1">^</a></h4>
<p>Tutkimus on perustunut olettamukseen kuulohavaintoj&auml;rjestelm&auml;n kaksijakoisesta funktiosta: aktiivisesta &auml;&auml;nen suunnan havaitsemisesta sek&auml; &auml;&auml;nil&auml;hteen tunnistamisesta. T&auml;ll&auml; perusteella &auml;&auml;nen suunnan tuottama merkityssis&auml;lt&ouml; on pyritty yhdist&auml;m&auml;&auml;n k&auml;ytt&ouml;liittym&auml;n toimintoihin ja objekteihin piilossa olevan informaation paljastamiseksi. Vaikka sijainti ei olekaan ainoa tekij&auml; &auml;&auml;nten erottelun ja ryhmittelyn kannalta, se on valittu k&auml;sitelt&auml;v&auml;ksi juuri sen tarjoaman merkityssis&auml;ll&ouml;n vuoksi. &Auml;&auml;nivirta mentaalisena kokemuksena voidaan rinnastaa visuaalisen objektin kokemiseen, koska yksitt&auml;isest&auml; &auml;&auml;nil&auml;hteest&auml; per&auml;isin olevat &auml;&auml;net tulevat yleens&auml; yhdest&auml; sijainnista &auml;&auml;nellisest&auml; avaruudesta. Muistin aiheuttamien rajoitusten vuoksi k&auml;sitelt&auml;v&auml;ksi on rajattu paikallaan pysyv&auml; &auml;&auml;ni.</p>
<p>Kuulo- ja n&auml;k&ouml;aistin vertailu paljasti niiden perimm&auml;iset -- joskin t&auml;ss&auml; yksinkertaistetut -- erot, samoin kuin kummankin vahvimmat puolet. Koska kuuloaistimme avulla saamme tietoa taustalla tapahtuvista prosesseista, voimme p&auml;&auml;tt&auml;&auml;, mitk&auml; osat ymp&auml;rist&ouml;st&auml;mme tuodaan n&auml;k&ouml;aistin alueelle. T&auml;st&auml; seuraa, ett&auml; spatiaalinen &auml;&auml;ni auttaa l&ouml;yt&auml;m&auml;&auml;n n&auml;yt&ouml;lt&auml; visuaalisen objektin nopeammin, kun kohde on n&auml;k&ouml;kent&auml;n ulkopuolella tai muuten piilossa esimerkiksi toisen ikkunan takana (tai ei mahdu pienikokoiselle n&auml;yt&ouml;lle). Suuntautumisen lis&auml;ksi olennainen ero n&auml;k&ouml;- ja kuuloaistin v&auml;lill&auml; on ajallisuus: &auml;&auml;ni perustuu vaihteluihin ajassa ja viittaa siten yleens&auml; tilan tarkkailuun tai muutokseen. Kuulo- ja n&auml;k&ouml;aistin eroista johtuen -- ja siten toisiaan t&auml;ydent&auml;en -- kokemus syntyy &auml;&auml;nellisen ja visuaalisen informaation yhteisty&ouml;n&auml;.</p>
<p>Synteettisen spatialisoinnin toteutuksessa olennaisimmiksi ongelmiksi osoittautuivat peilikuva&auml;&auml;net, paikantamisvirheet ja tietokoneen suorituskyvyn ylitt&auml;v&auml; datam&auml;&auml;r&auml; (vimeksimainitun ongelman osalta tilanne tosin edistyy koko ajan tekniikan my&ouml;t&auml;). Vaihe- ja voimakkuuserot korvien v&auml;lill&auml;, korvalehden ja -k&auml;yt&auml;v&auml;n vaikutus sek&auml; p&auml;&auml;n aiheuttama &auml;&auml;nen vaimeneminen ovat t&auml;rkeimm&auml;t tekij&auml;t, jotka muuntavat &auml;&auml;nen spektri&auml; muodostaen siirtofunktion, jonka perusteella &auml;&auml;ni paikannetaan. Paikantamisvirheet n&auml;ytt&auml;v&auml;t keskittyv&auml;n siirtofunktion ymp&auml;rille. N&auml;it&auml; paikantamisvirheit&auml; voidaan tosin huomattavasti v&auml;hent&auml;&auml;, jos &auml;&auml;nen toistossa k&auml;ytet&auml;&auml;n kuulokkeita.</p>
<p>Paikantaminen on monimutkainen prosessi, jonka kattava selvitt&auml;minen t&auml;ss&auml; yhteydess&auml; ei ole ollut mahdollista. T&auml;st&auml; syyst&auml; tutkimuksen psykoakustista osuutta on v&auml;ist&auml;m&auml;tt&auml; jouduttu yksinkertaistamaan kuitenkin siten, ett&auml; keskeisimm&auml;t seikat on k&auml;sitelty. Toteutukseen liittyv&auml;t ongelmat ovat kuitenkin voitettavissa; t&auml;st&auml; ovat osoituksena lukuisat spatiaalista &auml;&auml;nt&auml; hy&ouml;dynt&auml;v&auml;t sovellukset (l&auml;hinn&auml; kuitenkin laboratorio-olosuhteissa, ei kaupallisessa k&auml;yt&ouml;ss&auml;).</p>
<p>Spatiaalisia &auml;&auml;ni&auml; k&auml;ytett&auml;ess&auml; on erityisen t&auml;rke&auml;&auml;, ett&auml; erilliset per&auml;kk&auml;iset &auml;&auml;nitapahtumat noudattavat v&auml;liaikaista jaksollista rakennetta. Per&auml;kk&auml;isten &auml;&auml;nitapahtumien on kielen tavoin perustuttava syntaksiin; syntaksi muodostuu niist&auml; mahdollisista v&auml;liaikaisista suhteista, joista jakso &auml;&auml;nitapahtumia voi kesken&auml;&auml;n muodostaa j&auml;rkev&auml;n kokonaisuuden. J&auml;rkev&auml; kokonaisuus syntyy reaalitodellisuudessa &auml;&auml;nil&auml;hteiden sanelemassa j&auml;rjestyksess&auml; ja kest&auml;&auml; &auml;&auml;nil&auml;hteiden ominaisuuksista riippuvan ajan. T&auml;t&auml; seikkaa voidaan hy&ouml;dynt&auml;&auml; jakamalla k&auml;ytt&ouml;liittym&auml;n toiminnot &auml;&auml;nitapahtumien jaksoiksi: jakso koostuu toiminnoista, jotka k&auml;ytt&auml;j&auml; tekee suorittaakseen jonkin teht&auml;v&auml;n.</p>
<p>Ensimm&auml;isen tutkimusongelman mukaisesti pyrittiin selvitt&auml;m&auml;&auml;n, miten spatiaalista &auml;&auml;nt&auml; voitaisiin k&auml;ytt&auml;&auml; grafiikan kanssa teht&auml;v&auml;n suorituksessa ja piilossa olevien objektien tai tapahtumien esitt&auml;misess&auml;. Tulosten mukaan spatiaalinen &auml;&auml;ni tarjoaa uuden ulottuvuuden niihin funktioihin, joissa &auml;&auml;ni voi k&auml;ytt&ouml;liittym&auml;ss&auml; toimia. Kun &auml;&auml;nen tarkoitus on esimerkiksi antaa palautetta k&auml;ytt&auml;j&auml;n toiminnasta, miksi tyyty&auml; monauraaliseen tai stereo&auml;&auml;neen? Spatiaalisen &auml;&auml;nen k&auml;ytt&ouml;&auml; puolustavat seuraavat seikat:</p>
<ul>
<li>Toteutus on teknisesti mahdollinen.</li>
<li>Jokap&auml;iv&auml;inen &auml;&auml;nimaisemamme on spatiaalinen.</li>
<li>Spatiaalinen &auml;&auml;ni osoittaa, minne katsoa.</li>
<li>Spatiaalinen &auml;&auml;ni voi tarjota informaatiota akustisen tilan ominaisuuksista ja objektien sijainnista.</li>
<li>Informaatiota voidaan j&auml;rjestell&auml; 360 asteen alueelle, jolloin visuaalisen informaation m&auml;&auml;r&auml; v&auml;henee.</li>
</ul>
<p>Lis&auml;ksi, jokap&auml;iv&auml;iset spatiaaliset &auml;&auml;net voivat v&auml;litt&auml;&auml; hienovaraisempaa informaatiota &auml;&auml;nitapahtumasta tai vuorovaikutuksen muodosta kuin perinteisten musiikillisten instrumenttien tuottamat &auml;&auml;net (joita k&auml;ytt&ouml;liittym&auml;ss&auml; on perinteisesti k&auml;ytetty monauraalisesti tai stereona). J&auml;ljelle j&auml;&auml; siten vain sopivan luokitteluj&auml;rjestelm&auml;n valitseminen: t&auml;ll&ouml;in voidaan saada selville, mink&auml;laisia &auml;&auml;ni&auml; kannattaisi k&auml;ytt&auml;&auml; miss&auml;kin k&auml;ytt&ouml;liittym&auml;n tapahtumassa. T&auml;m&auml; on kaikkea muuta kuin helppo teht&auml;v&auml;.</p>
<p>Tutkimuksessa on tarkasteltu useita erilaisia -- sek&auml; hierarkkisia ett&auml; kontekstipohjaisia -- &auml;&auml;nitapahtumien luokitteluj&auml;rjestelmi&auml;. Niiden vastakkainasettelun perusteella k&auml;ytt&ouml;kelpoisimmaksi osoittautui Schaferin (1977) esitt&auml;m&auml; luokittelu: &auml;&auml;nitapahtumien jako perus&auml;&auml;niin, &auml;&auml;nellisiin maamerkkeihin ja signaaleihin viittaa tietyss&auml; kontekstissa olemassaolevaan akustiseen tilaan. T&auml;llainen jaottelu tarjoaa siten yhden mahdollisen vastauksen tutkimusongelmaan, pit&auml;en sis&auml;ll&auml;&auml;n sek&auml; &auml;&auml;nen roolin -- merkityksen -- ett&auml; spatiaalisuuden k&auml;ytt&ouml;liittym&auml;ss&auml;. N&auml;k&ouml;aistin osuus t&auml;ss&auml; on se, ett&auml; k&auml;ytt&auml;j&auml; voi k&auml;&auml;nt&auml;&auml; katseensa objektiin (tai reagoida muulla tavoin) ainoastaan silloin, kun siihen todella on tarvetta. N&auml;in n&auml;k&ouml;aisti vapautuu sen hetkiseen t&auml;rke&auml;&auml;n teht&auml;v&auml;&auml;n, eik&auml; kuormitu turhalla informaatiolla. Spatiaalinen &auml;&auml;ni voi ilmaista t&auml;m&auml;n tarpeen &auml;&auml;nen sijainnin ja merkityksen -- esimerkiksi kiireellisyyden (signaali) tai &auml;&auml;nellisen maamerkin -- avulla; merkitykset kun on opittu jokap&auml;iv&auml;isest&auml; el&auml;m&auml;st&auml;. T&auml;ll&ouml;in voidaan saavuttaa intuitiivinen kuvallisen ja &auml;&auml;nellisen informaation yhdistelm&auml;; seikka jota on hy&ouml;dynnetty peleiss&auml; jo vuosikausia. Spatiaalisen &auml;&auml;nen muodostamassa kannettavassa "kuplassa" informaatiota voidaan j&auml;rjestell&auml; laajemmalle alueelle kuin visuaalista informaatiota.</p>
<p>On kuitenkin otettava huomioon, ett&auml; moderni jokap&auml;iv&auml;inen &auml;&auml;nimaisema voi sis&auml;lt&auml;&auml; my&ouml;s musiikillisia &auml;&auml;ni&auml;: ero on &auml;&auml;nten kokemisessa. Oleellista on se, ett&auml; &auml;&auml;net ja &auml;&auml;nil&auml;hteet ovat mahdollisimman ikonisessa suhteessa toisiinsa, jolloin niiden opettelemiseen kuluu v&auml;hemm&auml;n aikaa. Oli kyseess&auml; sitten musiikilliset tai jokap&auml;iv&auml;iset &auml;&auml;net, niiden avulla voidaan esimerkiksi tunnistaa jokin metaforinen akustinen tila -- kyseess&auml; on t&auml;ll&ouml;in &auml;&auml;nellinen maamerkki. Kontekstin merkitys objektien tunnistamisessa ja merkityksenannossa korostuu etenkin silloin, kun eri fysikaaliset tapahtumat aiheuttavat samankaltaisia &auml;&auml;ni&auml;. Aina ei kuitenkaan ole v&auml;ltt&auml;m&auml;t&ouml;nt&auml; objektiivisesti tunnistaa &auml;&auml;nil&auml;hdett&auml;: riitt&auml;&auml;, ett&auml; se on reaaliobjektin kaltainen. K&auml;ytt&ouml;liittym&auml;n virtuaalitodellisuudessa voidaan korostaa ja liioitella sellaisia piirteit&auml;, jotka tekev&auml;t &auml;&auml;niobjektin merkityksest&auml; yksiselitteisen k&auml;ytt&ouml;liittym&auml;kontekstissa.</p>
<p>Seuraavaksi esitell&auml;&auml;n toisen tutkimusongelman mahdollista ratkaisua. Tavoitteena oli selvitt&auml;&auml;, voidaanko k&auml;ytt&ouml;liittym&auml;n ulkopuolisia spatiaalisia &auml;&auml;ni&auml; hy&ouml;dynt&auml;&auml; piiloinformaation esitt&auml;misess&auml;. "Ulkopuolisilla" &auml;&auml;nill&auml; tarkoitettiin sellaisia &auml;&auml;ni&auml;, jotta eiv&auml;t suoraan liity k&auml;ytt&ouml;liittym&auml;n toimintoihin. Yhten&auml; ratkaisuna voidaan pit&auml;&auml; elokuvallisten &auml;&auml;niefektien k&auml;ytt&ouml;&auml;. T&auml;lle voidaan esitt&auml;&auml; kaksi perustelua: ensinn&auml;kin, ihmisten voidaan olettaa kykenev&auml;n yleist&auml;&auml; tiet&auml;myst&auml;&auml;n jokap&auml;iv&auml;isist&auml; &auml;&auml;nitapahtumista. T&auml;ll&ouml;in riitt&auml;&auml; se, ett&auml; &auml;&auml;nitapahtumat muistuttavat jokap&auml;iv&auml;isi&auml; &auml;&auml;ni&auml;: kyse on siten metaforisesta assosiaation periaatteesta. Toiseksi: voidaan olettaa, ett&auml; tietyt &auml;&auml;net ovat tuttuja elokuvista tai televisio- ja radio-ohjelmista. T&auml;ll&ouml;in k&auml;ytt&ouml;liittym&auml;ss&auml;kin voitaisiin p&auml;&auml;st&auml; l&auml;hemm&auml;ksi tietokonepelien maailmaa -- sit&auml; maailmaa, jossa elokuvat ovat oleskelleet jo useiden kymmenien vuosien ajan. T&auml;st&auml; kuitenkin seuraa, ett&auml; k&auml;yt&ouml;n opettelemiselle t&auml;ytyy varata hieman enemm&auml;n aikaa.</p>
<p>Edell&auml; mainittu "ulkopuolinen" &auml;&auml;ni voi viitata my&ouml;s toiseen merkitykseen: nimitt&auml;in n&auml;yt&ouml;n ulkopuolella, n&auml;kym&auml;tt&ouml;miss&auml; olevan objektin aiheuttamaan &auml;&auml;neen. T&auml;ll&auml; on kaksi seurausta: n&auml;yt&ouml;n ulkopuolinen &auml;&auml;ni viittaa (a) piilossa olevan informaation olemassaoloon sek&auml; (b) audiovisuaaliseen sopimukseen, koska sulkiessamme silm&auml;mme -- tai katsoessamme muualle -- n&auml;yt&ouml;n ulkopuoliset &auml;&auml;net muuttuvat n&auml;yt&ouml;ll&auml; oleviksi &auml;&auml;niksi. T&auml;m&auml; on yksi osoitus siit&auml;, ett&auml; elokuvallisella &auml;&auml;nell&auml; ja siihen liittyvill&auml; teorioilla on paljon tarjottavana my&ouml;s k&auml;ytt&ouml;liittym&auml;lle. Seuraavassa kohdassa analysoidaan tuloksia tarkemmin suhteessa aiempiin tutkimuksiin.</p>
</div>
<div id="ch-5_2">
<h4>5.2 Johtop&auml;&auml;t&ouml;kset <a title="takaisin sis&auml;llysluetteloon" href="#toc-5_2">^</a></h4>
<p>Tutkimus osoittaa, ett&auml; k&auml;ytt&ouml;liittym&auml;ss&auml; on mahdollista muodostaa metaforinen akustinen tila, jossa k&auml;ytt&auml;j&auml; kuuntelee ikonisia spatiaalisia &auml;&auml;ni&auml; ja reagoi niihin niiden sis&auml;lt&auml;m&auml;n informaatiosis&auml;ll&ouml;n mukaisesti. Spatiaalisten jokap&auml;iv&auml;isten &auml;&auml;nten avulla voidaan paljastaa informaatiota, joka muutoin j&auml;isi visuaalisesti piiloon. Tutkimuksen kontribuutiona voidaan pit&auml;&auml; sit&auml;, ett&auml; siin&auml; on koottu erillisi&auml; tutkimustuloksia pyrkien yhdist&auml;m&auml;&auml;n sit&auml; tiet&auml;myst&auml;, joka muutoin j&auml;isi insin&ouml;&ouml;rien, musiikkitieteen, kognitiotieteen tai viestint&auml;tieteen tutkijoiden erityisalaksi. Aiemmassa tutkimuskirjallisuudessa on ollut silmiinpist&auml;v&auml;&auml; se, ett&auml; niiss&auml; on keskitytty toisaalta joko symbolisten &auml;&auml;nten k&auml;ytt&auml;j&auml;testaukseen ilman taustalla olevaa teoriaa tai teoreettiseen pohdiskeluun &auml;&auml;nen roolista visuaalisen kuorman kevent&auml;misess&auml; ilman empiirist&auml; testausta. Asioita ei ole kyetty luontevasti yhdist&auml;m&auml;&auml;n.</p>
<p>T&auml;ss&auml; tutkimuksessa ei ole muodostettu varsinaista omaa uutta teoriaa tai mallia; pikemminkin kyse on uudesta n&auml;k&ouml;kulmasta ja asioiden luovasta yhdist&auml;misest&auml;. Olennaisimpana kontribuutiona voidaan pit&auml;&auml; akustisen ekologian ja sen sis&auml;lt&auml;mien spatiaalisten &auml;&auml;nimaisemak&auml;sitteiden -- samoin kuin elokuvallisten &auml;&auml;niefektien -- yhdist&auml;mist&auml; k&auml;ytt&ouml;liittym&auml;kontekstiin. T&auml;llaiset kytkenn&auml;t ovat erityisen hy&ouml;dyllisi&auml;, koska ne ovat sovellettavissa laajalti eri j&auml;rjestelmiin ja laitteisiin. Tekniikka t&auml;t&auml; varten on ollut valmiina jo vuosia. TAULUKOSSA 2 on viel&auml; koottu yhteen tutkimuksen t&auml;rkeimm&auml;t tulokset.</p>
<p>Toisaalta tutkimuksen varjopuolena taas on aiheen laajuus ja abstrakti luonne, jolloin on ollut vaikea v&auml;ltt&auml;&auml; liiallista yksinkertaistamista ja yleist&auml;mist&auml;. Tulokset kuitenkin osoittavat, ett&auml; &auml;&auml;ni&auml; todella voidaan k&auml;ytt&auml;&auml; laajan k&auml;ytt&auml;j&auml;ryhm&auml;n hyv&auml;ksi; t&auml;rkeint&auml; on, ettei musiikillisen koulutuksen puute muodostu erottavaksi tekij&auml;ksi. Mahdollisimman laaja k&auml;ytt&auml;j&auml;ryhm&auml; tulisi tietenkin olla tavoitteena, jolloin on perusteltua k&auml;ytt&auml;&auml; sellaisia jokap&auml;iv&auml;isi&auml; &auml;&auml;ni&auml;, joihin useimmat ovat tottuneet. Tutkimuksessa ei ole esitetty kovinkaan konkreettisia esimerkkej&auml; (muutamia sovelluksia lukuunottamatta): t&auml;m&auml; on perusteltua siksi, ett&auml; alalta puuttuu kokonaisuuden kattava teoria. Juuri t&auml;st&auml; syyst&auml; tutkimusmenetelm&auml;ksi on valittu k&auml;sitteellinen synteesi. Aihetta olisi voitu k&auml;sitell&auml; my&ouml;s kaupallisen nykytekniikan n&auml;k&ouml;kulmasta, jolloin saavutettu hy&ouml;ty olisi ehk&auml; ollut selvemmin osoitettavissa. N&auml;in ei kuitenkaan haluttu tehd&auml;: inhimillisen n&auml;k&ouml;kulman merkityst&auml; ei voi liikaa painottaa. Tekniikan on aina taivuttava ihmisen hyv&auml;ksi, eik&auml; se saa rajoittaa toteutusta.</p>
<table id="table-2" summary="Tutkimuksen keskeisimm&auml;t tulokset">
<caption>TAULUKKO 2. Tutkimuksen tulokset <a title="takaisin sis&auml;llysluetteloon" href="#toc-table_2">^</a></caption>
<colgroup>
<col class="problemCol" />
<col class="resultCol" /></colgroup>
<thead>
<tr>
<th scope="col">Ongelma</th>
<th scope="col">Tulokset</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>1. Spatiaalinen &auml;&auml;ni piiloinformaation v&auml;litt&auml;j&auml;n&auml;</td>
<td>
<ul>
<li>&Auml;&auml;nitapahtumien on noudatettava v&auml;liaikaista jaksollista rakennetta.</li>
<li>Toteutus on teknisesti mahdollinen.</li>
<li>Spatiaalinen &auml;&auml;ni osoittaa, minne katsoa.</li>
<li>Informaatiota voidaan j&auml;rjestell&auml; 360 asteen alueelle, jolloin visuaalisen informaation m&auml;&auml;r&auml; v&auml;henee.</li>
<li>K&auml;ytt&ouml;liittym&auml;n &auml;&auml;net voidaan luokitella spatiaalisiin perus&auml;&auml;niin, &auml;&auml;nellisiin maamerkkeihin ja signaaleihin, jolloin saadaan vihjeit&auml; tietyn akustisen tilan ominaisuuksista ja objektien sijainneista tietyss&auml; kontekstissa.</li>
</ul>
</td>
</tr>
<tr>
<td>2. K&auml;ytt&ouml;liittym&auml;n ulkopuolinen spatiaalinen &auml;&auml;ni</td>
<td>
<ul>
<li>Elokuvallisten &auml;&auml;niefektien k&auml;ytt&ouml;.</li>
</ul>
</td>
</tr>
</tbody>
</table>
<p>Vaikka t&auml;ss&auml; tutkimuksessa esitetyt tulokset saattavat kirjoitushetkell&auml; olla utopiaa kaupallisissa sovelluksissa, se ei kuitenkaan saa olla tekosyy &auml;&auml;nen t&auml;ydelliselle hylk&auml;&auml;miselle k&auml;ytt&ouml;liittymist&auml;. Tutkimuksen p&auml;&auml;tteeksi yhteenvedossa k&auml;yd&auml;&auml;n lyhyesti l&auml;pi tutkimuksen rakenne ja tulokset sek&auml;  pohditaan jatkotutkimusaiheita.</p>
</div>
<div id="ch-6">
<h3>6. Yhteenveto <a title="takaisin sis&auml;llysluetteloon" href="#toc-6">^</a></h3>
<p>Tutkimuksessa on tarkasteltu spatiaalista &auml;&auml;nt&auml; graafisen k&auml;ytt&ouml;liittym&auml;n laajentajana. &Auml;&auml;nt&auml; ei ole toistaiseksi hy&ouml;dynnetty k&auml;ytt&ouml;liittym&auml;ss&auml; riitt&auml;v&auml;sti. Tarkoituksena on ollut selvitt&auml;&auml;, (a) miten spatiaalista &auml;&auml;nt&auml; voitaisiin k&auml;ytt&auml;&auml; tehokkaasti grafiikan kanssa piiloinformaation v&auml;litt&auml;misess&auml; ja teht&auml;v&auml;n suorituksessa ja (b) miten sellaista &auml;&auml;nt&auml;, jolla ei ole selv&auml;&auml; vastinetta k&auml;ytt&ouml;liittym&auml;ss&auml;, voitaisiin k&auml;ytt&auml;&auml; piilossa olevan informaation esitt&auml;misess&auml;. K&auml;sitteellis-teoreettisen analyysin avulla on pyritty sijoittamaan keskeiset k&auml;sitteet laajempaan viitekehykseen. Tutkimukseen on sis&auml;llytetty my&ouml;s &auml;&auml;nten luokitteluj&auml;rjestelmien vertailu.</p>
<p>Tutkimus on jakaantunut kahteen p&auml;&auml;teemaan: (a) spatiaalisen &auml;&auml;nen tuottamaan merkityssis&auml;lt&ouml;&ouml;n ja (b) ymp&auml;rist&ouml;n spatiaalisten &auml;&auml;nten hy&ouml;dynt&auml;miseen ja liitt&auml;miseen k&auml;ytt&ouml;liittym&auml;n objekteihin ja toimintoihin. Taustaolettamuksena on ollut, ett&auml; kuuloaistin funktiona on &auml;&auml;nen suunnan havaitseminen ja &auml;&auml;nil&auml;hteen tunnistaminen. Tutkimuksessa on vertailtu ensin kuulo- ja n&auml;k&ouml;aistia, m&auml;&auml;ritelty &auml;&auml;nen paikantamiseen vaikuttavat seikat, esitetty sitten synteettisen spatialisoinnin yleisperiaate ja toteutukseen liittyv&auml;t ongelmat. Keskeisimpi&auml; ongelmia toteutuksessa ovat peilikuva&auml;&auml;net, paikantamisvirheet ja tietokoneen suorituskyvyn ylitt&auml;v&auml; datam&auml;&auml;r&auml;. Paikantamisvirheet aiheutuvat ep&auml;tarkasti mitatusta siirtofunktiosta. Psykoakustisen tarkastelun j&auml;lkeen &auml;&auml;nt&auml; on tarkasteltu k&auml;ytt&ouml;liittym&auml;kontekstissa semioottisessa viitekehyksess&auml;.</p>
<p>Tulokset osoittavat, ett&auml; spatiaalinen &auml;&auml;ni voi tuoda uuden ulottuvuuden niihin funktioihin, joissa &auml;&auml;ni voi k&auml;ytt&ouml;liittym&auml;ss&auml; toimia. T&auml;ll&ouml;in spatiaaliset &auml;&auml;ni-ikonit voivat tarjota vihjeit&auml; navigoinnille, tarjoamalla tietoa esimerkiksi akustisen tilan koosta tai &auml;&auml;nellisest&auml; maamerkist&auml;, joka viittaa tiettyyn kontekstiin. Sen lis&auml;ksi, ett&auml; spatiaalinen &auml;&auml;ni osoittaa minne katsoa, se voi v&auml;litt&auml;&auml; hienovaraista informaatiota prosessin kulusta, akustisen tilan ominaisuuksista tai tapahtuman kiireellisyydest&auml; &auml;&auml;nen sijainnin ja kategorian avulla. T&auml;rke&auml;&auml; &auml;&auml;nen k&auml;yt&ouml;ss&auml; ovat audiovisuaalisen sopimuksen ja v&auml;liaikaisen jaksollisen rakenteen huomioon ottaminen. Tutkimuksen perusteella on selv&auml;&auml;, ett&auml; mik&auml;li &auml;&auml;ni&auml; halutaan menestyksellisesti liitt&auml;&auml; k&auml;ytt&ouml;liittym&auml;n toimintoihin, on otettava huomioon jokap&auml;iv&auml;inen kuunteleminen, spatiaalisen &auml;&auml;nen mahdollistama suuntautuminen &auml;&auml;nen suuntaan sek&auml; &auml;&auml;nitapahtuman ominaisuuksien havaitseminen.</p>
<p>Teoreettisen tarkastelun j&auml;lkeen on otettava konkreettisempi n&auml;k&ouml;kulma. Jatkossa on t&auml;rke&auml;&auml; empiirisesti tutkia sit&auml;, miten t&auml;m&auml;n tutkimuksen perusteella spatiaalisia ymp&auml;rist&ouml;n &auml;&auml;ni&auml; voitaisiin -- k&auml;yt&auml;nn&ouml;n tasolla -- kytke&auml; k&auml;ytt&ouml;liittym&auml;n tapahtumiin. Jatkotutkimusaiheita on runsaasti psykoakustiikan, k&auml;yt&auml;nn&ouml;n sovellusten ja akustisen ekologian piiriss&auml;. N&auml;ist&auml; akustinen ekologia tarjonnee suurimmat haasteet ja hy&ouml;dyt, koska akustisen ymp&auml;rist&ouml;mme &auml;&auml;nten k&auml;ytt&auml;minen k&auml;ytt&ouml;liittym&auml;ss&auml; voi johtaa intuitiiviseen lopputulokseen.</p>
<p>Erityisesti liikkuvan tietojenk&auml;sittelyn yleistymisen ja laitteiden n&auml;ytt&ouml;jen pienentymisen seurauksena osa visuaalisesta informaatiosta on korvattava &auml;&auml;nen avulla. T&auml;ll&ouml;in spatiaalinen &auml;&auml;ni tarjoaa 360 asteen ulottuvuuden informaation esitt&auml;miseen. &Auml;&auml;nen k&auml;ytt&ouml; k&auml;ytt&ouml;liittymiss&auml; tulee melko varmasti lis&auml;&auml;ntym&auml;&auml;n tulevaisuudessa huimasti. Toiveena tietenkin on, ett&auml; spatiaalisen &auml;&auml;nimaailman kehitys ja hyv&auml;ksik&auml;ytt&ouml; voi murtaa n&auml;k&ouml;aistin ylivallan ja saattaa virtuaalitodellisuuden l&auml;hemm&auml;ksi todellisuutta -- audiovisuaalisen sopimuksen mukaisesti.</p>
</div>
<div id="refs">
<h3>L&auml;hteet <a title="takaisin sis&auml;llysluetteloon" href="#toc-refs">^</a></h3>
<ol>
<li id="note-1"><a href="#ref-1" title="">^</a> Ackerman, M. S., Starr, B., Hindus, D. &amp; Mainwaring, S. D. 1997. Hanging on the 'wire: a field study of an audio-only media space. ACM Transactions on Computer-Human Interaction, 4(1), 39--66.</li>
<li id="note-2"><a href="#ref-2" title="">^</a> Albers, M. C., Bergman, E. 1995. The audible web: auditory enhancements for Mosaic. Teoksessa Conference companion on Human factors in computing systems, Denver, CO, USA, May 7--11, 1995, New York: ACM Press, 318--319.</li>
<li id="note-3"><a href="#ref-3" title="">^</a> Alten, S. R. 1999. Audio in media. 5. painos. USA: Wadsworth publishing company.</li>
<li id="note-4">^ <a href="#ref-4_0" title=""><sup>a</sup></a> <a href="#ref-4_1" title=""><sup>b</sup></a> <a href="#ref-4_2" title=""><sup>c</sup></a> <a href="#ref-4_3" title=""><sup>d</sup></a> Anderson, J. R. 1980/2000. Cognitive psychology and its implications. 5. painos. New York: Worth Publishers.</li>
<li id="note-5"><a href="#ref-5" title="">^</a> Arons, B. 1992. A Review of the cocktail party effect. Journal of the American Voice I/O Society, 12 (July 1992), 35--50.</li>
<li id="note-6">^ <a href="#ref-6_0" title=""><sup>a</sup></a> <a href="#ref-6_1" title=""><sup>b</sup></a> <a href="#ref-6_2" title=""><sup>c</sup></a>  Ballas, J. A. 1993. Common factors in the identification of an assortment of brief everyday sounds. Journal of Experimental Psychology: Human Perception and Performance, 19(2), 250--267.</li>
<li id="note-7"><a href="#ref-7" title="">^</a> Ballas, J. A. 1994. Delivery of information through sound. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification and Auditory Interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 79--94.</li>
<li id="note-8">^ <a href="#ref-8_0" title=""><sup>a</sup></a> <a href="#ref-8_1" title=""><sup>b</sup></a> <a href="#ref-8_2" title=""><sup>c</sup></a> <a href="#ref-8_3" title=""><sup>d</sup></a> Ballas, J. A. &amp; Howard, J. A., Jr. 1987. Interpreting the language of environmental sounds. Environment and Behavior, 19(1), 91--114.</li>
<li id="note-9"><a href="#ref-9" title="">^</a> Ballas, J. A. &amp; Mullins, R. T. 1991. Effects of context on the identification of everyday sounds. Human Performance, 4(3), 199--219.</li>
<li  id="note-10"><a href="#ref-10" title="">^</a> Barger, R. 1994. Pattern and reference in auditory display. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification and Auditory interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 151--165.</li>
<li id="note-11">^ <a href="#ref-11_0" title=""><sup>a</sup></a> <a href="#ref-11_1" title=""><sup>b</sup></a> Beaudouin--Lafon, M., Gaver, W. 1994. ENO: Synthesizing structured sound spaces. Teoksessa Proceedings of the Seventh Annual Symposium on User Interface Software and Technology, Marina del Rey, CA, USA, Nov. 2--4, 1994, New York: ACM Press, 49--57.</li>
<li id="note-12">^ <a href="#ref-12_0" title=""><sup>a</sup></a> <a href="#ref-12_1" title=""><sup>b</sup></a> <a href="#ref-12_2" title=""><sup>c</sup></a> <a href="#ref-12_3" title=""><sup>d</sup></a> <a href="#ref-12_4" title=""><sup>e</sup></a> <a href="#ref-12_5" title=""><sup>f</sup></a> <a href="#ref-12_6" title=""><sup>g</sup></a> <a href="#ref-12_7" title=""><sup>h</sup></a> <a href="#ref-12_8" title=""><sup>i</sup></a> Begault, D. R. 1991. Challenges to the successful implementation of 3-D sound. Journal of the Audio Engineering Society, 39(11), 864--870.</li>
<li id="note-13">^ <a href="#ref-13_0" title=""><sup>a</sup></a> <a href="#ref-13_1" title=""><sup>b</sup></a> <a href="#ref-13_2" title=""><sup>c</sup></a> <a href="#ref-13_3" title=""><sup>d</sup></a> Begault, D. R. 1994. 3-D sound for virtual reality and multimedia. Cambridge MA: Academic Press.</li>
<li id="note-14"><a href="#ref-14" title="">^</a> Begault, D. R. 1999. Auditory and non-auditory factors that potentially influence virtual acoustic imagery. Teoksessa Proceedings of the Audio Engineering Society 16th international conference on spatial sound reproduction, Rovaniemi, Finland, April 10--12, 1999, 13--26.</li>
<li id="note-15"><a href="#ref-15" title="">^</a> Blattner, M. M., Greenberg, R. M. &amp; Kamegai, M. 1992. Listening to turbulence: an example of scientific audiolization. Teoksessa M. Blattner &amp; R. Dannenberg (toim.) Multimedia Interface Design, New York: ACM Press, 87--102.</li>
<li id="note-16">^ <a href="#ref-16_0" title=""><sup>a</sup></a> <a href="#ref-16_1" title=""><sup>b</sup></a> <a href="#ref-16_2" title=""><sup>c</sup></a> <a href="#ref-16_3" title=""><sup>d</sup></a> <a href="#ref-16_4" title=""><sup>e</sup></a> <a href="#ref-16_5" title=""><sup>f</sup></a> <a href="#ref-16_6" title=""><sup>g</sup></a> <a href="#ref-16_7" title=""><sup>h</sup></a> <a href="#ref-16_8" title=""><sup>i</sup></a> <a href="#ref-16_9" title=""><sup>j</sup></a> <a href="#ref-16_10" title=""><sup>k</sup></a> <a href="#ref-16_11" title=""><sup>l</sup></a> <a href="#ref-16_12" title=""><sup>m</sup></a> Blattner, M. M., Papp III, A. L. &amp; Glinert, E. P. 1994. Sonic enhancements of two-dimensional graphic displays. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification, and Auditory Interfaces, Reading, MA, USA: Addison Wesley Publishing Company, 447--470.</li>
<li id="note-17">^ <a href="#ref-17_0" title=""><sup>a</sup></a> <a href="#ref-17_1" title=""><sup>b</sup></a> Blattner, M. M. &amp; Sumikawa, D. A. &amp; Greenberg, R. M. 1989. Earcons and icons: Their structure and common design principles. Human-Computer Interaction 4(1), 11--44.</li>
<li id="note-18">^ <a href="#ref-18_0" title=""><sup>a</sup></a> <a href="#ref-18_1" title=""><sup>b</sup></a> <a href="#ref-18_2" title=""><sup>c</sup></a> Bly, S. 1982. Presenting information in sound.  Teoksessa Proceedings on Human Factors in Computer Systems, Gaithersburg, Maryland, USA, 1982, New York: ACM Press, 371--375.</li>
<li id="note-19">^ <a href="#ref-19_0" title=""><sup>a</sup></a> <a href="#ref-19_1" title=""><sup>b</sup></a> <a href="#ref-19_2" title=""><sup>c</sup></a> Bregman, A. S. &amp; Campbell, J. 1971. Primary auditory stream segregation and perception of order in rapid sequences of tones. Journal of Experimental Psychology, 89(2), 244--249.</li>
<li id="note-20"><a href="#ref-20" title="">^</a> Brewster, S. A. 1991. Providing a model for the use of sound in user interfaces. (Tech. Rep. No. YCS169). University of York, Department of Computer Science, 1--54.</li>
<li id="note-21">^ <a href="#ref-21_0" title=""><sup>a</sup></a> <a href="#ref-21_1" title=""><sup>b</sup></a> <a href="#ref-21_2" title=""><sup>c</sup></a> <a href="#ref-21_3" title=""><sup>d</sup></a> Brewster, S. A. 1994. Providing a structured method for integrating non-speech audio into human-computer interfaces. University of York, UK. V&auml;it&ouml;skirja.</li>
<li id="note-22">^ <a href="#ref-22_0" title=""><sup>a</sup></a> <a href="#ref-22_1" title=""><sup>b</sup></a> Brewster, S. A., Wright, P. C. &amp; Edwards, A. D. N. 1993. An evaluation of earcons for use in auditory human-computer interfaces. Teoksessa Proceedings of the Conference on Human Factors in Computing Systems, Amsterdam, The Netherlands, April 1993, Boston: Addison--Wesley Longman Publishing Company, 222--227.</li>
<li id="note-23"><a href="#ref-23" title="">^</a> Brewster, S. A., Wright, P. C., Dix, A. J. &amp; Edwards, A. D. N. 1995. The sonic enhancement of graphical buttons. Teoksessa K. Nordby, P. Helmersen, D. Gilmore, &amp; S. Arnesen (toim.) Proceedings of the IFIP International Conference on Human-Computer Interaction, Lillehammer, Norway, June 25--29, 1995, London: Chapman &amp; Hall, 43--48.</li>
<li id="note-24"><a href="#ref-24" title="">^</a> Brewster, S. A., Wright, P. C &amp; Edwards, A. D. N. 1995. The application of a method for integrating non-speech audio into human-computer interfaces. (Tech. Rep. No. YCS253). University of York, Department of Computer Science, 1--19.</li>
<li id="note-25">^ <a href="#ref-25_0" title=""><sup>a</sup></a> <a href="#ref-25_1" title=""><sup>b</sup></a> Brewster, S.A., Leplatre, G. &amp; Crease, M.G. 1998. Using non-speech sounds in mobile computing devices. Teoksessa C. Johnson (toim.) Proceedings of the First Workshop on Human Computer Interaction with Mobile Devices, Glasgow, UK, Department of Computing Science, University of Glasgow, May 21--23, 1998, 26--29.</li>
<li id="note-26"><a href="#ref-26" title="">^</a> Broadbent, D. E. 1958. Perception and communication. New York: Pergamon.</li>
<li id="note-27">^ <a href="#ref-27_0" title=""><sup>a</sup></a> <a href="#ref-27_1" title=""><sup>b</sup></a> <a href="#ref-27_2" title=""><sup>c</sup></a> <a href="#ref-27_3" title=""><sup>d</sup></a> Brown, M. L., Newsome, S. L. &amp; Glinert, E. P. 1989. An experiment into the use of auditory cues to reduce visual workload. Teoksessa Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Austin, TX, USA, April 30--May 4, 1989, New York: ACM Press, 339--346.</li>
<li id="note-28">^ <a href="#ref-28_0" title=""><sup>a</sup></a> <a href="#ref-28_1" title=""><sup>b</sup></a> Burgess, D. A. 1992a. Real-time audio spatialization with inexpensive hardware. Teoksessa Proceedings of the Third International Conference on Signal Processing Applications and Technology, Boston, MA, USA, Nov 2--5, 1992.</li>
<li id="note-29">^ <a href="#ref-29_0" title=""><sup>a</sup></a> <a href="#ref-29_1" title=""><sup>b</sup></a> <a href="#ref-29_2" title=""><sup>c</sup></a> <a href="#ref-29_3" title=""><sup>d</sup></a> <a href="#ref-29_4" title=""><sup>e</sup></a> <a href="#ref-29_5" title=""><sup>f</sup></a> <a href="#ref-29_6" title=""><sup>g</sup></a> <a href="#ref-29_7" title=""><sup>h</sup></a> <a href="#ref-29_8" title=""><sup>i</sup></a> <a href="#ref-29_9" title=""><sup>j</sup></a> <a href="#ref-29_10" title=""><sup>k</sup></a> <a href="#ref-29_11" title=""><sup>l</sup></a> <a href="#ref-29_12" title=""><sup>m</sup></a> <a href="#ref-29_13" title=""><sup>n</sup></a> <a href="#ref-29_14" title=""><sup>o</sup></a> <a href="#ref-29_15" title=""><sup>p</sup></a> Burgess, D. A. 1992b. Techniques for low cost spatial audio. Teoksessa Proceedings of the fifth annual ACM symposium on user interface software and technology, Monteray, CA, USA, Nov. 15--18, 1992, New York: ACM Press, 53--59.</li>
<li id="note-30"><a href="#ref-30" title="">^</a> Buxton, W. 1989. Introduction to this special issue on nonspeech audio. Human-Computer Interaction, 4(1), 1--9.</li>
<li id="note-31">^ <a href="#ref-31_0" title=""><sup>a</sup></a> <a href="#ref-31_1" title=""><sup>b</sup></a> Buxton, W. 1990. Using our ears: an introduction to the use of nonspeech audio cues. Teoksessa E. J. Farrell (toim.) Extracting Meaning from Complex Data: Processing, Display, Interaction, Vol. 1259, 124--127.</li>
<li id="note-32"><a href="#ref-32" title="">^</a> Carter, R. C. 1982. Visual search with color. Journal of Experimental Psychology: Human Perception and Performance, 8(1), 127--136.</li>
<li id="note-33">^ <a href="#ref-33_0" title=""><sup>a</sup></a> <a href="#ref-33_1" title=""><sup>b</sup></a> <a href="#ref-33_2" title=""><sup>c</sup></a> <a href="#ref-33_3" title=""><sup>d</sup></a> <a href="#ref-33_4" title=""><sup>e</sup></a> <a href="#ref-33_5" title=""><sup>f</sup></a> <a href="#ref-33_6" title=""><sup>g</sup></a> <a href="#ref-33_7" title=""><sup>h</sup></a> <a href="#ref-33_8" title=""><sup>i</sup></a> <a href="#ref-33_9" title=""><sup>j</sup></a> <a href="#ref-33_10" title=""><sup>k</sup></a> <a href="#ref-33_11" title=""><sup>l</sup></a> <a href="#ref-33_12" title=""><sup>m</sup></a> <a href="#ref-33_13" title=""><sup>n</sup></a> <a href="#ref-33_14" title=""><sup>o</sup></a> <a href="#ref-33_15" title=""><sup>p</sup></a> <a href="#ref-33_16" title=""><sup>q</sup></a> <a href="#ref-33_17" title=""><sup>r</sup></a> <a href="#ref-33_18" title=""><sup>s</sup></a> <a href="#ref-33_19" title=""><sup>t</sup></a> <a href="#ref-33_20" title=""><sup>u</sup></a> <a href="#ref-33_21" title=""><sup>v</sup></a> <a href="#ref-33_22" title=""><sup>w</sup></a> <a href="#ref-33_23" title=""><sup>x</sup></a> <a href="#ref-33_24" title=""><sup>y</sup></a> <a href="#ref-33_25" title=""><sup>z</sup></a> <a href="#ref-33_26" title=""><sup>1</sup></a> <a href="#ref-33_27" title=""><sup>2</sup></a> Chion, Michel. 1990. Audio-vision: sound on screen. New York: Columbia University Press.</li>
<li id="note-34"><a href="#ref-34" title="">^</a> Cohen, J. 1993. "Kirk here": Using genre sounds to monitor background activity. Teoksessa S. Ashlund, K. Mullet, A. Henderson, E. Hollnagel, &amp; T. White (toim.) Proceedings of the Conference on Human Factors in Computing Systems, Amsterdam, The Netherlands, Apr. 24--29, 1993, New York: ACM Press, 63--64.</li>
<li id="note-35">^ <a href="#ref-35_0" title=""><sup>a</sup></a> <a href="#ref-35_1" title=""><sup>b</sup></a> Cohen, J. 1994. Monitoring background activities. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification and Auditory Interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 499--531.</li>
<li id="note-36"><a href="#ref-36" title="">^</a> Dannenberg, R. &amp; Blattner, M. 1992. Introduction: the trend toward multimedia interfaces. Teoksessa M. Blattner &amp; R. Dannenberg (toim.) Multimedia Interface Design, New York: ACM Press, xvii--xxv.</li>
<li id="note-37">^ <a href="#ref-37_0" title=""><sup>a</sup></a> <a href="#ref-37_1" title=""><sup>b</sup></a> Deutsch, D. 1980. The processing of structured and unstructured tonal sequences. Perception and psychophysics, 28(5), 381--389.</li>
<li id="note-38">^ <a href="#ref-38_0" title=""><sup>a</sup></a> <a href="#ref-38_1" title=""><sup>b</sup></a> Edwards, A. D. N. 1988. The design of auditory interfaces for visually disabled users. Teoksessa Proceedings of the Conference on Human Factors and Computing Systems, Washington D.C., USA, May 1988, New York: ACM Press, 83--88.</li>
<li id="note-39"><a href="#ref-39" title="">^</a> Fernstr&ouml;m, M. &amp; Bannon, L. Multimedia browsing. 1997. Position paper for the CHI'97, Workshop on Navigation on Electronic Worlds, Atlanta, GA, USA, March 23--24, 1997, 1--10.</li>
<li id="note-40">^ <a href="#ref-40_0" title=""><sup>a</sup></a> <a href="#ref-40_1" title=""><sup>b</sup></a> <a href="#ref-40_2" title=""><sup>c</sup></a> <a href="#ref-40_3" title=""><sup>d</sup></a> <a href="#ref-40_4" title=""><sup>e</sup></a> <a href="#ref-40_5" title=""><sup>f</sup></a> <a href="#ref-40_6" title=""><sup>g</sup></a> Fiske, J. 2000. Merkkien kieli: johdatus viestinn&auml;n tutkimiseen. Suomeksi toimittaneet V. Pietil&auml;, R. Suikkanen &amp; T. Uusitupa. 6. painos. Jyv&auml;skyl&auml;: Gummerus Kirjapaino Oy.</li>
<li id="note-41">^ <a href="#ref-41_0" title=""><sup>a</sup></a> <a href="#ref-41_1" title=""><sup>b</sup></a> <a href="#ref-41_2" title=""><sup>c</sup></a> <a href="#ref-41_3" title=""><sup>d</sup></a> <a href="#ref-41_4" title=""><sup>e</sup></a> <a href="#ref-41_5" title=""><sup>f</sup></a> Fitch, W. T. &amp; Kramer, G. 1994. Sonifying the body electric: superiority of an auditory over a visual display in a complex, multivariate system. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification, and Auditory Interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 307--326.</li>
<li id="note-42">^ <a href="#ref-42_0" title=""><sup>a</sup></a> <a href="#ref-42_1" title=""><sup>b</sup></a> <a href="#ref-42_2" title=""><sup>c</sup></a> <a href="#ref-42_3" title=""><sup>d</sup></a> <a href="#ref-42_4" title=""><sup>e</sup></a> <a href="#ref-42_5" title=""><sup>f</sup></a> Gaver, W.W. 1986. Auditory icons: Using sound in computer interfaces. Human-Computer Interaction, 2(1), 167--177.</li>
<li id="note-43">^ <a href="#ref-43_0" title=""><sup>a</sup></a> <a href="#ref-43_1" title=""><sup>b</sup></a> <a href="#ref-43_2" title=""><sup>c</sup></a> <a href="#ref-43_3" title=""><sup>d</sup></a> <a href="#ref-43_4" title=""><sup>e</sup></a> <a href="#ref-43_5" title=""><sup>f</sup></a> <a href="#ref-43_6" title=""><sup>g</sup></a> <a href="#ref-43_7" title=""><sup>h</sup></a> <a href="#ref-43_8" title=""><sup>i</sup></a> <a href="#ref-43_9" title=""><sup>j</sup></a> <a href="#ref-43_10" title=""><sup>k</sup></a> <a href="#ref-43_11" title=""><sup>l</sup></a> <a href="#ref-43_12" title=""><sup>m</sup></a> <a href="#ref-43_13" title=""><sup>n</sup></a> <a href="#ref-43_14" title=""><sup>o</sup></a> <a href="#ref-43_15" title=""><sup>p</sup></a> <a href="#ref-43_16" title=""><sup>q</sup></a> <a href="#ref-43_17" title=""><sup>r</sup></a> <a href="#ref-43_18" title=""><sup>s</sup></a> <a href="#ref-43_19" title=""><sup>t</sup></a> <a href="#ref-43_20" title=""><sup>u</sup></a> <a href="#ref-43_21" title=""><sup>v</sup></a> <a href="#ref-43_22" title=""><sup>w</sup></a> <a href="#ref-43_23" title=""><sup>x</sup></a> Gaver, W.W. 1989. The Sonicfinder: an interface that uses auditory icons. Human-Computer Interaction, 4(1), 67--94.</li>
<li id="note-44">^ <a href="#ref-44_0" title=""><sup>a</sup></a> <a href="#ref-44_1" title=""><sup>b</sup></a> Gaver, W.W. 1993a. How do we hear in the world?: explorations in ecological acoustics. Ecological Psychology 5(4), 285--313.</li>
<li id="note-45">^ <a href="#ref-45_0" title=""><sup>a</sup></a> <a href="#ref-45_1" title=""><sup>b</sup></a> Gaver, W. W. 1993b. Synthesizing auditory icons. Teoksessa Proceedings of INTERCHI'93 Conference on Human Factors in Computing Systems, Amsterdam, The Netherlands, Apr. 24--29, 1993, Reading, MA, USA: ACM Press/Addison--Wesley, 24--29.</li>
<li id="note-46">^ <a href="#ref-46_0" title=""><sup>a</sup></a> <a href="#ref-46_1" title=""><sup>b</sup></a> <a href="#ref-46_2" title=""><sup>c</sup></a> <a href="#ref-46_3" title=""><sup>d</sup></a> <a href="#ref-46_4" title=""><sup>e</sup></a> <a href="#ref-46_5" title=""><sup>f</sup></a> <a href="#ref-46_6" title=""><sup>g</sup></a> <a href="#ref-46_7" title=""><sup>h</sup></a> <a href="#ref-46_8" title=""><sup>i</sup></a> <a href="#ref-46_9" title=""><sup>j</sup></a> <a href="#ref-46_10" title=""><sup>k</sup></a> <a href="#ref-46_11" title=""><sup>l</sup></a> <a href="#ref-46_12" title=""><sup>m</sup></a> <a href="#ref-46_13" title=""><sup>n</sup></a> Gaver, W. W. 1993c. What in the world do we hear? An ecological approach to auditory source perception. Ecological Psychology 5(1), 1--29.</li>
<li id="note-47">^ <a href="#ref-47_0" title=""><sup>a</sup></a>  <a href="#ref-47_1" title=""><sup>b</sup></a> Gaver, W. W., Smith, R. B. &amp; O'Shea T. 1991. Effective sounds in complex systems: the ARKOLA simulation. Teoksessa Proceedings of the Conference on Human Factors in Computer Systems, New Orleans, Louisiana, USA, April 28--May 2, 1991, Reading, MA, USA: ACM Press/Addison--Wesley, 85--90.</li>
<li id="note-48">^ <a href="#ref-48_0" title=""><sup>a</sup></a> <a href="#ref-48_1" title=""><sup>b</sup></a> <a href="#ref-48_2" title=""><sup>c</sup></a> <a href="#ref-48_3" title=""><sup>d</sup></a> <a href="#ref-48_4" title=""><sup>e</sup></a> <a href="#ref-48_5" title=""><sup>f</sup></a> <a href="#ref-48_6" title=""><sup>g</sup></a> <a href="#ref-48_7" title=""><sup>h</sup></a> <a href="#ref-48_8" title=""><sup>i</sup></a> <a href="#ref-48_9" title=""><sup>j</sup></a> <a href="#ref-48_10" title=""><sup>k</sup></a> <a href="#ref-48_11" title=""><sup>l</sup></a> <a href="#ref-48_12" title=""><sup>m</sup></a> <a href="#ref-48_13" title=""><sup>n</sup></a> <a href="#ref-48_14" title=""><sup>o</sup></a> <a href="#ref-48_15" title=""><sup>p</sup></a> <a href="#ref-48_16" title=""><sup>q</sup></a> <a href="#ref-48_17" title=""><sup>r</sup></a> Gibson, J. J. 1966. The senses considered as perceptual systems. Boston: Houghton Mifflin.</li>
<li id="note-49">^ <a href="#ref-49_0" title=""><sup>a</sup></a> <a href="#ref-49_1" title=""><sup>b</sup></a> <a href="#ref-49_2" title=""><sup>c</sup></a> <a href="#ref-49_3" title=""><sup>d</sup></a> <a href="#ref-49_4" title=""><sup>e</sup></a> <a href="#ref-49_5" title=""><sup>f</sup></a> <a href="#ref-49_6" title=""><sup>g</sup></a> <a href="#ref-49_7" title=""><sup>h</sup></a> Goldstein, E. B. 1999. Sensation &amp; perception. 5. painos. USA: Brooks/Cole Publishing Company.</li>
<li id="note-50">^ <a href="#ref-50_0" title=""><sup>a</sup></a> <a href="#ref-50_1" title=""><sup>b</sup></a> <a href="#ref-50_2" title=""><sup>c</sup></a> <a href="#ref-50_3" title=""><sup>d</sup></a> <a href="#ref-50_4" title=""><sup>e</sup></a> <a href="#ref-50_5" title=""><sup>f</sup></a> Goose, S. &amp; M&ouml;ller, C. 1999. A 3D audio only interactive Web browser: using spatialization to convey hypermedia document structure. Teoksessa Proceedings of the seventh ACM International Conference on Multimedia, Orlando, Florida, USA, Oct. 30--Nov. 5, 1999, New York: ACM Press, 363--371.</li>
<li id="note-51">^ <a href="#ref-51_0" title=""><sup>a</sup></a> <a href="#ref-51_1" title=""><sup>b</sup></a> <a href="#ref-51_2" title=""><sup>c</sup></a> <a href="#ref-51_3" title=""><sup>d</sup></a> <a href="#ref-51_4" title=""><sup>e</sup></a> <a href="#ref-51_5" title=""><sup>f</sup></a> <a href="#ref-51_6" title=""><sup>g</sup></a> Hereford, J &amp; Winn, W. 1994. Non-speech sound in human-computer interaction: A review and design guidelines. Journal of Educational Computing Research, 11(3), 211--233.</li>
<li id="note-52">^  <a href="#ref-52_0" title=""><sup>a</sup></a> <a href="#ref-52_1" title=""><sup>b</sup></a> <a href="#ref-52_2" title=""><sup>c</sup></a> <a href="#ref-52_3" title=""><sup>d</sup></a> <a href="#ref-52_4" title=""><sup>e</sup></a> <a href="#ref-52_5" title=""><sup>f</sup></a> <a href="#ref-52_6" title=""><sup>g</sup></a> <a href="#ref-52_7" title=""><sup>h</sup></a> Howard, J. H., Jr., &amp; Ballas, J. A. 1980. Syntactic and semantic factors in the classification of nonspeech transient patterns. Perception &amp; Psychophysics, 28(5), 431--439.</li>
<li id="note-53">^ <a href="#ref-53_0" title=""><sup>a</sup></a> <a href="#ref-53_1" title=""><sup>b</sup></a> <a href="#ref-53_2" title=""><sup>c</sup></a> <a href="#ref-53_3" title=""><sup>d</sup></a> <a href="#ref-53_4" title=""><sup>e</sup></a>  Huopaniemi, J. 1999. Virtual acoustics and 3-D sound in multimedia signal processing. Helsingin Teknillinen korkeakoulu. S&auml;hk&ouml;- ja tietoliikennetekniikan osasto, akustiikan ja &auml;&auml;nenk&auml;sittelytekniikan laboratorio. V&auml;it&ouml;skirja.</li>
<li id="note-54">^ <a href="#ref-54_0" title=""><sup>a</sup></a> <a href="#ref-54_1" title=""><sup>b</sup></a> <a href="#ref-54_2" title=""><sup>c</sup></a> <a href="#ref-54_3" title=""><sup>d</sup></a> <a href="#ref-54_4" title=""><sup>e</sup></a> <a href="#ref-54_5" title=""><sup>f</sup></a> <a href="#ref-54_6" title=""><sup>g</sup></a> <a href="#ref-54_7" title=""><sup>h</sup></a> <a href="#ref-54_8" title=""><sup>i</sup></a> <a href="#ref-54_9" title=""><sup>j</sup></a> <a href="#ref-54_10" title=""><sup>k</sup></a> <a href="#ref-54_11" title=""><sup>l</sup></a> <a href="#ref-54_12" title=""><sup>m</sup></a> <a href="#ref-54_13" title=""><sup>n</sup></a> <a href="#ref-54_14" title=""><sup>o</sup></a> <a href="#ref-54_15" title=""><sup>p</sup></a> <a href="#ref-54_16" title=""><sup>q</sup></a> <a href="#ref-54_17" title=""><sup>r</sup></a> <a href="#ref-54_18" title=""><sup>s</sup></a> Jauhiainen, T. 1995. Kuulo ja viestint&auml;. Helsinki: Yliopistopaino.</li>
<li id="note-55">^ <a href="#ref-55_0" title=""><sup>a</sup></a> <a href="#ref-55_1" title=""><sup>b</sup></a> Jones, D. 1993. Objects, streams, and threads of auditory attention. Teoksessa A. Baddeley &amp; L. Weiskrantz (toim.) Attention: Selection, awareness, and control. A tribute to Donald Broadbent, Oxford: Clarendon Press, 87--104.</li>
<li id="note-56">^ <a href="#ref-56_0" title=""><sup>a</sup></a> <a href="#ref-56_1" title=""><sup>b</sup></a> <a href="#ref-56_2" title=""><sup>c</sup></a> <a href="#ref-56_3" title=""><sup>d</sup></a> <a href="#ref-56_4" title=""><sup>e</sup></a> Jot, J.--M. 1997. Real-time spatial processing of sounds for music, multimedia and interactive human-computer interfaces. Multimedia Systems, 7(1), 55--69.</li>
<li id="note-57">^ <a href="#ref-57_0" title=""><sup>a</sup></a> <a href="#ref-57_1" title=""><sup>b</sup></a> <a href="#ref-57_2" title=""><sup>c</sup></a> <a href="#ref-57_3" title=""><sup>d</sup></a> <a href="#ref-57_4" title=""><sup>e</sup></a> <a href="#ref-57_5" title=""><sup>f</sup></a> <a href="#ref-57_6" title=""><sup>g</sup></a> <a href="#ref-57_7" title=""><sup>h</sup></a> <a href="#ref-57_8" title=""><sup>i</sup></a> <a href="#ref-57_9" title=""><sup>j</sup></a> <a href="#ref-57_10" title=""><sup>k</sup></a> <a href="#ref-57_11" title=""><sup>l</sup></a> <a href="#ref-57_12" title=""><sup>m</sup></a> <a href="#ref-57_13" title=""><sup>n</sup></a> <a href="#ref-57_14" title=""><sup>o</sup></a> Kendall, G. 1995. A 3-D sound primer: directional hearing and stereo reproduction. [viitattu 13.5.2002]. Saatavilla www-muodossa <a href="http://www.nwu.edu/musicschool/classes/3D/pages/sndPrmGK.html">http://www.nwu.edu/musicschool/classes/3D/pages/sndPrmGK.html</a>.</li>
<li id="note-58">^  <a href="#ref-58_0" title=""><sup>a</sup></a> <a href="#ref-58_1" title=""><sup>b</sup></a> <a href="#ref-58_2" title=""><sup>c</sup></a> <a href="#ref-58_3" title=""><sup>d</sup></a> <a href="#ref-58_4" title=""><sup>e</sup></a> Kleiner, M., Dalenbeck, B.--I. &amp; Svensson, P. 1993. Auralization -- an overview. Journal of the Audio Engineering Society, 41(11), 861--875.</li>
<li id="note-59">^ <a href="#ref-59_0" title=""><sup>a</sup></a> <a href="#ref-59_1" title=""><sup>b</sup></a> <a href="#ref-59_2" title=""><sup>c</sup></a> <a href="#ref-59_3" title=""><sup>d</sup></a> <a href="#ref-59_4" title=""><sup>e</sup></a> <a href="#ref-59_5" title=""><sup>f</sup></a> <a href="#ref-59_6" title=""><sup>g</sup></a> Kobayashi, M., Schmandt, C. 1997. Dynamic Soundscape: mapping time to space for audio browsing. Teoksessa Conference Proceedings on Human factors in computing systems, Atlanta, GA, USA, March 22--27, 1997, New York: ACM Press, 194--201.</li>
<li id="note-60">^ <a href="#ref-60_0" title=""><sup>a</sup></a> <a href="#ref-60_1" title=""><sup>b</sup></a> <a href="#ref-60_2" title=""><sup>c</sup></a> <a href="#ref-60_3" title=""><sup>d</sup></a> <a href="#ref-60_4" title=""><sup>e</sup></a> <a href="#ref-60_5" title=""><sup>f</sup></a> <a href="#ref-60_6" title=""><sup>g</sup></a> <a href="#ref-60_7" title=""><sup>h</sup></a> <a href="#ref-60_8" title=""><sup>i</sup></a> Kramer, G. 1994. An introduction to auditory display. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification and Auditory interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 1--77.</li>
<li id="note-61">^ <a href="#ref-61_0" title=""><sup>a</sup></a> <a href="#ref-61_1" title=""><sup>b</sup></a> <a href="#ref-61_2" title=""><sup>c</sup></a> Laurel, B. 1991. Computers as theatre. Reading, MA, USA: Addison--Wesley Publishing Company.</li>
<li id="note-62">^ <a href="#ref-62_0" title=""><sup>a</sup></a> <a href="#ref-62_1" title=""><sup>b</sup></a> <a href="#ref-62_2" title=""><sup>c</sup></a> <a href="#ref-62_3" title=""><sup>d</sup></a> Mansur, D. L., Bly S. A., Frysinger, S. P , Lunney, D, Metzrich, J. J. &amp; Morrison, R. C. 1985. Communication with sound (panel session). Teoksessa W. Buxton (toim.) Proceedings on Human Factors in Computing Systems, San Francisco, CA, USA, 1985, New York: ACM Press, 115--119.</li>
<li id="note-63">^ <a href="#ref-63_0" title=""><sup>a</sup></a> <a href="#ref-63_1" title=""><sup>b</sup></a> <a href="#ref-63_2" title=""><sup>c</sup></a> <a href="#ref-63_3" title=""><sup>d</sup></a> <a href="#ref-63_4" title=""><sup>e</sup></a> <a href="#ref-63_5" title=""><sup>f</sup></a> McGrath, D. 1995. High resolution simulation of acoustic environments. [viitattu 13.5.2002]. Saatavilla www-muodossa <a href="http://www.headwize.com/tech/lake1_tech.htm">http://www.headwize.com/tech/lake1_tech.htm</a>.</li>
<li id="note-64"><a href="#ref-64" title="">^</a> Mereu, S. W. &amp; Kazman, R. 1996. Audio enhanced 3D interfaces for visually impaired users. Teoksessa Proceedings on Human Factors in Computing Systems, Vancouver, British Columbia, Canada, Apr. 13--18, 1996, New York: ACM Press, 72--78.</li>
<li id="note-65"><a href="#ref-65" title="">^</a> Mynatt, E. D. &amp; Weber, G. 1994. Nonvisual presentation of graphical user interfaces: contrasting two approaches. Teoksessa Proceedings of the Conference on Human factors in computing systems, Boston, USA, Apr. 24--28, 1994, New York: ACM Press, 166--172.</li>
<li id="note-66">^ <a href="#ref-66_0" title=""><sup>a</sup></a> <a href="#ref-66_1" title=""><sup>b</sup></a> <a href="#ref-66_2" title=""><sup>c</sup></a> <a href="#ref-66_3" title=""><sup>d</sup></a> <a href="#ref-66_4" title=""><sup>e</sup></a> <a href="#ref-66_5" title=""><sup>f</sup></a> <a href="#ref-66_6" title=""><sup>g</sup></a> <a href="#ref-66_7" title=""><sup>h</sup></a> Perrott, D. R., Saberi, K., Brown, K. &amp; Strybel, T. Z. 1990. Auditory psychomotor coordination and visual search performance. Perception &amp; Psychophysics, 48(3), 214--226.</li>
<li id="note-67">^ <a href="#ref-67_0" title=""><sup>a</sup></a> <a href="#ref-67_1" title=""><sup>b</sup></a> <a href="#ref-67_2" title=""><sup>c</sup></a> Saue, S. 2000. A model for interaction in exploratory sonification displays. Teoksessa Proceedings of the International Conference on Auditory Display, Georgia Institute of Technology Atlanta, Georgia, USA, Apr. 2--5, 2000, 1--5.</li>
<li id="note-68">^ <a href="#ref-68_0" title=""><sup>a</sup></a> <a href="#ref-68_1" title=""><sup>b</sup></a> <a href="#ref-68_2" title=""><sup>c</sup></a> <a href="#ref-68_3" title=""><sup>d</sup></a> <a href="#ref-68_4" title=""><sup>e</sup></a> Sawhney, N. &amp; Schmandt, C. 1997. Design of spatialized audio in nomadic environments. Teoksessa Proceedings of the International Conference on Auditory Display, Palo Alto, CA, USA, Nov. 2--5, 1997, 109--113.</li>
<li id="note-69">^ <a href="#ref-69_0" title=""><sup>a</sup></a> <a href="#ref-69_1" title=""><sup>b</sup></a> <a href="#ref-69_2" title=""><sup>c</sup></a> Scaletti, C. &amp; Craig, A. B. 1991. Using sound to extract meaning from complex data. Teoksessa Proceedings SPIE, Vol. 1459, 207--219.</li>
<li id="note-70">^ <a href="#ref-70_0" title=""><sup>a</sup></a> <a href="#ref-70_1" title=""><sup>b</sup></a> Schaeffer, P. 1967. Trait&Atilde;&copy; des objets musicaux. Uudistettu painos. Paris: Seuil.</li>
<li id="note-71">^ <a href="#ref-71_0" title=""><sup>a</sup></a> <a href="#ref-71_1" title=""><sup>b</sup></a> <a href="#ref-71_2" title=""><sup>c</sup></a> <a href="#ref-71_3" title=""><sup>d</sup></a> <a href="#ref-71_4" title=""><sup>e</sup></a> <a href="#ref-71_5" title=""><sup>f</sup></a> <a href="#ref-71_6" title=""><sup>g</sup></a> <a href="#ref-71_7" title=""><sup>h</sup></a> <a href="#ref-71_8" title=""><sup>i</sup></a> <a href="#ref-71_9" title=""><sup>j</sup></a> <a href="#ref-71_10" title=""><sup>k</sup></a> <a href="#ref-71_11" title=""><sup>l</sup></a> <a href="#ref-71_12" title=""><sup>m</sup></a> <a href="#ref-71_13" title=""><sup>n</sup></a> <a href="#ref-71_14" title=""><sup>o</sup></a> <a href="#ref-71_15" title=""><sup>p</sup></a> <a href="#ref-71_16" title=""><sup>q</sup></a> <a href="#ref-71_17" title=""><sup>r</sup></a> <a href="#ref-71_18" title=""><sup>s</sup></a> <a href="#ref-71_19" title=""><sup>t</sup></a> <a href="#ref-71_20" title=""><sup>u</sup></a> <a href="#ref-71_21" title=""><sup>v</sup></a> <a href="#ref-71_22" title=""><sup>w</sup></a> <a href="#ref-71_23" title=""><sup>x</sup></a> <a href="#ref-71_24" title=""><sup>y</sup></a> <a href="#ref-71_25" title=""><sup>z</sup></a> <a href="#ref-71_26" title=""><sup>1</sup></a> <a href="#ref-71_27" title=""><sup>2</sup></a> <a href="#ref-71_28" title=""><sup>3</sup></a> <a href="#ref-71_29" title=""><sup>4</sup></a> <a href="#ref-71_30" title=""><sup>5</sup></a> <a href="#ref-71_31" title=""><sup>6</sup></a> Schafer, R. M. 1977. The tuning of the world. New York: Knopf.</li>
<li id="note-72"><a href="#ref-72" title="">^</a> Schmandt, C. &amp; Mullins, A. 1995. AudioStreamer: exploiting simultaneity for listening. Teoksessa Proceedings of the Conference on Human Factors and Computing Systems, Denver, Colorado, USA, 1995, New York: ACM Press, 218--219.</li>
<li id="note-73"><a href="#ref-73" title="">^</a> Smith, S., Pickett, R. M. &amp; Williams, M. G. 1994. Environments for exploring auditory representations of multidimensional data. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification and Auditory interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 167--183.</li>
<li id="note-74">^ <a href="#ref-74_0" title=""><sup>a</sup></a> <a href="#ref-74_1" title=""><sup>b</sup></a> <a href="#ref-74_2" title=""><sup>c</sup></a> Tarasti, E. 1990. Johdatusta semiotiikkaan: esseit&auml; taiteen ja kulttuurin merkkij&auml;rjestelmist&auml;. Helsinki: Gaudeamus.</li>
<li id="note-75"><a href="#ref-75" title="">^</a> Vanderveer, N. J. 1979. Ecological acoustics: human perception of environmental sounds. Dissertation Abstracts International. 40/09B, 4543. University Microfilms No. 8004002.</li>
<li id="note-76">^ <a href="#ref-76_0" title=""><sup>a</sup></a> <a href="#ref-76_1" title=""><sup>b</sup></a> <a href="#ref-76_2" title=""><sup>c</sup></a> <a href="#ref-76_3" title=""><sup>d</sup></a> Walker, A. &amp; Brewster, S. A. 2000. Spatial audio in small screen device displays. Personal Technologies, 4(2), 1--14.</li>
<li id="note-77">^ <a href="#ref-77_0" title=""><sup>a</sup></a> <a href="#ref-77_1" title=""><sup>b</sup></a> <a href="#ref-77_2" title=""><sup>c</sup></a> Walker, R. 1987. The effects of culture, environment, age, and musical training on choices of visual metaphors for sound. Perception &amp; Psychophysics, 42(5), 491--502.</li>
<li id="note-78">^ <a href="#ref-78_0" title=""><sup>a</sup></a> <a href="#ref-78_1" title=""><sup>b</sup></a> <a href="#ref-78_2" title=""><sup>c</sup></a> Warren, W. &amp; Verbrugge, R. 1984. Auditory perception of breaking and bouncing events: a case study in ecological acoustics. Journal of Experimental Psychology: Human Perception and Performance, 10(5), 704--712.</li>
<li id="note-79">^ <a href="#ref-79_0" title=""><sup>a</sup></a> <a href="#ref-79_1" title=""><sup>b</sup></a> Wenzel, E. M. 1992. Localization in virtual acoustic displays. Presence: Teleoperators and Virtual Environments, 1(1), 80--107.</li>
<li id="note-80">^ <a href="#ref-80_0" title=""><sup>a</sup></a> <a href="#ref-80_1" title=""><sup>b</sup></a> Wenzel, E. M. 1994. Spatial sound and sonification. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification and Auditory interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 127--150.</li>
<li id="note-81">^ <a href="#ref-81_0" title=""><sup>a</sup></a> <a href="#ref-81_1" title=""><sup>b</sup></a> <a href="#ref-81_2" title=""><sup>c</sup></a> Wenzel, E. M., Wightman, F. &amp; Kistler, D. J. 1991. Localization with non-individualized virtual acoustic display cues. Teoksessa Proceedings of the Conference on Human Factors in Computing Systems, New Orleans, Louisiana, USA, Apr. 27--May 2, 1991, New York: ACM Press, 351--359.</li>
<li id="note-82">^ <a href="#ref-82_0" title=""><sup>a</sup></a> <a href="#ref-82_1" title=""><sup>b</sup></a> <a href="#ref-82_2" title=""><sup>c</sup></a> <a href="#ref-82_3" title=""><sup>d</sup></a> Williams, S. M. 1994. Perceptual principles in sound grouping. Teoksessa G. Kramer (toim.) Auditory Display: Sonification, Audification and Auditory interfaces, Reading, MA, USA: Addison--Wesley Publishing Company, 95--125.</li>
<li id="note-83">^ <a href="#ref-83_0" title=""><sup>a</sup></a> <a href="#ref-83_1" title=""><sup>b</sup></a> Wu, J.--R., Duh C.--D., Ouhyoung, M. &amp; Wu, J.--T. 1997. Head motion and latency compensation on localization of 3D sound in virtual reality. Teoksessa Proceedings of the ACM Symposium on Virtual Reality Software and Technology, Lausanne, Switzerland, Sept. 15--17, 1997, New York: ACM Press, 15--20.</li>
</ol>
</div>
